{
  "characters": [
    {
      "name": "Brogy",
      "birthday": "02-01",
      "romanized_name": "Burogī",
      "epithet": "\"Red Ogre\"",
      "affiliation": "Giant Warrior Pirates",
      "role": "Captain",
      "bounty": "1,800,000,000",
      "haki": [
        "Conqueror's Haki",
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Grand Line (Elbaph)",
      "age": 160,
      "height": "2130 cm",
      "image": "Brogy.png",
      "image_offset": {
        "x": 46,
        "y": 5
      },
      "short_bio": "Brogy the Red Ogre is a giant from Elbaph and one of the two captains of the Giant Warrior Pirates alongside Dorry. Once an active and infamous threat in the seas long ago, Brogy became embroiled in a personal duel over a trivial dispute with his best friend and co-captain Dorry. This duel on Little Garden lasted for a century before being interrupted by the arrival of the Straw Hat Pirates and the machinations of Baroque Works. After finally settling their duel the two giant captains returned to Elbaph and their crew, and later became involved in the Egghead Incident to rescue the Straw Hat Pirates and bring them to safety to Elbaph. A century ago his bounty was 100,000,000, but due to years of inflation and a return to active piracy his bounty was updated to 1,800,000,000. He is a major ally of the Straw Hat Pirates during the Little Garden, Egghead, and Elbaph Arcs. However, after being transformed into a demon by Imu, he became a minor antagonist during the Elbaph Arc."
    },
    {
      "name": "Doma",
      "birthday": "02-01",
      "affiliation": "civilian",
      "image": "Doma.png",
      "image_offset": {
        "x": 45,
        "y": 5
      },
      "short_bio": "\"Bohemian Knight\" Doma is an infamous New World pirate who worked for Whitebeard."
    },
    {
      "name": "Elizabello II",
      "birthday": "02-02",
      "romanized_name": "Erizaberō Nisei",
      "epithet": "\"The Fighting King\"",
      "affiliation": "Prodence Kingdom",
      "role": "King",
      "haki": [],
      "origin": "Grand Line (Prodence Kingdom)",
      "age": 57,
      "height": "436 cm",
      "image": "Elizabello-II.png",
      "image_offset": {
        "x": 40,
        "y": 5
      },
      "short_bio": "\"The Fighting King\" Elizabello II is the king of the Prodence Kingdom. He is also a fighter who joined as a gladiator at the Corrida Colosseum to compete for the Mera Mera no Mi. He is an ally of Luffy during the Dressrosa Arc."
    },
    {
      "name": "Killer",
      "birthday": "02-02",
      "romanized_name": "Kirā",
      "epithet": "\"Massacre Soldier\"",
      "affiliation": "Kid Pirates",
      "role": "Combatant",
      "bounty": "250,000,000",
      "devil_fruit": {
        "name": "Smile (failed)",
        "japanese_name": "Smaile",
        "type": "Artificial Zoan",
        "power": "None (failed, took away ability to swim and express negative emotions)"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "South Blue",
      "age": 27,
      "height": "195 cm",
      "image": "Killer.png",
      "image_offset": {
        "x": 0,
        "y": 5
      },
      "short_bio": "\"Massacre Soldier\" Killer is a pirate from the South Blue and a combatant of the Kid Pirates. He is one of twelve pirates who are referred to as the \"Worst Generation\". After the timeskip, his bounty has been raised from 162,000,000 to 200,000,000. Following the confrontation with Kaidou, Killer ate a defective SMILE and took on the alias of Kamazo the Manslayer, a street murderer in Wano Country who secretly acted as an assassin working for the shogun, Kurozumi Orochi, until the shogun discarded him after he had failed his mission to kill Toko. He later reunites with his crew and becomes an ally member of the Ninja-Pirate-Mink-Samurai Alliance during the Wano Country Arc."
    },
    {
      "name": "Nefertari Vivi",
      "birthday": "02-02",
      "romanized_name": "Neferutari Bibi",
      "epithet": "Miss Wednesday (former)",
      "affiliation": "Arabasta Kingdom / Straw Hat Pirates (former)",
      "role": "Princess",
      "haki": [],
      "origin": "Grand Line (Arabasta)",
      "age": 18,
      "height": "169 cm",
      "image": "Nefertari-Vivi-(Nefeltari-Vivi)-(post-timeskip).png",
      "image_offset": {
        "x": 83,
        "y": 5
      },
      "short_bio": "<!-- Do not add D. --> Nefertari Vivi is the princess of the Arabasta Kingdom. She is the daughter of Nefertari Cobra and Titi, and along with the rest of her family, she bears the initial D. in her name. During her childhood, Vivi was part of the Sand-Sand Clan, being the vice-leader of the group led by her friend Koza. Vivi debuted as one of the main antagonists of the Reverse Mountain Arc as a Bounty Hunter, under the Baroque Works codename Miss Wednesday. During this time, she was partnered with fellow Frontier Agent, Mr. 9. However, after the events of the Whisky Peak Arc, Vivi and her pet duck Karoo ended up joining the Straw Hat Pirates for most of the Arabasta Saga once she was discovered to be a spy plotting against Baroque Works. Vivi left the Straw Hats after defeating Baroque Works to stay in her home country, but is still considered a member of the crew and has been keeping track of their progress throughout the series. After attending the most recent Levely, she became a fugitive after Imu and the Five Elders learned she carried the \"D.\" initial, and was forced to flee Mary Geoise and take shelter alongside Wapol aboard Morgans' airship."
    },
    {
      "name": "Ninjin",
      "birthday": "02-02",
      "romanized_name": "Ninjin",
      "affiliation": "Usopp Pirates (former)",
      "role": "Member (former)",
      "haki": [],
      "origin": "East Blue (Syrup Village)",
      "age": 11,
      "height": "127 cm",
      "image": "Ninjin-(Carrot).png",
      "short_bio": "Ninjin (Odex) Miki Fukui, Aiko Hibi Ninjin is a former member of the Usopp Pirates, along with Piiman and Tamanegi, before Usopp joined the Straw Hat Pirates. He is an ally of the Straw Hat Pirates during the Syrup Village Arc."
    },
    {
      "name": "Bizarre",
      "birthday": "02-03",
      "affiliation": "civilian",
      "image": "Bizarre.png",
      "image_offset": {
        "x": 30,
        "y": 5
      },
      "short_bio": "Bizarre is an infamous New World pirate captain who was allied with Whitebeard."
    },
    {
      "name": "Brownbeard",
      "birthday": "02-03",
      "romanized_name": "Chahige",
      "epithet": "\"Brownbeard\"",
      "affiliation": "Brownbeard Pirates",
      "role": "Captain",
      "bounty": "80,060,000",
      "haki": [],
      "origin": "Grand Line",
      "age": 45,
      "height": "691 cm",
      "image": "Chadros-Higelyges-(Brownbeard).png",
      "image_offset": {
        "x": 52,
        "y": 5
      },
      "short_bio": "Chadros Higelyges, better known as Brownbeard, is a former New World pirate. After Whitebeard's death he went off and took control of Foodvalten, one of the New World islands formerly under Whitebeard's protection. After his defeat at the hands of Basil Hawkins, he quit being a pirate and resided on Punk Hazard, where he became the boss of the Centaur Patrol Unit which guarded part of the island, until his \"Master\" Caesar Clown betrayed him. He is a minor antagonist-turned-ally during the Punk Hazard Arc."
    },
    {
      "name": "Fuza",
      "birthday": "02-03",
      "affiliation": "civilian",
      "image": "Fuza.png",
      "image_offset": {
        "x": 28,
        "y": 5
      },
      "short_bio": "Fuza is the giant Three-length Bird of the Skypiean Priest Shura, who rode on it to get around to the different places throughout Skypiea."
    },
    {
      "name": "Sasaki",
      "birthday": "02-03",
      "romanized_name": "Sasaki",
      "epithet": "\"Overflowing Sasaki\"",
      "affiliation": "Beasts Pirates",
      "role": "Shinuchi / Tobiroppo",
      "bounty": "472,000,000",
      "devil_fruit": {
        "name": "Dragon-Dragon Fruit, Model: Triceratops",
        "japanese_name": "Ryu Ryu no Mi, Model: Triceratops",
        "type": "Ancient Zoan",
        "power": "Transform into a triceratops"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Grand Line",
      "age": 34,
      "height": "318 cm",
      "image": "Sasaki.png",
      "image_offset": {
        "x": 23,
        "y": 5
      },
      "short_bio": "\"Overflowing\" Sasaki is a bluespine unicornfish fish-man and one of the Tobiroppo, the strongest six Shinuchi of the Beasts Pirates. He also leads the crew's Armored Division. Before joining the Beasts Pirates, he captained his own crew called the Sasaki Pirates. Due to his actions and role, he is a supporting antagonist in the Wano Country Arc."
    },
    {
      "name": "Fujin",
      "birthday": "02-04",
      "romanized_name": "Fūjin",
      "affiliation": "Beasts Pirates",
      "role": "Ninja",
      "haki": [
        "Armament Haki"
      ],
      "origin": "Grand Line (Wano Country)",
      "age": 45,
      "height": "200 cm",
      "image": "Fujin.png",
      "image_offset": {
        "x": 58,
        "y": 5
      },
      "short_bio": "Fujin is a ninja and a member of the Beasts Pirates. He previously was a member of the Orochi Oniwabanshu which served the shogun of Wano Country, Kurozumi Orochi. Due to his actions and role, he is a minor antagonist in the Wano Country Arc."
    },
    {
      "name": "Fukaboshi",
      "birthday": "02-04",
      "romanized_name": "Fukaboshi",
      "affiliation": "Neptune Family",
      "role": "Prince",
      "haki": [],
      "origin": "Grand Line (Ryugu Kingdom)",
      "age": 24,
      "height": "604 cm",
      "image": "Fukaboshi.png",
      "image_offset": {
        "x": 26,
        "y": 5
      },
      "short_bio": "Fukaboshi is a shark merman and the eldest son of the royal Neptune Family on Fish-Man Island. After he, his father and his brothers were liberated by the Straw Hat Pirates, he allied himself with them against Hody Jones and his crew."
    },
    {
      "name": "Gloriosa",
      "birthday": "02-04",
      "romanized_name": "Guroriōsa",
      "epithet": "Elder Nyon",
      "affiliation": "Kuja / Rocks Pirates (former)",
      "role": "Elder / Empress (former)",
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Calm Belt (Amazon Lily)",
      "image": "Gloriosa-(Elder-Nyon)-(full).png",
      "short_bio": "Gloriosa, more commonly known as \"Elder Nyon\", is an advisor of sorts to the current empress of the Kuja tribe, Boa Hancock. Gloriosa is a former empress and captain of the Kuja Pirates from three generations prior to Hancock. She is also a former member of the legendary Rocks Pirates."
    },
    {
      "name": "Haruta",
      "birthday": "02-04",
      "romanized_name": "Haruta",
      "affiliation": "Whitebeard Pirates",
      "role": "12th Division Commander",
      "haki": [],
      "origin": "South Blue",
      "image": "Haruta.png",
      "image_offset": {
        "x": 38,
        "y": 5
      },
      "short_bio": "Haruta is the former 12th division commander of the Whitebeard Pirates."
    },
    {
      "name": "Blamenco",
      "birthday": "02-05",
      "romanized_name": "Buramenko",
      "affiliation": "Whitebeard Pirates",
      "role": "6th Division Commander",
      "devil_fruit": {
        "name": "Pocket-Pocket Fruit",
        "japanese_name": "Poke Poke no Mi",
        "type": "Paramecia",
        "power": "Store items in body pockets"
      },
      "haki": [],
      "origin": "South Blue",
      "image": "Blamenco.png",
      "image_offset": {
        "x": 35,
        "y": 5
      },
      "short_bio": "Blamenco is the former 6th division commander of the Whitebeard Pirates."
    },
    {
      "name": "Vista",
      "birthday": "02-05",
      "romanized_name": "Bisuta",
      "epithet": "\"Flower Sword\"",
      "affiliation": "Whitebeard Pirates",
      "role": "5th Division Commander",
      "bounty": "Unknown",
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "North Blue",
      "age": 47,
      "height": "328 cm",
      "image": "Vista.png",
      "image_offset": {
        "x": 49,
        "y": 5
      },
      "short_bio": "\"Vista of the Flower Swords\" is the former 5th division commander of the Whitebeard Pirates. He is one of the most prominent members of his crew."
    },
    {
      "name": "Blondie",
      "birthday": "02-06",
      "affiliation": "civilian",
      "image": "Blondie.png",
      "short_bio": "Blondie is an infamous New World pirate who was allied with Whitebeard."
    },
    {
      "name": "Nico Olvia",
      "birthday": "02-06",
      "romanized_name": "Niko Orubia",
      "affiliation": "Ohara",
      "role": "Archaeologist",
      "bounty": "79,000,000",
      "haki": [],
      "origin": "West Blue (Ohara)",
      "height": "186 cm",
      "image": "Nico-Olvia.png",
      "image_offset": {
        "x": 0,
        "y": 5
      },
      "short_bio": "Nico Olvia was the mother of Nico Robin, the older sister of Oran and paternal aunt of Mizuira, and an archaeologist from Ohara who studied the Poneglyphs two decades ago. While travelling around the ocean with a group of fellow archaeologists, Olvia was captured by the Marines for conducting forbidden research. She was able to return to Ohara and briefly reunite with her daughter with the help of Jaguar D. Saul, before perishing alongside the other Ohara archaeologists due to the Buster Call."
    },
    {
      "name": "Nico Robin",
      "birthday": "02-06",
      "romanized_name": "Niko Robin",
      "epithet": "\"Devil Child\"",
      "affiliation": "Straw Hat Pirates",
      "role": "Archaeologist",
      "bounty": "930,000,000",
      "devil_fruit": {
        "name": "Flower-Flower Fruit",
        "japanese_name": "Hana Hana no Mi",
        "type": "Paramecia",
        "power": "Replicate body parts"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "West Blue (Ohara)",
      "age": 30,
      "height": "188 cm",
      "image": "Nico-Robin.png",
      "image_offset": {
        "x": 9,
        "y": 5
      },
      "short_bio": "Nico Robin, also known by her epithet \"Devil Child\" and the \"Light of the Revolution\", is the archaeologist of the Straw Hat Pirates and one of the Senior Officers of the Straw Hat Grand Fleet. She is the seventh member of the crew and the sixth to join, doing so at the end of the Arabasta Arc. She temporarily left the crew during the Water 7 Arc but rejoined during the Enies Lobby Arc. Born into a family of archaeologists, Robin is the daughter of Nico Olvia. Robin ate the Hana Hana no Mi at a young age, giving her the power to reproduce her body parts (or her entire body) on any surface at will. As the sole survivor of the destroyed West Blue island Ohara, she is currently one of only two people in the world known to have the ability to read and decipher Poneglyphs, a skill which is considered forbidden and threatening to the World Government. She acted as the vice president of Baroque Works as \"Miss All Sunday\", serving and partnering herself directly with the organization's president; the ex-Warlord: Crocodile, who operated under the codename \"Mr. 0\". She was the secondary antagonist of the Arabasta Arc and Saga, before joining the Straw Hats. Her dream is to find the Rio Poneglyph which tells the true history of the world, specifically the Void Century. She gained a bounty of 79,000,000 at the age of 8 due to her ability to read poneglyphs after the destruction of Ohara. It later increased to 80,000,000 after the Straw Hats invaded Enies Lobby to rescue her and escape. After the Dressrosa Arc, it was increased to 130,000,000. Following the Raid on Onigashima, her bounty was increased to 930,000,000."
    },
    {
      "name": "Buchi",
      "birthday": "02-07",
      "romanized_name": "Buchi",
      "epithet": "Nyaban Brothers",
      "affiliation": "Black Cat Pirates",
      "role": "Ship Guard",
      "bounty": "7,000,000",
      "haki": [],
      "origin": "East Blue",
      "age": 23,
      "height": "216 cm",
      "image": "Buchi-(Butchie).png",
      "image_offset": {
        "x": 43,
        "y": 5
      },
      "short_bio": "Buchi is an officer of the Black Cat Pirates. Along with his partner Sham, he is also the protector of the crew's ship, the Bezan Black, and together they are known as the . Due to his actions, he is a supporting antagonist during the Syrup Village Arc."
    },
    {
      "name": "Chiken",
      "birthday": "02-08",
      "romanized_name": "Chikin",
      "affiliation": "Goa Kingdom",
      "role": "Fishmonger",
      "haki": [],
      "origin": "East Blue (Goa Kingdom)",
      "image": "Chicken.png",
      "image_offset": {
        "x": 27,
        "y": 5
      },
      "short_bio": "Chicken is the wife of Gyoru and a fishmonger of Foosha Village."
    },
    {
      "name": "Gonbe",
      "birthday": "02-08",
      "romanized_name": "Gonbe",
      "affiliation": "Kokoro / Chimney",
      "role": "Pet (Cat/Rabbit)",
      "haki": [],
      "origin": "Grand Line (Water 7)",
      "image": "Gonbe-(nyaa-nyaa).png",
      "short_bio": "Gonbe is known as Chimney's pet cat, although he is actually a rabbit."
    },
    {
      "name": "Onigumo",
      "birthday": "02-08",
      "affiliation": "civilian",
      "bounty": "500,000,000",
      "image": "Onigumo.png",
      "image_offset": {
        "x": 47,
        "y": 5
      },
      "short_bio": "Vice Admiral Onigumo is a Marine officer, and one of the five vice admirals who led the Buster Call on Enies Lobby. His name was revealed in the third databook."
    },
    {
      "name": "Bartholomew Kuma",
      "birthday": "02-09",
      "romanized_name": "Bāsoromyū Kuma",
      "epithet": "\"Tyrant\"",
      "affiliation": "Revolutionary Army (former) / Seven Warlords (former)",
      "role": "Officer (former)",
      "bounty": "296,000,000",
      "devil_fruit": {
        "name": "Paw-Paw Fruit",
        "japanese_name": "Nikui Nikui no Mi",
        "type": "Paramecia",
        "power": "Repel anything with paws"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "South Blue (Sorbet Kingdom)",
      "age": 47,
      "height": "689 cm",
      "image": "Bartholomew-Kuma.png",
      "image_offset": {
        "x": 42,
        "y": 5
      },
      "short_bio": "Bartholomew Kuma is a former Warlord of the Sea, the former king of the Sorbet Kingdom, and most notably an officer, as well as founding member of the Revolutionary Army with a bounty of 296,000,000. As a pirate, Kuma sailed the seas as a single-person pirate crew. He is also the adoptive father of Jewelry Bonney, daughter of his late friend and fellow revolutionary Ginny. Kuma is a member of the near-extinct special race known as the Buccaneers, inherited from his late father Clapp. Because of the lies told to the public by the World Government, Kuma became feared as an extremely vicious pirate, earning himself the title \"Tyrant\". In exchange for curing Bonney of the deadly Sapphire Scales disease, Kuma became a special type of cyborg known as a \"Pacifista\", developed by the world renowned scientist Vegapunk. Once Vegapunk finished his modifications on Kuma, the Warlord was converted into the first complete Pacifista cyborg, with the serial PX-0, and mentally died in the process. Vegapunk also cloned Kuma as S-Bear, one of the Seraphim that were designed to replace the Warlords. Kuma has been enslaved by the World Nobles twice in his lifetime: The first time was in his infancy until he escaped during the God Valley Incident and the second time in adulthood as punishment for the two years he spent protecting the Thousand Sunny, which lasted until his fellow revolutionaries freed him during the most recent Levely. While Kuma was presented as a major antagonist during the Thriller Bark and Sabaody Archipelago Arc, he was secretly an ally. His action of separating the Straw Hat Pirates was ultimately done in their best interest, as it saved them from Admiral Kizaru and helped the crew's captain Monkey D. Luffy realize that his crew was too weak to survive in the New World and needed to train first; thus, Kuma played a key role in the subsequent timeskip. In his mindless state, Kuma is a major antagonist in the Marineford Arc where he took part in the Summit War of Marineford and sided with the Marines, along with most of the other Warlords, but he later becomes a major ally during the Egghead Arc and an important figure behind its ongoings."
    },
    {
      "name": "Carne",
      "birthday": "02-09",
      "romanized_name": "Karune",
      "affiliation": "Baratie",
      "role": "Charcutier",
      "haki": [],
      "origin": "East Blue",
      "age": 34,
      "height": "171 cm",
      "image": "Carne.png",
      "image_offset": {
        "x": 36,
        "y": 5
      },
      "short_bio": "Carne is one of the main cooks at the Baratie, currently serving as the restaurant's head charcutier."
    },
    {
      "name": "Genbo",
      "birthday": "02-09",
      "romanized_name": "Genbō",
      "affiliation": "Shandia",
      "role": "Warrior / God's Guard",
      "haki": [],
      "origin": "Sky Island (Skypiea)",
      "age": 25,
      "height": "193 cm",
      "image": "Genbo.png",
      "image_offset": {
        "x": 33,
        "y": 5
      },
      "short_bio": "Genbo is one of the Shandia warriors that fought to take back the Upper Yard from Enel."
    },
    {
      "name": "Wadatsumi",
      "birthday": "02-09",
      "romanized_name": "Wadatsumi",
      "epithet": "\"Large Monk\"",
      "affiliation": "Sun Pirates",
      "role": "Pirate",
      "haki": [],
      "origin": "Grand Line (Ryugu Kingdom)",
      "age": 25,
      "height": "8000 cm",
      "image": "Wadatsumi.png",
      "image_offset": {
        "x": 51,
        "y": 5
      },
      "short_bio": "\"Large Monk\" Wadatsumi is a giant tiger blowfish fish-man and a member of the Sun Pirates. He was formerly a member of the Flying Pirates under captain Vander Decken IX before they were defeated. He was a minor antagonist during the Fish-Man Island Arc but became an ally to the Straw Hat Pirates during the Whole Cake Island Arc."
    },
    {
      "name": "Mikazuki",
      "birthday": "02-10",
      "romanized_name": "Mikazuki",
      "affiliation": "Big Helmet Pirates",
      "role": "Captain",
      "bounty": "36,000,000",
      "haki": [],
      "origin": "Grand Line (Water 7)",
      "image": "Mikazuki.png",
      "image_offset": {
        "x": 49,
        "y": 5
      },
      "short_bio": "Mikazuki is the captain and only named member of the Big Helmet Pirates. He has a bounty of 36,000,000."
    },
    {
      "name": "Page One",
      "birthday": "02-10",
      "romanized_name": "Pējiwan",
      "affiliation": "Beasts Pirates",
      "role": "Shinuchi / Tobiroppo",
      "bounty": "290,000,000",
      "devil_fruit": {
        "name": "Dragon-Dragon Fruit, Model: Spinosaurus",
        "japanese_name": "Ryu Ryu no Mi, Model: Spinosaurus",
        "type": "Ancient Zoan",
        "power": "Transform into a spinosaurus"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Grand Line",
      "age": 20,
      "height": "171 cm",
      "image": "Page-One.png",
      "image_offset": {
        "x": 32,
        "y": 5
      },
      "short_bio": "Page One is a former member of the Tobiroppo, the strongest Shinuchi of the Beasts Pirates. He is the son of the former Warlord of the Sea Hanafuda and younger brother of fellow former Tobiroppo Ulti. Due to his actions and role, he is a supporting antagonist in the Wano Country Arc. Following the downfall of the Beasts Pirates, Page One and his sister became followers of Yamato after being saved from Who's-Who and became one of his allies in the Oni Child Yamato's Golden Harvest Surrogate Pilgrimage Cover Page Serial."
    },
    {
      "name": "Charlotte Flampé",
      "birthday": "02-11",
      "romanized_name": "Shārotto Furanpe",
      "affiliation": "Charlotte Family",
      "role": "Minister of Honey",
      "haki": [],
      "origin": "Grand Line (Totto Land)",
      "age": 15,
      "height": "170 cm",
      "image": "Charlotte-Flampe.png",
      "image_offset": {
        "x": 52,
        "y": 5
      },
      "short_bio": "Charlotte Flampe is the 36th daughter and 77th child of the Charlotte Family and an officer of the Big Mom Pirates, serving as the Captain of the Special Attack Unit. She is also Totto Land's Minister of Honey, governing over Rokumitsu Island, and the President of the Katakuri Fan Club. Due to her actions and role, she is a minor antagonist during the Whole Cake Island Arc."
    },
    {
      "name": "Little Oars Jr.",
      "birthday": "02-12",
      "romanized_name": "Ritoru Ōzu Junia",
      "affiliation": "Little Pirates",
      "role": "Captain",
      "bounty": "550,000,000",
      "haki": [],
      "origin": "Grand Line",
      "age": 72,
      "height": "6000 cm",
      "image": "Little-Oars-Jr..png",
      "image_offset": {
        "x": 36,
        "y": 5
      },
      "short_bio": "Little Oars Jr. (also referred to as Oars III on his flag) is the captain of the Little Pirates, a descendant of Oars, and a former subordinate of the Whitebeard Pirates. He is among the several New World pirates that aided the Whitebeard Pirates in saving Ace from execution by the World Government."
    },
    {
      "name": "Nefertari Cobra",
      "birthday": "02-13",
      "romanized_name": "Neferutari Kobura",
      "affiliation": "Arabasta Kingdom",
      "role": "King",
      "haki": [],
      "origin": "Grand Line (Arabasta)",
      "age": 50,
      "height": "182 cm",
      "image": "Nefertari-Cobra-(Nefeltari-Cobra).png",
      "image_offset": {
        "x": 72,
        "y": 5
      },
      "short_bio": "Nefertari Cobra was the 12th king of the Arabasta Kingdom, the former patriarch of Nefertari Family, husband of the late Nefertari Titi and father of Nefertari Vivi. He was related to Nefertari D. Lili, one of the First Twenty monarchs who founded the World Government, and secretly bore her initial D. in his name. He was a major character throughout the Arabasta Arc and a two-time participant of the Levely, having played a key role in the vote that led to the dissolution of the Seven Warlords of the Sea in the latest one. During the latest Levely, Cobra was murdered by Imu and the Five Elders after learning about the former's existence and sacrificing himself so Sabo could escape."
    },
    {
      "name": "Hyogoro",
      "birthday": "02-14",
      "romanized_name": "Hyōgorō",
      "epithet": "\"Hyogoro of the Flower\"",
      "affiliation": "Yakuza (former)",
      "role": "Boss (former)",
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Grand Line (Wano Country)",
      "age": 70,
      "height": "100 cm",
      "image": "Hyogoro-(Grandpa-Hyo)-(kneeling).png",
      "image_offset": {
        "x": 51,
        "y": 5
      },
      "short_bio": "Hyougoro of the Flower is the former yakuza boss of the Flower Capital and the most famous yakuza in Wano Country during the Kouzuki Family's reign. During Kurozumi Orochi's reign, he was imprisoned in Udon's prisoner mines until he was freed by Monkey D. Luffy. As a prisoner, he was known as Grandpa Hyo."
    },
    {
      "name": "Miss Valentine",
      "birthday": "02-14",
      "romanized_name": "Misu Barentain",
      "affiliation": "Baroque Works (former)",
      "role": "Officer Agent (former)",
      "bounty": "7,500,000",
      "devil_fruit": {
        "name": "Kilo-Kilo Fruit",
        "japanese_name": "Kiro Kiro no Mi",
        "type": "Paramecia",
        "power": "Change body weight"
      },
      "haki": [],
      "origin": "West Blue",
      "age": 24,
      "height": "177 cm",
      "image": "Mikita-(Miss-Valentine).png",
      "image_offset": {
        "x": 25,
        "y": 5
      },
      "short_bio": "\"Courier\" Mikita, more commonly known by her alias Miss Valentine, is a former officer agent who was partnered with Mr. 5. As of now, she is currently working as a chocolate lady alongside most of the other Baroque Works members at the new Spiders Cafe. She is one of the main antagonists of the Whisky Peak Arc and a tertiary antagonist of the Little Garden Arc."
    },
    {
      "name": "Charlotte Linlin",
      "birthday": "02-15",
      "romanized_name": "Shārotto Rinrin",
      "epithet": "\"Big Mom\"",
      "affiliation": "Big Mom Pirates",
      "role": "Captain / Queen",
      "bounty": "4,388,000,000",
      "devil_fruit": {
        "name": "Soul-Soul Fruit",
        "japanese_name": "Soru Soru no Mi",
        "type": "Paramecia",
        "power": "Manipulate souls"
      },
      "haki": [
        "Conqueror's Haki",
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Grand Line",
      "age": 68,
      "height": "880 cm",
      "image": "Charlotte-Linlin-(Big-Mom).png",
      "image_offset": {
        "x": 25,
        "y": 5
      },
      "short_bio": "Charlotte Linlin, better known as \"Big Mom\", is the captain of the Big Mom Pirates and was formerly one of the Four Emperors ruling over the New World, as the only female member of the group. She is the queen of the archipelago nation Totto Land, a place she seeks to form into a utopia where all the world's races can live together in peace without discrimination or segregation. She is also the matriarch of the Charlotte Family, whose children make up the ministers of her nation and the core infrastructure of her crew. Big Mom wields the Soru Soru no Mi, which allows her to steal the souls of others and implant them in inanimate objects, resulting in the unique race of creatures known as homies, who happily serve her. Big Mom possesses three special homies: the bicorne Napoleon, the sun Prometheus, and the thunder cloud Hera. Hera's position was formerly owned by another thunder cloud, Zeus, but Big Mom grew tired of Zeus' continued failures and created Hera to replace him. In her childhood, Linlin was raised on Elbaph in the Sheep's House under Carmel after being abandoned by her family. After accidentally slaying Jorul, a hero of Elbaph, during one of her hunger pangs, Linlin was relocated to another island. During Linlin's birthday party, as she gorged on sweets, Carmel and her fellow orphans mysteriously disappeared and Linlin inherited Carmel's Devil Fruit. Now alone, she was discovered by Streusen, and the pair co-founded a pirate crew. As a young adult, Big Mom joined the legendary Rocks Pirates, where she formed a bond with apprentice Kaidou. Some time after the God Valley Incident where the Rocks Pirates fell, she formed her own crew once again, the Big Mom Pirates. Big Mom developed an enmity with Monkey D. Luffy and the Straw Hat Pirates, who challenged her ownership of Fish-Man Island and then invaded Whole Cake Island, thwarting her plans to steal technology from the advanced Germa Kingdom during an arranged wedding between Sanji and her daughter, Charlotte Pudding. This grudge brought her to Wano Country in pursuit of Luffy, where she formed an alliance with Kaidou and the Beasts Pirates with the intention of conquering the world and claiming the One Piece. However, this never came to fruition as their alliance would go on to be defeated by the Ninja-Pirate-Mink-Samurai Alliance that same night. Following her defeat to Eustass Kid and Trafalgar Law, the World Economy News Paper released a new listing of the Four Emperors, with Big Mom no longer being included among them anymore. As a young child at the beginning of her piracy career, Big Mom was assigned a 50,000,000 bounty which was quickly escalated to 500,000,000. By the time of the Raid on Onigashima, at the peak of her piracy career, she held a bounty of 4,388,000,000 which was the second-highest bounty of any living pirate. Big Mom was the last of the Four Emperors to be named; her epithet was first revealed after the Summit War of Marineford by Eustass Kid and her real name was revealed by Pappag on Fish-Man Island. Since the timeskip, she is a minor antagonist during the Fish-Man Island Arc, the main antagonist of the Whole Cake Island Arc and the Whole Cake Island Saga as a whole, and the secondary antagonist of the second half of the Wano Country Arc and Wano Country Saga as a whole."
    },
    {
      "name": "Daisy",
      "birthday": "02-15",
      "romanized_name": "Dējī",
      "affiliation": "Kuja Pirates",
      "role": "Pirate",
      "haki": [
        "Armament Haki"
      ],
      "origin": "Calm Belt (Amazon Lily)",
      "image": "Daisy.png",
      "short_bio": "Daisy is a member of the Kuja Pirates."
    },
    {
      "name": "Bluejam",
      "birthday": "02-16",
      "romanized_name": "Burūjamu",
      "affiliation": "Bluejam Pirates",
      "role": "Captain",
      "bounty": "14,300,000",
      "haki": [],
      "origin": "East Blue",
      "age": 42,
      "height": "261 cm",
      "image": "Bluejam.png",
      "image_offset": {
        "x": 39,
        "y": 5
      },
      "short_bio": "Bluejam was the captain of the Bluejam Pirates, and an infamous pirate of the East Blue. He was the main antagonist of the Post-War Arc during Luffy's flashback sequence."
    },
    {
      "name": "Clione",
      "birthday": "02-17",
      "affiliation": "civilian",
      "image": "Clione.png",
      "short_bio": "Clione is a member of the Heart Pirates."
    },
    {
      "name": "Ukkari",
      "birthday": "02-17",
      "romanized_name": "Ukkari",
      "affiliation": "Kuja",
      "role": "Warrior",
      "bounty": "100,000",
      "haki": [
        "Armament Haki"
      ],
      "origin": "Calm Belt (Amazon Lily)",
      "image": "Ukkari.png",
      "short_bio": "Seaman Recruit Ukkari is a Marine who serves at the Shells Town Marine base."
    },
    {
      "name": "Gambia",
      "birthday": "02-18",
      "affiliation": "civilian",
      "bounty": "67,000,000",
      "image": "Gambia.png",
      "image_offset": {
        "x": 80,
        "y": 5
      },
      "short_bio": "Gambia the Missionary is the staff officer of the Barto Club. He was also a gladiator competing at the Corrida Colosseum for the Mera Mera no Mi."
    },
    {
      "name": "Minolva",
      "birthday": "02-18",
      "affiliation": "civilian"
    },
    {
      "name": "Snowma-san",
      "birthday": "02-18",
      "romanized_name": "Sunōma-san",
      "affiliation": "Drum Island",
      "role": "Talking Snowman",
      "haki": [],
      "origin": "Grand Line (Drum Island)",
      "image": "Snowman-san.png",
      "image_offset": {
        "x": 43,
        "y": 5
      }
    },
    {
      "name": "Bobby Funk",
      "birthday": "02-19",
      "romanized_name": "Bobī Fanku",
      "affiliation": "Funk Brothers",
      "role": "Hitman",
      "bounty": "36,000,000",
      "haki": [
        "Armament Haki"
      ],
      "origin": "Grand Line (Mogaro Kingdom)",
      "age": 33,
      "height": "320 cm",
      "image": "Bobby-Funk-and-Kelly-Funk.png",
      "short_bio": "Bobby Funk is an assassin from the Mogaro Kingdom and Kelly Funk's younger brother. He joined as a gladiator at the Corrida Colosseum to compete for the Mera Mera no Mi."
    },
    {
      "name": "Cocox",
      "birthday": "02-19",
      "romanized_name": "Kokokusu",
      "affiliation": "Island of Rare Animals",
      "role": "Animal",
      "haki": [],
      "origin": "East Blue",
      "image": "Cocox-(Buckox).png",
      "image_offset": {
        "x": 20,
        "y": 5
      },
      "short_bio": "Cocox is an animal who lives on the Island of Rare Animals. Like all the animals on the island, he is protected by Gaimon. He is classified as a Type B creature, \"Small Friendly\"."
    },
    {
      "name": "Henohenounchi",
      "birthday": "02-19",
      "romanized_name": "Henohenounchi",
      "affiliation": "Arabasta Kingdom",
      "role": "Dummy / Decoy",
      "haki": [],
      "origin": "Grand Line (Arabasta)",
      "image": "Henohenounchi-(Igaram_s-dummies).png",
      "image_offset": {
        "x": 32,
        "y": 5
      },
      "short_bio": "Igaram is the captain of the Arabasta royal guard (captain of Arabasta security in the English dub). He aided Nefertari Vivi in infiltrating Baroque Works as a Frontier Agent and took on the codename Mr. 8. He was partnered with Miss Monday. He is also Terracotta's husband. He is an ally of the Straw Hat Pirates during the Whisky Peak (after being a minor antagonist) and Arabasta Arcs."
    },
    {
      "name": "Road",
      "birthday": "02-19",
      "affiliation": "civilian",
      "image": "Road.png",
      "image_offset": {
        "x": 61,
        "y": 5
      },
      "short_bio": "Road is a giant from Elbaph who is the navigator of the New Giant Warrior Pirates and was formerly an S-Class ranked mercenary for Buggy's Delivery. In addition, he rules over a personal diorama full of entrapped humans and giant animals as its \"Sun God\". He served as a minor antagonist in the beginning of the Elbaph Arc, but later became an ally of the Straw Hat Pirates."
    },
    {
      "name": "Superhuman Domingos",
      "birthday": "02-19",
      "romanized_name": "Kairiki Domingosu",
      "affiliation": "Buggy Pirates",
      "role": "Pirates",
      "bounty": "Unknown",
      "haki": [],
      "origin": "East Blue",
      "image": "Superhuman-Domingos.png",
      "image_offset": {
        "x": 47,
        "y": 0
      },
      "short_bio": "The Buggy Pirates are a band of pirates led by Buggy, a former Roger Pirates apprentice. Initially an undistinguished (albeit feared) presence in the East Blue, it began pursuing a vendetta after being defeated by the Straw Hat Pirates, and followed them into the Grand Line. Since then, several unlikely circumstances and Buggy's constantly-revolving fortunes have repeatedly overhauled it: first into an alliance with the Alvida Pirates, then into the Seven Warlords-affiliated Buggy's Delivery, and finally into the Four Emperors-affiliated Cross Guild. Due to their actions and role, they serve as the main antagonists of the Orange Town Arc, the protagonists of the Buggy's Crew Adventure Chronicles mini-arc, co-antagonists (alongside Smoker and his Marine unit) in the Loguetown Arc, and side-characters in the Jaya Arc. After the timeskip, they have made tertiary appearances throughout the Dressrosa Arc, the Zou Arc, and the Wano Country Arc."
    },
    {
      "name": "Kumadori",
      "birthday": "02-20",
      "romanized_name": "Kumadori",
      "affiliation": "CP9 (former) / CP0",
      "role": "Agent",
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "South Blue",
      "age": 36,
      "height": "318 cm",
      "image": "Kumadori.png",
      "image_offset": {
        "x": 47,
        "y": 5
      },
      "short_bio": "Kumadori is an agent of CP0. Before the time skip, he was an agent of CP9. He is also the son of Kumadori Yamanbako. He was one of the major antagonists during the Enies Lobby Arc."
    },
    {
      "name": "Charlotte Dolce",
      "birthday": "02-21",
      "affiliation": "civilian",
      "image": "Charlotte_Dolce.png",
      "image_offset": {
        "x": 38,
        "y": 5
      },
      "short_bio": "Charlotte Dolce and Dragee (WT100) Charlotte Dolce and Charlotte Dragée are the 45th and 46th sons and the 83rd and 84th children of the Charlotte Family, being the two youngest sons of Charlotte Linlin, and are members of the Big Mom Pirates."
    },
    {
      "name": "Charlotte Dragée",
      "birthday": "02-21",
      "affiliation": "civilian",
      "short_bio": "Charlotte Dolce and Dragee (WT100) Charlotte Dolce and Charlotte Dragée are the 45th and 46th sons and the 83rd and 84th children of the Charlotte Family, being the two youngest sons of Charlotte Linlin, and are members of the Big Mom Pirates."
    },
    {
      "name": "Jigoro",
      "birthday": "02-21",
      "romanized_name": "Jigorō",
      "epithet": "\"Jigoro of the Wind\"",
      "affiliation": "Thriller Bark Pirates (former)",
      "role": "Zombie General",
      "bounty": "7,000,000",
      "haki": [],
      "origin": "West Blue",
      "age": 59,
      "height": "238 cm",
      "image": "Jigoro.png",
      "image_offset": {
        "x": 34,
        "y": 5
      },
      "short_bio": "Jigoro of the Wind was a master swordsman who was subsequently revived by Gecko Moria as Zombie #850, a General Zombie. He was animated with Zoro's shadow and eventually assigned to guard Hogback. Due to his actions and role, he is a supporting antagonist in the Thriller Bark Arc."
    },
    {
      "name": "Pascia",
      "birthday": "02-21",
      "romanized_name": "Pashia",
      "affiliation": "Sabaody Auction House",
      "role": "Dancer / Slave",
      "bounty": "800,000",
      "haki": [],
      "origin": "Grand Line",
      "age": 22,
      "height": "172 cm",
      "image": "Pascia-(Pasia,-Pashia).png",
      "image_offset": {
        "x": 52,
        "y": 5
      },
      "short_bio": "Pashia (Funimation) Pascia is a female dancer, who was to be sold at the Auction House."
    },
    {
      "name": "Hamburg",
      "birthday": "02-22",
      "romanized_name": "Hanbāgu",
      "affiliation": "Foxy Pirates",
      "role": "Groggy Monster",
      "haki": [],
      "origin": "Unknown",
      "age": 33,
      "height": "302 cm",
      "image": "Hamburg,-Pickles,-and-Big-Pan.png",
      "image_offset": {
        "x": 0,
        "y": 6
      },
      "short_bio": "Hamburg is a combatant of the Foxy Pirates and the leader of the Groggy Monsters. Alongside Porche, he is one of Foxy's last remaining crewmates. Due to his actions, he is a major antagonist during the Long Ring Long Land Arc."
    },
    {
      "name": "Jerry",
      "birthday": "02-22",
      "romanized_name": "Jerī",
      "affiliation": "CP6",
      "role": "Agent",
      "haki": [],
      "origin": "South Blue (Karate Island)",
      "age": 46,
      "height": "676 cm",
      "image": "Jerry.png",
      "short_bio": "Jerry is a Cipher Pol agent of CP6. He was found as head of security of the Puffing Tom's seventh passenger car, which Sanji invaded to rescue Nico Robin. He comes from Karate Island in the South Blue, and claims to be a boxing champion. He was one of the antagonists during the Sea Train voyage in the Water 7 Arc."
    },
    {
      "name": "Oden",
      "birthday": "02-22",
      "romanized_name": "Kōzuki Oden",
      "epithet": "\"Foolish Lord\"",
      "affiliation": "Kouzuki Family / Roger Pirates / Whitebeard Pirates",
      "role": "Daimyo / Samurai",
      "bounty": "Unknown",
      "haki": [
        "Conqueror's Haki",
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Grand Line (Wano Country)",
      "age": 39,
      "height": "382 cm",
      "image": "Kozuki-Oden.png",
      "image_offset": {
        "x": 66,
        "y": 5
      },
      "short_bio": "Kouzuki Oden was the daimyo of Kuri in Wano Country and the son of the former shogun Kouzuki Sukiyaki, being a member of the Kouzuki Family. He was the husband of Kouzuki Toki and the father of Momonosuke and Hiyori. Additionally, he was the leader of a group of legendary and powerful samurai known as the Nine Red Scabbards, with all of them serving as his retainers and most trusted allies. For 5 years of his life, Oden set out to sea and became a pirate, serving as the 2nd division commander of the Whitebeard Pirates and later becoming a member of the Roger Pirates. After finding Joy Boy's treasure on Laugh Tale, Oden journeyed home and made it his goal to open Wano's borders to the world by finally taking his father's place as shogun. However, he met opposition from his usurper Kurozumi Orochi and the pirate Kaidou, who executed him 20 years before the present, in an event known as the Legendary Hour. Oden's name was first mentioned during the Zou Arc. He is the posthumous overarching protagonist of the Wano Country Arc, being the protagonist of a series of events taking place in and outside Wano in the past."
    },
    {
      "name": "Makino",
      "birthday": "02-23",
      "romanized_name": "Makino",
      "affiliation": "Partys Bar",
      "role": "Bartender / Owner",
      "haki": [],
      "origin": "East Blue (Foosha Village)",
      "age": 31,
      "height": "166 cm",
      "image": "Makino.png",
      "image_offset": {
        "x": 50,
        "y": 0
      },
      "short_bio": "Makino is a bartender from Monkey D. Luffy's home town, Foosha Village. She is the owner of Partys Bar and the mother of an unknown child."
    },
    {
      "name": "Enishida",
      "birthday": "02-24",
      "romanized_name": "Enishida",
      "affiliation": "Kuja",
      "role": "Maid",
      "haki": [
        "Armament Haki"
      ],
      "origin": "Calm Belt (Amazon Lily)",
      "image": "Enishida-(Genista).png",
      "short_bio": "Enishida is a member of the Kuja and one of Boa Hancock's attendants in her castle. She is a lady's maid."
    },
    {
      "name": "Mr. Beans",
      "birthday": "02-24",
      "romanized_name": "Misutā Bīnzu",
      "affiliation": "Baroque Works",
      "role": "Bounty Hunter",
      "haki": [],
      "origin": "Grand Line",
      "image": "Mr.-Beans.png",
      "short_bio": "Mr. Beans is a former Baroque Works Millions agent who was stationed at Whisky Peak alongside his partner, Miss Catherina. He worked under the Frontier Agents Mr. 8, Miss Monday, Mr. 9 and Miss Wednesday."
    },
    {
      "name": "Gerd",
      "birthday": "02-25",
      "romanized_name": "Geruzu",
      "affiliation": "New Giant Warrior Pirates",
      "role": "Doctor",
      "haki": [],
      "origin": "Grand Line (Elbaph)",
      "age": 75,
      "height": "1700 cm",
      "image": "Gerd.png",
      "image_offset": {
        "x": 58,
        "y": 0
      },
      "short_bio": "Gerd is a giant from Elbaph and the doctor of the New Giant Warrior Pirates. She was formerly an S-Class ranked mercenary for Buggy's Delivery. She is a major ally of the Straw Hat Pirates during the Elbaph Arc."
    },
    {
      "name": "Tightrope Walking Funan Bros.",
      "birthday": "02-25",
      "romanized_name": "Tsunawatari Funan Borōzu",
      "affiliation": "Buggy Pirates",
      "role": "Pirates",
      "haki": [],
      "origin": "East Blue",
      "image": "Tightrope-Walking-Funan-Bros.png"
    },
    {
      "name": "Raizou",
      "birthday": "02-26",
      "romanized_name": "Raizō",
      "epithet": "\"Raizo of the Mist\"",
      "affiliation": "Kouzuki Family / Akazaya Nine",
      "role": "Ninja / Retainer",
      "devil_fruit": {
        "name": "Scroll-Scroll Fruit",
        "japanese_name": "Maki Maki no Mi",
        "type": "Paramecia",
        "power": "Manipulate scrolls"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Grand Line (Wano Country)",
      "age": 35,
      "height": "311 cm",
      "image": "Raizo.png",
      "short_bio": "Raizo of the Mist is a ninja from Wano Country and one of the Nine Red Scabbards who served as Kouzuki Oden's retainers. He was born 55 years ago, but traveled 20 years forward in time at the age of 35. Following Kouzuki Momonosuke's ascent to shogun, he serves as the daimyo of Udon. He acts as a major ally to the Straw Hat Pirates during the Zou and Wano Country Arcs."
    },
    {
      "name": "Charlotte Joscarpone",
      "birthday": "02-27",
      "affiliation": "civilian",
      "image": "Charlotte_Joscarpone.png",
      "short_bio": "Charlotte Joscarpone is the 29th daughter and 63rd child of the Charlotte Family, the younger twin sister of Charlotte Mascarpone, and a Snakeneck-human hybrid. She is also an officer of the Big Mom Pirates."
    },
    {
      "name": "Charlotte Mascarpone",
      "birthday": "02-27",
      "affiliation": "civilian",
      "image": "Charlotte_Mascarpone.png",
      "image_offset": {
        "x": 50,
        "y": 12
      },
      "short_bio": "Charlotte Mascarpone is the 34th son and 62nd child of the Charlotte Family, the older twin brother of Joscarpone, and a Snakeneck-human hybrid. He is also an officer of the Big Mom Pirates and serves as Totto Land's Minister of Tableware, governing over Cutlery Island."
    },
    {
      "name": "Charlotte Angel",
      "birthday": "02-28",
      "affiliation": "civilian",
      "image": "Charlotte_Angel.png",
      "short_bio": "Charlotte Angel is the seventh daughter and 17th child of the Charlotte Family and the younger triplet sister of Cracker and Custard. She is also an officer of the Big Mom Pirates."
    },
    {
      "name": "Charlotte Cracker",
      "birthday": "02-28",
      "romanized_name": "Shārotto Kurakkā",
      "epithet": "\"Thousand Arms\"",
      "affiliation": "Big Mom Pirates",
      "role": "Sweet Commander",
      "bounty": "860,000,000",
      "devil_fruit": {
        "name": "Bis-Bis Fruit",
        "japanese_name": "Bisu Bisu no Mi",
        "type": "Paramecia",
        "power": "Create and manipulate biscuits"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Grand Line (Totto Land)",
      "age": 45,
      "height": "307 cm",
      "image": "Charlotte-Cracker.png",
      "image_offset": {
        "x": 65,
        "y": 5
      },
      "short_bio": "\"Thousand Arms\" Charlotte Cracker is the tenth son and 15th child of the Charlotte Family and the oldest triplet brother of Custard and Angel. He is also one of the Three Sweet Commanders of the Big Mom Pirates and serves as Totto Land's Minister of Biscuits, governing Biscuits Island. Due to his actions and role, he is a major antagonist in the first half of the Whole Cake Island Arc."
    },
    {
      "name": "Charlotte Custard",
      "birthday": "02-28",
      "affiliation": "civilian",
      "image": "Charlotte_Custard.png",
      "image_offset": {
        "x": 39,
        "y": 5
      },
      "short_bio": "Charlotte Custard is the sixth daughter and 16th child of the Charlotte Family and the middle triplet sister of Cracker and Angel. She is also an officer of the Big Mom Pirates."
    },
    {
      "name": "Kazekage",
      "birthday": "02-28",
      "romanized_name": "Kazekage",
      "affiliation": "Beasts Pirates",
      "role": "Ninja",
      "haki": [],
      "origin": "Grand Line (Wano Country)",
      "age": 43,
      "height": "192 cm",
      "image": "Kazekage.png",
      "short_bio": "Kazekage is a ninja and a member of the Beasts Pirates. He previously was a member of the Orochi Oniwabanshu which served the shogun of Wano Country, Kurozumi Orochi. Due to his actions and role, he is a minor antagonist in the Wano Country Arc."
    },
    {
      "name": "Woop Slap",
      "birthday": "02-28",
      "romanized_name": "Ūpu Surappu",
      "affiliation": "Foosha Village",
      "role": "Mayor",
      "haki": [],
      "origin": "East Blue (Goa Kingdom)",
      "image": "Woop-Slap.png",
      "short_bio": "Woop Slap is the mayor of Monkey D. Luffy's hometown, Foosha Village."
    },
    {
      "name": "Pandaman",
      "birthday": "02-29",
      "romanized_name": "Pandaman",
      "affiliation": "None",
      "role": "Wrestler",
      "bounty": "3,333,333",
      "haki": [],
      "origin": "Tibet",
      "height": "200 cm",
      "image": "Pandaman.png",
      "short_bio": "Pandaman is a joke character created by Eiichiro Oda, and one of the most prominent easter eggs in One Piece. Originally designed for a Kinnikuman character creation contest, Pandaman has gone on to make cameo appearances in many manga chapters, anime episodes, films, and more. He is particularly prominent in several of the video games, even being playable in the first Grand Battle! and its immediate sequel. Due to his status as a joke character, most if not all concrete data on Pandaman has been revealed through the SBS, and may or may not be serious on Oda's part."
    },
    {
      "name": "Aramaki / Ryokugyu",
      "birthday": "02-29",
      "affiliation": "navy"
    },
    {
      "name": "Mikita",
      "birthday": "02-14",
      "affiliation": "unknown",
      "bounty": "7500000",
      "devil_fruit": {
        "name": "Kilo-Kilo Fruit",
        "japanese_name": "Kilo Kilo no Mi",
        "type": "Paramecia",
        "power": "Allows the user's mass to be varied between a featherweight and 10 tons. Note that the user's volume does not change when he changes his mass."
      },
      "age": "24",
      "image": "Mikita-(Miss-Valentine)-(edited).png",
      "image_offset": {
        "x": 36,
        "y": 0
      },
      "short_bio": "\"Courier\" Mikita, more commonly known by her alias Miss Valentine, is a former officer agent who was partnered with Mr. 5. As of now, she is currently working as a chocolate lady alongside most of the other Baroque Works members at the new Spiders Cafe. She is one of the main antagonists of the Whisky Peak Arc and a tertiary antagonist of the Little Garden Arc."
    },
    {
      "name": "Kouzuki Oden",
      "birthday": "02-22",
      "bounty": "Unknown",
      "haki": [],
      "short_bio": "Kouzuki Oden was the daimyo of Kuri in Wano Country and the son of the former shogun Kouzuki Sukiyaki, being a member of the Kouzuki Family. He was the husband of Kouzuki Toki and the father of Momonosuke and Hiyori. Additionally, he was the leader of a group of legendary and powerful samurai known as the Nine Red Scabbards, with all of them serving as his retainers and most trusted allies. For 5 years of his life, Oden set out to sea and became a pirate, serving as the 2nd division commander of the Whitebeard Pirates and later becoming a member of the Roger Pirates. After finding Joy Boy's treasure on Laugh Tale, Oden journeyed home and made it his goal to open Wano's borders to the world by finally taking his father's place as shogun. However, he met opposition from his usurper Kurozumi Orochi and the pirate Kaidou, who executed him 20 years before the present, in an event known as the Legendary Hour. Oden's name was first mentioned during the Zou Arc. He is the posthumous overarching protagonist of the Wano Country Arc, being the protagonist of a series of events taking place in and outside Wano in the past."
    },
    {
      "name": "Minoruba",
      "birthday": "02-18",
      "haki": [],
      "image": "Minoruba-(edited).png",
      "short_bio": "Minoruba is a bounty hunter on Sabaody Archipelago."
    },
    {
      "name": "Pandawomanmi",
      "birthday": "02-29",
      "haki": [],
      "short_bio": "Pandawomanmi is the female version of Pandaman. She first appeared in the Amazon Lily Arc where Pandaman would not be allowed (as men are forbidden on Amazon Lily)."
    },
    {
      "name": "Raizo",
      "birthday": "02-26",
      "haki": [],
      "image": "Raizo-(edited).png",
      "short_bio": "Raizo of the Mist is a ninja from Wano Country and one of the Nine Red Scabbards who served as Kouzuki Oden's retainers. He was born 55 years ago, but traveled 20 years forward in time at the age of 35. Following Kouzuki Momonosuke's ascent to shogun, he serves as the daimyo of Udon. He acts as a major ally to the Straw Hat Pirates during the Zou and Wano Country Arcs."
    }
  ]
}