{
  "characters": [
    {
      "name": "Minorhinoceros",
      "birthday": "03-01",
      "affiliation": "civilian",
      "image": "Minorhinoceros.png",
      "image_offset": {
        "x": 20,
        "y": 5
      },
      "short_bio": "Minorhinoceros is one of the five Jailer Beasts of Impel Down. He is an \"awakened\" Zoan Devil Fruit user, having eaten a Devil Fruit that allows him to turn into a blue rhinoceros. Due to his actions, he can be considered a supporting antagonist of the Impel Down Arc.",
      "status": "alive"
    },
    {
      "name": "Sanji",
      "birthday": "03-02",
      "romanized_name": "Sanji",
      "epithet": "\"Black Leg\"",
      "affiliation": "Straw Hat Pirates",
      "role": "Cook",
      "bounty": "1,032,000,000",
      "haki": [
        "Observation Haki",
        "Armament Haki",
        "Conqueror's Haki"
      ],
      "origin": "North Blue (Germa Kingdom)",
      "age": 21,
      "height": "180 cm",
      "image": "Sanji.png",
      "image_offset": {
        "x": 2,
        "y": 0
      },
      "short_bio": "\"Black Leg\" Sanji is the cook of the Straw Hat Pirates and one of the Senior Officers of the Straw Hat Grand Fleet. He is the fifth member of the crew and the fourth to join, doing so at the end of the Baratie Arc. Born as Vinsmoke Sanji, the third son and fourth child of the Vinsmoke Family (thus, making him a former prince of the Germa Kingdom), he disowned his family twice, once in his youth and again after reuniting with them as an adult. After fleeing the Vinsmokes as a child, he eventually entered the care of Zeff as the sous chef of the Baratie, where he would remain until he met Luffy, who convinced him to join his crew. His dream is to find the rumored chef's paradise, the All Blue, which is where the East Blue, West Blue, North Blue, and South Blue meet, along with their wildlife. He is one of the top three fighters of the Straw Hats, alongside Luffy and Zoro, who is referred to as the \"Monster Trio\". He first gained a bounty of 77,000,000 for his role in the raid on Enies Lobby. It increased to 177,000,000 after the Dressrosa Arc, but the condition of his bounty was changed to Only Alive due to his biological father's interference. After he escaped from Big Mom's territory, his bounty condition was reverted to Dead or Alive (with the Vinsmoke name despite his renouncing it), and its value increased to 330,000,000. Following the Raid on Onigashima, his bounty was increased to 1,032,000,000.",
      "japanese_name": "サンジ",
      "status": "alive"
    },
    {
      "name": "Sanjuan Wolf",
      "birthday": "03-02",
      "romanized_name": "Sanfan Urufu",
      "epithet": "\"Colossal Battleship\"",
      "affiliation": "Blackbeard Pirates",
      "role": "Titanic Captain",
      "devil_fruit": {
        "name": "Huge-Huge Fruit",
        "japanese_name": "Deka Deka no Mi",
        "type": "Paramecia",
        "power": "Gigantic size"
      },
      "haki": [],
      "origin": "West Blue",
      "age": 99,
      "height": "18000 cm",
      "image": "Sanjuan-Wolf-(San-Juan-Wolf).png",
      "image_offset": {
        "x": 50,
        "y": 0
      },
      "short_bio": "Sanjuan Wolf is an enormous giant, known as \"Colossal Battleship\" for his size, and and one of the Ten Titanic Captains of the Blackbeard Pirates, serving as the captain of the seventh ship of the fleet. . He was one of the legendary criminals imprisoned within the sixth level of the great underwater prison Impel Down until he was freed and recruited by Marshall D. Teach. Due to his actions and role, he is a supporting antagonist in the Marineford Arc, a minor antagonist in the Egghead Arc, and a major antagonist in the Final Saga.",
      "japanese_name": "サンファン・ウルフ",
      "status": "alive"
    },
    {
      "name": "Vinsmoke Ichiji",
      "birthday": "03-02",
      "romanized_name": "Vinsumōku Ichiji",
      "epithet": "\"Sparking Red\"",
      "affiliation": "Vinsmoke Family / Germa 66",
      "role": "Prince / Commander",
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "North Blue (Germa Kingdom)",
      "age": 21,
      "height": "186 cm",
      "image": "Vinsmoke-Ichiji.png",
      "image_offset": {
        "x": 12,
        "y": 5
      },
      "short_bio": "Vinsmoke Ichiji, also known as \"Sparking Red\", is the eldest son and second child of the Vinsmoke Family. He is a prince of the Germa Kingdom and a commander in its military arm, Germa 66. Due to his actions, he is a major antagonist during the first half of the Whole Cake Island Arc. However, he and his family became allies of the Straw Hat Pirates and the Fire Tank Pirates after realizing Big Mom deceived and intended to assassinate them. He is also one of the central characters in Germa 66's Ahh... An Emotionless Excursion Cover Page Serial.",
      "japanese_name": "ヴィンスモーク・イチジ",
      "status": "alive"
    },
    {
      "name": "Vinsmoke Niji",
      "birthday": "03-02",
      "romanized_name": "Vinsumōku Niji",
      "epithet": "\"Dengeki Blue\"",
      "affiliation": "Vinsmoke Family / Germa 66",
      "role": "Prince / Commander",
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "North Blue (Germa Kingdom)",
      "age": 21,
      "height": "185 cm",
      "image": "Vinsmoke-Niji.png",
      "image_offset": {
        "x": 0,
        "y": 5
      },
      "short_bio": "Vinsmoke Niji, also known as \"Dengeki Blue\", is the second son and third child of the Vinsmoke Family. He is a prince of the Germa Kingdom and a commander in its military arm, Germa 66. Due to his actions, he is a major antagonist during the first half of the Whole Cake Island Arc. However, he and his family became allies of the Straw Hat Pirates and the Fire Tank Pirates after realizing Big Mom deceived and intended to assassinate them. He is also one of the central characters in Germa 66's Ahh... An Emotionless Excursion Cover Page Serial.",
      "japanese_name": "ヴィンスモーク・ニジ",
      "status": "alive"
    },
    {
      "name": "Vinsmoke Yonji",
      "birthday": "03-02",
      "romanized_name": "Vinsumōku Yonji",
      "epithet": "\"Winch Green\"",
      "affiliation": "Vinsmoke Family / Germa 66",
      "role": "Prince / Commander",
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "North Blue (Germa Kingdom)",
      "age": 21,
      "height": "194 cm",
      "image": "Vinsmoke-Yonji.png",
      "image_offset": {
        "x": 15,
        "y": 5
      },
      "short_bio": "Vinsmoke Yonji, also known as \"Winch Green\", is the fourth son and youngest child of the Vinsmoke Family. He is a prince of the Germa Kingdom and a commander in its military arm, Germa 66. Due to his actions, he is a major antagonist during the first half of the Whole Cake Island Arc. However, he and his family became allies of the Straw Hat Pirates and the Fire Tank Pirates after realizing Big Mom deceived and intended to assassinate them. He is also one of the central characters in Germa 66's Ahh... An Emotionless Excursion Cover Page Serial.",
      "japanese_name": "ヴィンスモーク・ヨンジ",
      "status": "alive"
    },
    {
      "name": "Galdino",
      "birthday": "03-03",
      "romanized_name": "Gyarudīno",
      "epithet": "\"Mr. 3\"",
      "affiliation": "Cross Guild",
      "role": "Officer",
      "bounty": "24,000,000",
      "devil_fruit": {
        "name": "Wax-Wax Fruit",
        "japanese_name": "Doru Doru no Mi",
        "type": "Paramecia",
        "power": "Create and manipulate wax"
      },
      "haki": [
        "Observation Haki"
      ],
      "origin": "South Blue",
      "age": 37,
      "height": "179 cm",
      "image": "Galdino-(Mr.-3).png",
      "image_offset": {
        "x": 97,
        "y": 5
      },
      "short_bio": "\"Loan Shark\" Galdino, alias Mr. 3, is a former officer agent of Baroque Works, partnered with \"Miss Goldenweek\" Marianne. After being sent to Impel Down, he assisted Buggy and Monkey D. Luffy during their prison breakout and the Summit War of Marineford. When the war ended, he became a member of the Buggy Pirates. After Buggy became a Warlord of the Sea, the Buggy and Alvida Alliance evolved into the Underworld organization known as Buggy's Delivery. The organization was integrated into a larger one, Cross Guild, of which he is currently a member. He is the main antagonist of the Little Garden Arc and a supporting antagonist of the Arabasta Saga as a whole, one of the central characters of the Miss Goldenweek's \"Operation: Meet Baroque Works\" cover arc (along with the rest of Baroque Works' Officer Agents), and a supporting ally during the Impel Down and Marineford Arcs.",
      "japanese_name": "ギャルディーノ",
      "status": "alive"
    },
    {
      "name": "Hina",
      "birthday": "03-03",
      "romanized_name": "Hina",
      "epithet": "\"Black Cage\"",
      "affiliation": "Marines",
      "role": "Rear Admiral",
      "devil_fruit": {
        "name": "Bind-Bind Fruit",
        "japanese_name": "Ori Ori no Mi",
        "type": "Paramecia",
        "power": "Bind enemies with iron shackles"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "West Blue",
      "age": 34,
      "height": "181 cm",
      "image": "Hina.png",
      "short_bio": "\"Black Cage\" Hina is a Marine Rear Admiral and a former classmate of Vice Admiral Smoker. She currently leads the Black Cage Corps, a unit (containing Jango and Fullbody among others) tasked with patrolling the seas around the Arabasta Kingdom. Originally introduced as a captain, she was promoted to the rank of rear admiral some time after the Summit War of Marineford.",
      "japanese_name": "ヒナ",
      "status": "alive"
    },
    {
      "name": "O-Tama",
      "birthday": "03-03",
      "romanized_name": "Kurozumi Tama",
      "affiliation": "Kouzuki Family",
      "role": "Kunoichi (in training)",
      "devil_fruit": {
        "name": "Millet-Millet Fruit",
        "japanese_name": "Kibi Kibi no Mi",
        "type": "Paramecia",
        "power": "Tame animals with dango"
      },
      "haki": [],
      "origin": "Grand Line (Wano Country)",
      "age": 8,
      "height": "108 cm",
      "image": "Tama-(Otama).png",
      "short_bio": "Kurozumi Tama, commonly known as O-Tama, is a girl from the region of Kuri in Wano Country. She is a kasa weaver working under Tenguyama Hitetsu, as well as a kunoichi in training under the apprenticeship of Shinobu. She is the last known survivor of the Kurozumi Family. Tama befriended Portgas D. Ace four years ago, having wished to join his crew at the time. She is a major ally of the Ninja-Pirate-Mink-Samurai Alliance during the Wano Country Arc.",
      "japanese_name": "黒炭玉",
      "status": "alive"
    },
    {
      "name": "Masira",
      "birthday": "03-04",
      "romanized_name": "Mashira",
      "epithet": "\"Salvage King\"",
      "affiliation": "Saruyama Alliance",
      "role": "Boss",
      "bounty": "23,000,000",
      "haki": [],
      "origin": "North Blue",
      "age": 25,
      "height": "345 cm",
      "image": "Masira.png",
      "image_offset": {
        "x": 48,
        "y": 5
      },
      "short_bio": "\"Salvage King\" Masira is the of the Masira Pirates and the head of a simian ship salvage operation near Jaya Island. His sworn brother is Shoujou and both of them are members of the Saruyama Alliance, headed by Mont Blanc Cricket. He and Shoujou are both fans of Mont Blanc Noland's exploits and the fairy tale book based on them. He became an ally of the Straw Hat Pirates during the Jaya Arc.",
      "japanese_name": "マシラ",
      "status": "alive"
    },
    {
      "name": "Minotaurus",
      "birthday": "03-04",
      "affiliation": "civilian",
      "image": "Minotaurus.png",
      "image_offset": {
        "x": 63,
        "y": 5
      },
      "short_bio": "Minotaurus is one of the five Jailer Beasts in Impel Down and the first one to appear. He is an \"awakened\" Zoan Devil Fruit user who ate a fruit that allows him to turn into a Holstein cow. Due to his actions, he can be considered a supporting antagonist of the Impel Down Arc.",
      "status": "alive"
    },
    {
      "name": "Minokoala",
      "birthday": "03-05",
      "affiliation": "civilian",
      "image": "Minokoala.png",
      "image_offset": {
        "x": 55,
        "y": 5
      },
      "short_bio": "Minokoala is one of the five Jailer Beasts of Impel Down. He is an \"awakened\" Zoan Devil Fruit user that ate a fruit that allows him to turn into a koala. Due to his actions, he can be considered a supporting antagonist of the Impel Down Arc.",
      "status": "alive"
    },
    {
      "name": "Sadi",
      "birthday": "03-05",
      "romanized_name": "Sadi-chan",
      "epithet": "\"Little Sadi\"",
      "affiliation": "Impel Down",
      "role": "Chief Guard",
      "haki": [],
      "origin": "Grand Line",
      "age": 23,
      "height": "183 cm",
      "image": "Sadi-chan-(Little-Sadie).png",
      "image_offset": {
        "x": 26,
        "y": 5
      },
      "short_bio": "Sadi is a chief guard of Impel Down. She always wants to be addressed as Little Sadi. Due to her actions, she is a major antagonist in the Impel Down Arc.",
      "japanese_name": "サディちゃん",
      "status": "alive"
    },
    {
      "name": "Charlotte Brûlée",
      "birthday": "03-06",
      "romanized_name": "Shārotto Buryure",
      "affiliation": "Charlotte Family",
      "role": "Officer",
      "devil_fruit": {
        "name": "Mirror-Mirror Fruit",
        "japanese_name": "Mira Mira no Mi",
        "type": "Paramecia",
        "power": "Mirror world dimension"
      },
      "haki": [
        "Observation Haki"
      ],
      "origin": "Grand Line (Totto Land)",
      "age": 43,
      "height": "350 cm",
      "image": "Charlotte-Brûlée-(Brulee).png",
      "image_offset": {
        "x": 32,
        "y": 5
      },
      "short_bio": "Charlotte Brûlée is the eighth daughter and 19th child of the Charlotte Family and the older twin sister of Broyé. She is also an officer of the Big Mom Pirates. She was stationed in the Seducing Woods to ambush the Sanji Retrieval Team, but after being defeated, the team used her Devil Fruit ability to enter an alternate dimension known as Mirro-World to move around Totto Land. Due to her actions and role, she is a major antagonist in the Whole Cake Island Arc. She, alongside her siblings Charlotte Katakuri and Charlotte Oven, become temporary and reluctant allies of the Straw Hat Pirates during One Piece Film: Red.",
      "japanese_name": "シャーロット・ブリュレ",
      "status": "alive"
    },
    {
      "name": "Jaguar D. Saul",
      "birthday": "03-06",
      "romanized_name": "Haguwāru Dī Sauro",
      "affiliation": "Marines (former)",
      "role": "Vice Admiral (former)",
      "haki": [
        "Armament Haki"
      ],
      "origin": "South Blue",
      "age": 127,
      "height": "1950 cm",
      "image": "Jaguar-D.-Saul.png",
      "short_bio": "Jaguar D. Saul is a giant and former Vice Admiral who deserted the Marines and happened to wash ashore on Ohara. During the Buster Call that destroyed Ohara 22 years ago, he risked his life to protect a young Nico Robin and ended up frozen by fellow former Vice Admiral Kuzan. While Robin and the World Government presumed that he had died, he had actually survived. After collecting the books that Ohara's scholars sacrificed themselves to save, he brought them to Elbaph and went into hiding, after which he stayed and became a history teacher for the Walrus School, located on Elbaph's \"Sun World\" level. He is a major ally of the Straw Hat Pirates during the Elbaph Arc.",
      "japanese_name": "ハグワール・D・サウロ",
      "status": "alive"
    },
    {
      "name": "Salome",
      "birthday": "03-06",
      "romanized_name": "Sarome",
      "affiliation": "Kuja Pirates",
      "role": "Snake Weapon",
      "haki": [],
      "origin": "Calm Belt (Amazon Lily)",
      "image": "Salome.png",
      "short_bio": "Salome is Boa Hancock’s personal Snake Weapon.",
      "japanese_name": "サロメ",
      "status": "alive"
    },
    {
      "name": "Gyoru",
      "birthday": "03-07",
      "romanized_name": "Gyoru",
      "affiliation": "Goa Kingdom",
      "role": "Fishmonger",
      "haki": [],
      "origin": "East Blue (Goa Kingdom)",
      "image": "Gyoru-(Gyoll).png",
      "short_bio": "Gyoru is a fishmonger in Foosha Village and the husband of Chicken. Luffy bought fish from him when he was a kid.",
      "japanese_name": "ギョル",
      "status": "alive"
    },
    {
      "name": "Minozebra",
      "birthday": "03-07",
      "affiliation": "civilian",
      "image": "Minozebra.png",
      "image_offset": {
        "x": 20,
        "y": 5
      },
      "short_bio": "Minozebra is one of the five Jailer Beasts of Impel Down. He is an \"awakened\" Zoan Devil Fruit user that ate a fruit that allows him to turn into a zebra. Due to his actions, he can be considered a supporting antagonist of the Impel Down Arc.",
      "status": "alive"
    },
    {
      "name": "Zambai",
      "birthday": "03-08",
      "romanized_name": "Zanbai",
      "affiliation": "Galley-La Company / Franky Family (former)",
      "role": "Union Worker",
      "haki": [],
      "origin": "Grand Line (Water 7)",
      "age": 35,
      "height": "227 cm",
      "image": "Zambai.png",
      "image_offset": {
        "x": 40,
        "y": 5
      },
      "short_bio": "Zambai is a ship dismantler from Water 7, who was a member of the Franky Family and Franky's right hand man. After the timeskip, he, Kiev, and Tamagon have joined the Galley-La Company as Zambai's Company Union. He became an ally of the Straw Hat Pirates during the end of the Water 7 Arc and the beginning of the Enies Lobby Arc, having started off as a minor antagonist in the former.",
      "japanese_name": "ザンバイ",
      "status": "alive"
    },
    {
      "name": "Dracule Mihawk",
      "birthday": "03-09",
      "romanized_name": "Jurakyūru Mihōku",
      "epithet": "\"Hawk Eyes\"",
      "affiliation": "Cross Guild",
      "role": "Chief Officer / Swordsman",
      "bounty": "3,590,000,000",
      "haki": [
        "Observation Haki",
        "Armament Haki"
      ],
      "origin": "Unknown",
      "age": 43,
      "height": "198 cm",
      "image": "Dracule-Mihawk.png",
      "short_bio": "Dracule \"Hawk Eyes\" Mihawk is a world-famous pirate currently recognized as the strongest swordsman in the world. Known as the \"Marine Hunter\" in his early career, Mihawk stood as one of the Seven Warlords of the Sea (the first to be revealed and formally introduced) until the group's dissolution, and was for a time the sole human resident of Kuraigana Island. Since then, he has become a founding executive of the Cross Guild, alongside fellow ex-Warlord Crocodile. Mihawk once led a renowned rivalry with Shanks, currently one of the Four Emperors. In turn, he is viewed as the ultimate opponent by Roronoa Zoro, who pursues his own dream of becoming the world's strongest swordsman. Though Mihawk easily won their first encounter, he grew to respect Zoro, and agreed to mentor him in further swordsmanship during the timeskip. Like the other ex-Warlords, Mihawk has been cloned by Dr. Vegapunk to create one of the Seraphim, S-Hawk, as part of a project to replace the Warlord system. Due to his actions and role, Mihawk can be considered a supporting antagonist in the Baratie Arc and one of the major antagonists in the Marineford Arc, where he took part in the Summit War of Marineford on the side of the Marines, along with most of the other Warlords of the Sea.",
      "japanese_name": "ジュラキュール・ミホーク",
      "status": "alive"
    },
    {
      "name": "Franky",
      "birthday": "03-09",
      "romanized_name": "Furankī",
      "epithet": "\"Iron Man\"",
      "affiliation": "Straw Hat Pirates",
      "role": "Shipwright",
      "bounty": "394,000,000",
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "South Blue",
      "age": 36,
      "height": "240 cm",
      "image": "Franky.png",
      "image_offset": {
        "x": 60,
        "y": 5
      },
      "short_bio": "\"Iron Man\" Franky is the shipwright of the Straw Hat Pirates and one of the Senior Officers of the Straw Hat Grand Fleet. He is the crew's eighth member and the seventh to join, doing so at the end of the Post-Enies Lobby Arc. Franky was born in the South Blue to Scien, an infamous scientist and pirate who would later be known as Queen of the Beasts Pirates. After his parents abandoned him as a 10-year-old, he eventually made his way to Water 7. Born \"Cutty Flam\", he chose to go by his nickname of \"Franky\" until he eventually permanently discarded his true name per the request of Iceburg to hide his identity. He worked as a shipwright of Tom's Workers until, during a failed attempt to save his mentor Tom from the World Government, his body was heavily damaged, requiring him to augment himself into a cyborg. Upon returning to Water 7, he became the leader of the Franky Family, a group of ship dismantlers and bounty hunters. Franky and his followers were introduced as the secondary antagonists of the Water 7 Arc, until circumstances forced them to become allies at the end of the same arc and the Enies Lobby Arc. Franky's dream is to create a ship and circumnavigate the world with it, and he built the Thousand Sunny and joined the Straw Hat Pirates to fulfill his dream. He gained a bounty of 44,000,000 for his involvement at the Enies Lobby Incident. It later increased to 94,000,000 after the Dressrosa Arc. Following the Raid on Onigashima, his bounty was increased to 394,000,000.",
      "japanese_name": "フランキー",
      "status": "alive"
    },
    {
      "name": "Shanks",
      "birthday": "03-09",
      "romanized_name": "Shankusu",
      "epithet": "\"Red-Haired\"",
      "affiliation": "Red Hair Pirates",
      "role": "Captain / Emperor",
      "bounty": "4,048,900,000",
      "haki": [
        "Conqueror's Haki",
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "West Blue",
      "age": 39,
      "height": "199 cm",
      "image": "Shanks-(4).png",
      "image_offset": {
        "x": 73,
        "y": 5
      },
      "short_bio": "\"Red-Haired\" Shanks, commonly known as just \"Red Hair\", is the chief of the Red Hair Pirates and one of the Four Emperors that rule over the New World. Born in God Valley to the Figarland Family of the World Nobles, Shanks is the son of Figarland Garling and the younger twin brother of Shamrock. However, as an infant during the God Valley Incident, Shanks was bequeathed to Monkey D. Dragon by his mother. He ended up in a treasure chest which was stolen by the Roger Pirates, resulting in him being adopted and raised onboard the Oro Jackson. He served on Gol D. Roger's crew as an apprentice alongside Buggy. After Roger's death, Shanks began to assemble his own crew, only to then return to Mary Geoise to reunite with his family and join the Knights of God, becoming Saint Shanks. However, Shanks ultimately abdicated his noble status after working against Mary Geoise; he then rapidly attained infamy as a pirate before being named as one of the Emperors six years ago. Shanks is a major figure in Monkey D. Luffy's life, having saved his life as a child twelve years ago and inspiring Luffy to set his own path as a pirate to surpass him someday. He gave Luffy the straw hat that Roger once wore, as a symbol of their promise to meet again once Luffy had surpassed him, and also accidentally enabled Luffy to eat the Gomu Gomu no Mi. Two years ago, Shanks was pivotal in bringing the Summit War of Marineford to a close. Following the downfall of his rival Emperors in Wano Country, Shanks has set his sights on claiming the One Piece. Shanks has been an important background character throughout the series, usually being shown acknowledging Luffy's ever-growing reputation as a pirate. He serves as a minor ally to Luffy during both the Marineford and Wano Country Arcs. He and his crew also have a sizable role in One Piece Film: Red, which centers on Uta, Shanks' adopted daughter.",
      "japanese_name": "シャンクス",
      "status": "alive"
    },
    {
      "name": "Hotori",
      "birthday": "03-10",
      "romanized_name": "Hotori",
      "affiliation": "God's Army",
      "role": "Lieutenant",
      "haki": [
        "Observation Haki"
      ],
      "origin": "Sky Island (Birka)",
      "age": 27,
      "height": "179 cm",
      "image": "Hotori-and-Kotori.png",
      "short_bio": "Hotori and Kotori are the younger brothers of Satori. They are lieutenants of the Divine Soldiers, an army of 50 warriors under the command of Yama, their leader, and Enel. They are minor antagonists during the Skypiea Arc.",
      "japanese_name": "ホトリ",
      "status": "unknown"
    },
    {
      "name": "Kotori",
      "birthday": "03-10",
      "romanized_name": "Kotori",
      "affiliation": "God's Army",
      "role": "Lieutenant",
      "haki": [
        "Observation Haki"
      ],
      "origin": "Sky Island (Birka)",
      "age": 27,
      "height": "179 cm",
      "image": "Hotori-and-Kotori.png",
      "short_bio": "Hotori and Kotori are the younger brothers of Satori. They are lieutenants of the Divine Soldiers, an army of 50 warriors under the command of Yama, their leader, and Enel. They are minor antagonists during the Skypiea Arc.",
      "japanese_name": "コトリ",
      "status": "unknown"
    },
    {
      "name": "Nola",
      "birthday": "03-10",
      "romanized_name": "Nora",
      "epithet": "\"Master of the Sky\"",
      "affiliation": "Shandia",
      "role": "Snake",
      "haki": [],
      "origin": "Grand Line (Jaya)",
      "age": 400,
      "height": "20000 cm",
      "image": "Nola-(baby).png",
      "image_offset": {
        "x": 51,
        "y": 5
      },
      "short_bio": "Nola, known to many as the Master of the Sky, is a giant snake who lives on Upper Yard in Skypiea. Having lived for over four centuries, the snake was once the companion of Kalgara and Mont Blanc Noland back when Upper Yard was still part of Jaya. It is the grandchild of the snake Kashigami, whom the Shandia once worshiped as a god.",
      "japanese_name": "ノラ",
      "status": "alive"
    },
    {
      "name": "Satori",
      "birthday": "03-10",
      "romanized_name": "Satori",
      "epithet": "\"Satori of the Forest\"",
      "affiliation": "God's Army",
      "role": "Priest",
      "haki": [
        "Observation Haki"
      ],
      "origin": "Sky Island (Birka)",
      "age": 27,
      "height": "179 cm",
      "image": "Satori.png",
      "short_bio": "Satori of the Forest is one of four former priests of Enel's God's Army, operating the Ordeal of Balls to punish criminals during Enel's reign. He is also the oldest triplet brother of Hotori and Kotori. Due to his actions, he is a major antagonist of the Skypiea Arc.",
      "japanese_name": "サトリ",
      "status": "unknown"
    },
    {
      "name": "Sentomaru",
      "birthday": "03-10",
      "romanized_name": "Sentōmaru",
      "affiliation": "Marines / Science Unit",
      "role": "Captain / Bodyguard",
      "bounty": "500,000,000",
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Grand Line",
      "age": 34,
      "height": "279 cm",
      "image": "Sentomaru.png",
      "short_bio": "Sentomaru is a former Marine Officer and the former captain of the Marines' Science Unit, as well as Dr. Vegapunk's former bodyguard. He turned against the World Government and the Marines by siding with Vegapunk and the Straw Hat Pirates during the Egghead Incident. Due to his actions, he can be considered a supporting antagonist in the Sabaody Archipelago Arc and the secondary antagonist of the Return to Sabaody Arc. He is an ally of the Straw Hat Pirates in the Egghead Arc.",
      "japanese_name": "戦桃丸",
      "status": "alive"
    },
    {
      "name": "Palms",
      "birthday": "03-11",
      "affiliation": "civilian",
      "image": "Palms.png",
      "image_offset": {
        "x": 83,
        "y": 5
      },
      "status": "alive"
    },
    {
      "name": "Spandam",
      "birthday": "03-11",
      "romanized_name": "Supandamu",
      "affiliation": "CP0",
      "role": "Agent",
      "haki": [],
      "origin": "Grand Line",
      "age": 41,
      "height": "192 cm",
      "image": "Spandam-(Spanda)-(past).png",
      "image_offset": {
        "x": 42,
        "y": 5
      },
      "short_bio": "Spandam is the former chief of CP9 and CP5. He is the son of Spandine, who was also his predecessor as the chief of CP9. He currently serves under CP0. He planned to obtain the blueprints for Pluton and bring Nico Robin to justice. Ten years ago, he framed Tom's Workers for a bombing attack on Water 7, which caused Tom to take responsibility and be executed. As revenge, Franky disfigured his face. He is the main antagonist of the Water 7 Saga, appearing as the overarching antagonist of the Water 7 Arc and the main antagonist of the Enies Lobby Arc. He also appears as a minor antagonist in One Piece Film: Gold.",
      "japanese_name": "スパンダム",
      "status": "alive"
    },
    {
      "name": "Patty",
      "birthday": "03-12",
      "romanized_name": "Pati",
      "affiliation": "Baratie",
      "role": "Cook",
      "haki": [],
      "origin": "East Blue",
      "age": 29,
      "height": "204 cm",
      "image": "Patty.png",
      "image_offset": {
        "x": 84,
        "y": 5
      },
      "short_bio": "Patty is one of the main cooks at the Baratie, currently serving as the restaurant's head pâtissier.",
      "japanese_name": "パティ",
      "status": "alive"
    },
    {
      "name": "Sarutobi",
      "birthday": "03-12",
      "affiliation": "civilian",
      "image": "Sarutobi.png",
      "image_offset": {
        "x": 65,
        "y": 5
      },
      "short_bio": "Sarutobi is a ninja and a member of the Beasts Pirates. He previously was a member of the Orochi Oniwabanshu which served the shogun of Wano Country, Kurozumi Orochi. Due to his actions and role, he is a minor antagonist in the Wano Country Arc.",
      "status": "alive"
    },
    {
      "name": "Lafitte",
      "birthday": "03-13",
      "romanized_name": "Rafitto",
      "epithet": "\"Demon Sheriff\"",
      "affiliation": "Blackbeard Pirates",
      "role": "Chief of Staff / Titanic Captain",
      "bounty": "42,200,000",
      "devil_fruit": {
        "name": "Unknown (Wings)",
        "japanese_name": "Unknown",
        "type": "Unknown",
        "power": "Flight and Hypnosis"
      },
      "haki": [],
      "origin": "West Blue",
      "age": 41,
      "height": "340 cm",
      "image": "Laffitte-(Lafitte).png",
      "image_offset": {
        "x": 17,
        "y": 5
      },
      "short_bio": "Laffitte, nicknamed \"Demon Sheriff\", is the navigator and one of the Ten Titanic Captains of the Blackbeard Pirates, serving as the captain of the fifth ship of the fleet. He is also a former West Blue policeman known for countless acts of police brutality, which resulted in his exile from that sea. Due to his actions and role, he is a minor antagonist in the Jaya Arc, a supporting antagonist in the Impel Down and Marineford Arcs, and a major antagonist in the Final Saga.",
      "japanese_name": "ラフィット",
      "status": "alive"
    },
    {
      "name": "Alvida",
      "birthday": "03-14",
      "romanized_name": "Arubida",
      "epithet": "\"Iron Mace\"",
      "affiliation": "Cross Guild",
      "role": "Chieftain",
      "bounty": "5,000,000",
      "devil_fruit": {
        "name": "Slip-Slip Fruit",
        "japanese_name": "Sube Sube no Mi",
        "type": "Paramecia",
        "power": "Slippery skin"
      },
      "haki": [],
      "origin": "East Blue",
      "age": 27,
      "height": "198 cm",
      "image": "Alvida-(fat).png",
      "short_bio": "\"Iron Mace\" Alvida is the former captain of the Alvida Pirates, and the first enemy pirate Monkey D. Luffy encountered in his own pirate career. After her defeat by Luffy, she met and allied with Buggy to form the Buggy and Alvida Alliance, and for a time became the acting captain during Buggy's entanglements in Impel Down and the Summit War of Marineford. Since then, she has remained with the crew throughout Buggy's revolving fortunes, occupying high positions in both Buggy's Delivery and the Cross Guild. Due to her actions, she can be regarded as the secondary antagonist of the Romance Dawn Arc and a tertiary antagonist in the Loguetown Arc.",
      "japanese_name": "アルビダ",
      "status": "alive"
    },
    {
      "name": "Charlotte Perospero",
      "birthday": "03-14",
      "romanized_name": "Shārotto Perosuperō",
      "epithet": "\"Candy Man\"",
      "affiliation": "Charlotte Family",
      "role": "Minister of Candy",
      "bounty": "700,000,000",
      "devil_fruit": {
        "name": "Lick-Lick Fruit",
        "japanese_name": "Pero Pero no Mi",
        "type": "Paramecia",
        "power": "Create and control candy"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Grand Line (Totto Land)",
      "age": 50,
      "height": "333 cm",
      "image": "Charlotte-Perospero-(Charlotte-Perosperaw).png",
      "short_bio": "Charlotte Perospero is the eldest child of the Charlotte Family and an officer of the Big Mom Pirates. He also serves as Totto Land's Minister of Candy, governing over Candy Island. Due to his actions and role, he is a major antagonist in the Whole Cake Island Arc and a supporting antagonist in the Wano Country Arc.",
      "japanese_name": "シャーロット・ペロスペロー",
      "status": "alive"
    },
    {
      "name": "Smoker",
      "birthday": "03-14",
      "romanized_name": "Sumōkā",
      "epithet": "\"White Hunter\"",
      "affiliation": "Marines (G-5)",
      "role": "Vice Admiral",
      "devil_fruit": {
        "name": "Smoke-Smoke Fruit",
        "japanese_name": "Moku Moku no Mi",
        "type": "Logia",
        "power": "Control and transform into smoke"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Grand Line (Loguetown)",
      "age": 36,
      "height": "209 cm",
      "image": "Smoker.png",
      "short_bio": "Smoker the White Hunter is a Marine vice-admiral and the commander of G-5 Branch's Unit 01, as well as the overall Base Commander of the G-5 Marine base. Originally a ranking captain in Loguetown, Smoker became fixated on Monkey D. Luffy's Straw Hat Pirates for escaping his previously-unbroken authority, and—with his loyal subordinate Tashigi—quit his post to pursue them into the Grand Line. Since then, he has battled the Straw Hats repeatedly, in addition to many larger threats that won him new recognition and promotion through the Marine Ranks. One of Luffy's longest-recurring adversaries, Smoker can be considered the main antagonist of the Loguetown Arc, and a minor antagonist during the Marineford Arc. Though playing a similar role initially, he becomes a temporary ally during the Arabasta Arc and Punk Hazard Arc.",
      "japanese_name": "スモーカー",
      "status": "alive"
    },
    {
      "name": "Who's-Who",
      "birthday": "03-15",
      "romanized_name": "Fūzu Fū",
      "epithet": "\"Who of the Droplets\"",
      "affiliation": "Beasts Pirates (former)",
      "role": "Tobiroppo (former)",
      "bounty": "546,000,000",
      "devil_fruit": {
        "name": "Cat-Cat Fruit, Model: Saber Tiger",
        "japanese_name": "Neko Neko no Mi, Model: Saber Tiger",
        "type": "Ancient Zoan",
        "power": "Transform into a saber-toothed tiger"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "North Blue",
      "age": 38,
      "height": "336 cm",
      "image": "Who_s-Who.png",
      "image_offset": {
        "x": 50,
        "y": 4
      },
      "short_bio": "'''Who's-Who, also known as Who of the Droplets''', is a pirate who acted as one of the Tobiroppo, the strongest six Shinuchi of the Beasts Pirates, prior to Kaidou's fall from power after the Raid on Onigashima. Over a decade ago, he served as an agent of CP9 before his failure to guard the Gomu Gomu no Mi led to his dismissal from service and imprisonment. Upon escaping, Who's-Who turned to piracy, becoming captain of the Who's-Who Pirates before eventually joining the Beasts Pirates. Due to his actions and role, Who's-Who is a supporting antagonist in the Wano Country Arc and the Oni Child Yamato's Golden Harvest Surrogate Pilgrimage cover story.",
      "japanese_name": "フーズ・フー",
      "status": "alive"
    },
    {
      "name": "Tom",
      "birthday": "03-16",
      "romanized_name": "Tomu",
      "affiliation": "Tom's Workers",
      "role": "Shipwright",
      "haki": [],
      "origin": "Grand Line (Fish-Man Island)",
      "age": 67,
      "height": "296 cm",
      "image": "Tom.png",
      "image_offset": {
        "x": 52,
        "y": 0
      },
      "short_bio": "Tom was a long-horned cowfish fish-man known as the greatest shipwright in the world, particularly for building the Roger Pirates' ship, the Oro Jackson. He was also the older brother of Den, a fellow fish-man shipwright. As the head of Tom's Workers, Tom was pivotal to the redevelopment of Water 7, directly mentoring both Iceburg and Franky and laying groundwork for what would become the Galley-La Company. His ultimate innovation, the Sea Train, impressed even the World Government into pardoning his associations with Pirate King Gol D. Roger. However, in order to protect his apprentices from a frame-up orchestrated by CP5's Spandam, Tom renounced this pardon and was taken to Enies Lobby, presumably to be executed shortly after.",
      "japanese_name": "トム",
      "status": "deceased"
    },
    {
      "name": "Ideaman",
      "birthday": "03-17",
      "romanized_name": "Aideaman",
      "affiliation": "Krieg Pirates",
      "role": "Staff Officer",
      "haki": [],
      "origin": "East Blue",
      "image": "Ideaman.png",
      "image_offset": {
        "x": 15,
        "y": 5
      },
      "short_bio": "Ideaman is a member of Krieg Pirates. He is the Staff Officer of Planning.",
      "japanese_name": "アイデアマン",
      "status": "alive"
    },
    {
      "name": "Trebol",
      "birthday": "03-18",
      "romanized_name": "Torēboru",
      "affiliation": "Donquixote Pirates",
      "role": "Elite Officer",
      "bounty": "99,000,000",
      "devil_fruit": {
        "name": "Stick-Stick Fruit",
        "japanese_name": "Beta Beta no Mi",
        "type": "Paramecia",
        "power": "Create sticky mucus"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "North Blue",
      "age": 49,
      "height": "349 cm",
      "image": "Trebol.png",
      "image_offset": {
        "x": 56,
        "y": 5
      },
      "short_bio": "Sticky-Sticky Fruit (FUNimation) Trebol is one of the top three officers of the Donquixote Pirates, acting as a Staff Officer. He occupies the Club seat of the Donquixote Family and is the leader of the crew's Trebol Army subdivision. He is also personally responsible for fostering Donquixote Doflamingo's cruelty from a young age, making him the indirect cause of an inhumanly large amount of evil and suffering brought about by Doflamingo's wrath. Because of this, he can be considered a tertiary antagonist in the Dressrosa Arc with a greater influence and impact than what is first suggested in his initial appearances.",
      "japanese_name": "トレーボル",
      "status": "alive"
    },
    {
      "name": "Atmos",
      "birthday": "03-19",
      "romanized_name": "Atomosu",
      "epithet": "\"Water Buffalo\"",
      "affiliation": "Whitebeard Pirates",
      "role": "13th Division Commander",
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "West Blue",
      "image": "Atmos.png",
      "image_offset": {
        "x": 19,
        "y": 5
      },
      "short_bio": "\"Water Buffalo\" Atmos is the former 13th division commander of the Whitebeard Pirates.",
      "japanese_name": "アトモス",
      "status": "alive"
    },
    {
      "name": "Scratchmen Apoo",
      "birthday": "03-19",
      "romanized_name": "Sukuratchimen Apū",
      "epithet": "\"Roar of the Sea\"",
      "affiliation": "On Air Pirates",
      "role": "Captain",
      "bounty": "350,000,000",
      "devil_fruit": {
        "name": "Tone-Tone Fruit",
        "japanese_name": "Oto Oto no Mi",
        "type": "Paramecia",
        "power": "Turn body parts into instruments"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Grand Line",
      "age": 31,
      "height": "256 cm",
      "image": "Scratchmen-Apoo.png",
      "short_bio": "Scratchmen Apoo, also known as \"Roar of the Sea\", is the captain of the On Air Pirates and was formerly an informant for the Beasts Pirates, led by Kaidou of the Four Emperors. He is a member of the Longarm Tribe and one of twelve pirates who are referred to as the \"Worst Generation\", being one of the eleven Supernovas who came to Sabaody Archipelago two years ago with a bounty of 198,000,000. Two years later, his bounty increased to 350,000,000. Due to his actions and role, he is a supporting antagonist in the Wano Country Arc.",
      "japanese_name": "スクラッチメン・アプー",
      "status": "alive"
    },
    {
      "name": "Sabo",
      "birthday": "03-20",
      "romanized_name": "Sabo",
      "epithet": "\"Flame Emperor\"",
      "affiliation": "Revolutionary Army",
      "role": "Chief of Staff",
      "bounty": "602,000,000",
      "devil_fruit": {
        "name": "Flame-Flame Fruit",
        "japanese_name": "Mera Mera no Mi",
        "type": "Logia",
        "power": "Control fire"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "East Blue (Goa Kingdom)",
      "age": 22,
      "height": "187 cm",
      "image": "Sabo.png",
      "short_bio": "\"Flame Emperor\" Sabo is the Revolutionary Army's chief of staff, recognized as the No. 2 of the entire organization under Supreme Commander Monkey D. Dragon. He is also the sworn brother of the notorious pirates Monkey D. Luffy and the late Portgas D. Ace. Raised in nobility by his parents Outlook III and Didit in the Goa Kingdom, Sabo ran away and met Ace and Luffy while living as a vagabond in Gray Terminal. He tried to set sail just a few months afterward to get away from his family, but had his ship destroyed by the World Noble Saint Jalmack. He was saved by Dragon but lost his memory in the process, and so devoted his life to the service of the Revolutionary Army. However, his memories would return 10 years later after hearing about Ace's death. Two years after regaining his memories, Sabo would reunite with Luffy and also carry Ace's legacy by consuming his Devil Fruit, the Mera Mera no Mi. After storming the Holy Land during the most recent Levely with several other commanders of the Revolutionary Army, Sabo was framed for the assassination of Nefertari Cobra, increasing his notoriety across the world and sparking several rebellions. He acts as an ally of Luffy during the Dressrosa Arc, as well as the movies One Piece Film: Gold and One Piece: Stampede.",
      "japanese_name": "サボ",
      "status": "alive"
    },
    {
      "name": "Shiki",
      "birthday": "03-20",
      "affiliation": "civilian",
      "image": "Shiki.png",
      "short_bio": "Shiki the Golden Lion, also known as the \"Flying Pirate\", is the admiral and helmsman of the Golden Lion Pirates. He is also a former member of the Rocks Pirates and the first known prisoner to have ever escaped from Impel Down. Shiki wreaked havoc on the seas during Roger's time, having commanded the largest pirate fleet of that period. Considered one of Roger's greatest rivals, Shiki desired to conquer the world. He is the main antagonist of One Piece Film: Strong World.",
      "status": "alive"
    },
    {
      "name": "Spacey",
      "birthday": "03-21",
      "affiliation": "civilian",
      "image": "Spacey.png",
      "image_offset": {
        "x": 54,
        "y": 5
      },
      "short_bio": "First Lieutenant Spacey is one of the automata created on Karakuri Island by Tsukimi.",
      "status": "alive"
    },
    {
      "name": "Sapi",
      "birthday": "03-22",
      "romanized_name": "Sapī",
      "affiliation": "None",
      "role": "Fishmonger",
      "haki": [],
      "origin": "East Blue",
      "image": "Sapi.png",
      "image_offset": {
        "x": 56,
        "y": 5
      },
      "short_bio": "Sapi is a fish salesman from Loguetown who sold Sanji the blue-finned elephant tuna.",
      "japanese_name": "サピー",
      "status": "alive"
    },
    {
      "name": "Charlotte Raisin",
      "birthday": "03-23",
      "affiliation": "civilian",
      "image": "Charlotte_Raisin.png",
      "short_bio": "Charlotte Raisin is the 33rd son and 60th child of the Charlotte Family and an officer of the Big Mom Pirates. He was a member of Big Mom's enraged army sent to fight Monkey D. Luffy, and later joined Charlotte Oven's army to ambush Luffy on Cacao Island.",
      "status": "alive"
    },
    {
      "name": "Miss Catherine",
      "birthday": "03-23",
      "romanized_name": "Kyasarin",
      "affiliation": "Baroque Works (former)",
      "role": "Nun",
      "haki": [],
      "origin": "Grand Line (Whisky Peak)",
      "image": "Miss-Catherina-(Miss-Katherina).png",
      "image_offset": {
        "x": 58,
        "y": 5
      },
      "japanese_name": "キャサリン",
      "status": "alive"
    },
    {
      "name": "Thatch",
      "birthday": "03-24",
      "romanized_name": "Satchi",
      "affiliation": "Whitebeard Pirates",
      "role": "4th Division Commander",
      "haki": [],
      "origin": "North Blue",
      "image": "Thatch.png",
      "image_offset": {
        "x": 21,
        "y": 5
      },
      "short_bio": "Thatch was the 4th division commander, as well as the head chef of the Whitebeard Pirates. He was murdered by Marshall D. Teach for his Devil Fruit.",
      "japanese_name": "サッチ",
      "status": "deceased"
    },
    {
      "name": "Ohm",
      "birthday": "03-25",
      "romanized_name": "Ōmu",
      "epithet": "\"Skybreeder\"",
      "affiliation": "God's Army",
      "role": "Priest",
      "haki": [
        "Observation Haki"
      ],
      "origin": "Sky Island (Birka)",
      "age": 29,
      "height": "189 cm",
      "image": "Ohm.png",
      "image_offset": {
        "x": 50,
        "y": 0
      },
      "short_bio": "Skybreeder Ohm is one of four priests of the former God Enel and a high-ranking member of God's Army. Together with his giant dog steed Holy, he subjected God's enemies to the Ordeal of Iron on Upper Yard. Due to his affiliation and actions, he is a major antagonist in the Skypiea Arc.",
      "japanese_name": "オーム",
      "status": "unknown"
    },
    {
      "name": "Thousand Sunny",
      "birthday": "03-25",
      "romanized_name": "Sauzando Sanī-gō",
      "affiliation": "Straw Hat Pirates",
      "role": "Ship",
      "haki": [],
      "origin": "Grand Line (Water 7)",
      "height": "5600 cm",
      "image": "Thousand-Sunny.png",
      "image_offset": {
        "x": 4,
        "y": 5
      },
      "short_bio": "The Thousand Sunny, or simply Sunny, is the current ship of the Straw Hat Pirates, succeeding the destroyed Going Merry. It has served as their main transportation through most of the Grand Line, from Water 7 well into the New World. The Sunny is a brigantine-type ship designed and built by Franky, with help from Iceburg and many other master shipwrights from Galley-La. Built from Adam Wood, it is a magnificent ship of the finest craftsmanship at least double the size of the Going Merry. Its features include practically all of the various requests the Straw Hats had before arriving in Water 7.",
      "japanese_name": "サウザンドサニー号",
      "status": "active"
    },
    {
      "name": "Mikio Itoo",
      "birthday": "03-26",
      "romanized_name": "Mikio Itū",
      "affiliation": "None",
      "role": "Gunslinger",
      "bounty": "1,000,000",
      "haki": [],
      "origin": "East Blue",
      "image": "Mikio_Itoo.png",
      "image_offset": {
        "x": 84,
        "y": 5
      },
      "short_bio": "Mikio Itoo is a background joke character created by Eiichiro Oda, and arguably the first Easter Egg featured in One Piece. He is a caricature of Mikio Ito, a Yokohama-born manga creator whom Oda knew as a fellow assistant to Nobuhiro Watsuki. Like Oda, Ito went on to publish his own series in Weekly Shonen Jump, such as Normandy Secret Club and Mysterious Murasame-kun. Within the world of One Piece, Itoo appears to be a wanted gunman with a bounty of one million yen. How many belly this would amount to is unknown.",
      "japanese_name": "ミキオ・イトゥー",
      "status": "alive"
    },
    {
      "name": "Tsuru",
      "birthday": "03-26",
      "romanized_name": "Tsuru",
      "epithet": "\"Great Staff Officer\"",
      "affiliation": "Marines",
      "role": "Vice Admiral",
      "devil_fruit": {
        "name": "Wash-Wash Fruit",
        "japanese_name": "Woshu Woshu no Mi",
        "type": "Paramecia",
        "power": "Wash and dry people like laundry"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "North Blue",
      "age": 76,
      "height": "204 cm",
      "image": "Tsuru.png",
      "image_offset": {
        "x": 21,
        "y": 5
      },
      "short_bio": "Tsuru, known as the \"Great Staff Officer\", is a renowned Marine Vice Admiral, as well as the grandmother of Kujaku.",
      "japanese_name": "つる",
      "status": "alive"
    },
    {
      "name": "Peachbeard",
      "birthday": "03-27",
      "affiliation": "civilian",
      "image": "Peachbeard.png",
      "image_offset": {
        "x": 86,
        "y": 5
      },
      "short_bio": "Peachbeard is the epithet of the captain of the Peachbeard Pirates, who are subordinates of the Emperor Blackbeard.",
      "status": "alive"
    },
    {
      "name": "Shioyaki",
      "birthday": "03-27",
      "romanized_name": "Shioyaki",
      "affiliation": "Arlong Pirates",
      "role": "Banquet Head",
      "haki": [],
      "origin": "Grand Line (Fish-Man Island)",
      "image": "Shioyaki.png",
      "image_offset": {
        "x": 46,
        "y": 5
      },
      "short_bio": "Shioyaki is a salmon fish-man who was a member of the Arlong Pirates and the head of banquets.",
      "japanese_name": "シオヤキ",
      "status": "alive"
    },
    {
      "name": "Sarie Nantokanette",
      "birthday": "03-28",
      "affiliation": "civilian",
      "image": "Sarie_Nantokanette.png",
      "image_offset": {
        "x": 22,
        "y": 7
      },
      "short_bio": "Sarie Nantokanette is the queen of the Goa Kingdom and Sterry's wife.",
      "status": "alive"
    },
    {
      "name": "Catarina Devon",
      "birthday": "03-29",
      "romanized_name": "Katarīna Debon",
      "epithet": "\"Crescent Moon Hunter\"",
      "affiliation": "Blackbeard Pirates",
      "role": "Titanic Captain",
      "devil_fruit": {
        "name": "Dog-Dog Fruit, Model: Nine Tailed Fox",
        "japanese_name": "Inu Inu no Mi, Model: Kyubi no Kitsune",
        "type": "Mythical Zoan",
        "power": "Transform into a nine-tailed fox"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "South Blue",
      "age": 36,
      "height": "361 cm",
      "image": "Catarina-Devon-(Catalina-Devon).png",
      "image_offset": {
        "x": 18,
        "y": 5
      },
      "short_bio": "Catarina Devon, known as the \"Crescent Moon Hunter\", is one of Ten Titanic Captains of the Blackbeard Pirates, serving as captain of the sixth ship of the fleet. She is regarded as the worst female pirate in history and was one of the most dangerous criminals ever to be imprisoned within Impel Down until she was freed and recruited by Marshall D. Teach. Due to her actions and role, she is a supporting antagonist in the Marineford Arc, a minor antagonist in the Egghead Arc and a major antagonist in the Final Saga.",
      "japanese_name": "カタリーナ・デボン",
      "status": "alive"
    },
    {
      "name": "Fukurokuju",
      "birthday": "03-29",
      "romanized_name": "Fukurokuju",
      "affiliation": "Orochi Oniwabanshu",
      "role": "Captain",
      "haki": [],
      "origin": "Grand Line (Wano Country)",
      "age": 61,
      "height": "221 cm",
      "image": "Fukurokuju.png",
      "short_bio": "Fukurokuju is a ninja and the previous captain of the Orochi Oniwabanshu before they joined the Beasts Pirates following Orochi's deposition. Though he pledged his team's support to Kaidou, Fukurokuju remained loyal to the surviving Orochi and helped him attempt to get revenge. However, Fukurokuju was ultimately bested in combat by his rival Raizo as his and Orochi's plot failed. Due to his actions and role, he is a supporting antagonist during the Wano Country Arc.",
      "japanese_name": "福ロクジュ",
      "status": "unknown"
    },
    {
      "name": "St. Shalulia",
      "birthday": "03-29",
      "romanized_name": "Sharuria Gū",
      "affiliation": "World Nobles",
      "role": "World Noble",
      "haki": [],
      "origin": "Mary Geoise",
      "age": 17,
      "height": "178 cm",
      "image": "Shalria.png",
      "image_offset": {
        "x": 26,
        "y": 5
      },
      "japanese_name": "シャルリア宮",
      "status": "alive"
    },
    {
      "name": "Bas",
      "birthday": "03-30",
      "romanized_name": "Basu",
      "affiliation": "Baskerville",
      "role": "Chief Justice",
      "haki": [],
      "origin": "Grand Line",
      "age": 48,
      "height": "512 cm",
      "image": "Baskerville.png",
      "image_offset": {
        "x": 54,
        "y": 5
      },
      "short_bio": "Three-Headed Baskerville is the Chief Justice of Enies Lobby, in service of the World Government. Ostensibly a three-headed man, \"he\" is actually three men—Bas, And, and Kerville—who are such close friends that they prefer acting as one body.",
      "japanese_name": "バス",
      "status": "unknown"
    },
    {
      "name": "Manboshi",
      "birthday": "03-30",
      "romanized_name": "Manboshi",
      "affiliation": "Neptune Family",
      "role": "Prince",
      "haki": [],
      "origin": "Grand Line (Ryugu Kingdom)",
      "age": 20,
      "height": "473 cm",
      "image": "Manboshi.png",
      "image_offset": {
        "x": 33,
        "y": 5
      },
      "short_bio": "Manboshi is an opah merman and the third son of the royal Neptune Family on Fish-Man Island.",
      "japanese_name": "マンボシ",
      "status": "alive"
    },
    {
      "name": "Baskerville",
      "birthday": "03-31",
      "romanized_name": "Basukabiru",
      "epithet": "\"Three-Headed Baskerville\"",
      "affiliation": "Enies Lobby",
      "role": "Chief Justice",
      "haki": [],
      "origin": "Grand Line",
      "height": "512 cm",
      "image": "Baskerville.png",
      "image_offset": {
        "x": 35,
        "y": 5
      },
      "short_bio": "Three-Headed Baskerville is the Chief Justice of Enies Lobby, in service of the World Government. Ostensibly a three-headed man, \"he\" is actually three men—Bas, And, and Kerville—who are such close friends that they prefer acting as one body.",
      "japanese_name": "バスカビル",
      "status": "unknown"
    },
    {
      "name": "Shaka",
      "birthday": "03-22",
      "affiliation": "civilian",
      "short_bio": "Shaka, also designated as , is one of the six satellites of Dr. Vegapunk, embodying his aspect of \"good\". He is a major ally of the Straw Hat Pirates during the Egghead Arc.",
      "status": "unknown"
    },
    {
      "name": "Lilith",
      "birthday": "03-22",
      "affiliation": "civilian",
      "short_bio": "Lilith, also designated as , is one of six satellites of Dr. Vegapunk, embodying his aspect of \"evil\". She is a major ally of the Straw Hat Pirates during the Egghead and Elbaph Arcs, and ultimately the only Vegapunk to escape with them after the Egghead Incident.",
      "status": "alive"
    },
    {
      "name": "Edison",
      "birthday": "03-22",
      "affiliation": "civilian",
      "short_bio": "Edison, also designated as , is one of the six satellites of Dr. Vegapunk, embodying his aspect of \"thinking\". He is a major companion and ally to the Straw Hat Pirates during the Egghead Arc.",
      "status": "alive"
    },
    {
      "name": "Pythagoras",
      "birthday": "03-22",
      "affiliation": "civilian",
      "short_bio": "Pythagoras, also designated as , is one of the six satellites of Dr. Vegapunk, embodying his aspect of \"wisdom\". He is an ally of the Straw Hat Pirates during the Egghead Arc.",
      "status": "alive"
    },
    {
      "name": "Atlas",
      "birthday": "03-22",
      "affiliation": "civilian",
      "short_bio": "Atlas, also designated as , is one of the six satellites of Dr. Vegapunk, embodying his emotions of frustrations and stress which was relieved through \"violence\". She is a major ally of the Straw Hat Pirates during the Egghead Arc.",
      "status": "alive"
    },
    {
      "name": "York",
      "birthday": "03-22",
      "affiliation": "civilian",
      "short_bio": "York, also designated as , is one of the six satellites of Dr. Vegapunk, embodying his aspect of \"greed\". She acted as an ally to the Straw Hat Pirates at first, but was later revealed to be a traitor responsible for instigating the Egghead Incident and many of the events prior during the Egghead Arc. Due to her actions, she is a major antagonist in the aforementioned arc. After Jaygarcia Saturn's demise, York has become the direct subordinate to Saturn's replacement, Figarland Garling.",
      "status": "alive"
    },
    {
      "name": "Hera",
      "birthday": "03-17",
      "haki": [],
      "short_bio": "Hera the Thundercloud is a thundercloud homie created by Big Mom at Wano Country as a replacement for Zeus. She is a special kind of homie, having received a soul fragment from Big Mom herself, and serves as one of her personal weapons, alongside Prometheus and Napoleon.",
      "status": "alive"
    },
    {
      "name": "Kurozumi Tama",
      "birthday": "03-03",
      "haki": [],
      "short_bio": "Kurozumi Tama, commonly known as O-Tama, is a girl from the region of Kuri in Wano Country. She is a kasa weaver working under Tenguyama Hitetsu, as well as a kunoichi in training under the apprenticeship of Shinobu. She is the last known survivor of the Kurozumi Family. Tama befriended Portgas D. Ace four years ago, having wished to join his crew at the time. She is a major ally of the Ninja-Pirate-Mink-Samurai Alliance during the Wano Country Arc.",
      "status": "alive"
    }
  ]
}