{
  "characters": [
    {
      "name": "Kashi",
      "birthday": "04-01",
      "romanized_name": "Kashi",
      "affiliation": "Giant Warrior Pirates",
      "role": "Gatekeeper (former)",
      "haki": [],
      "origin": "Grand Line (Elbaph)",
      "age": 156,
      "height": "1700 cm",
      "image": "Kashii.png",
      "short_bio": "Kashii, together with Oimo, was one of the two giants who guarded the front gate of Enies Lobby for over fifty years until he and Oimo realized they were tricked by the World Government. He is a member of the Giant Warrior Pirates. He and Oimo became major allies to the Straw Hat Pirates during the Enies Lobby Arc and Egghead Arc."
    },
    {
      "name": "Kerville",
      "birthday": "04-01",
      "romanized_name": "Karebiru",
      "affiliation": "Baskerville",
      "role": "Chief Justice",
      "haki": [],
      "origin": "Grand Line",
      "age": 42,
      "height": "512 cm",
      "image": "Bas,-Kerville,-and-Princess.png",
      "image_offset": {
        "x": 14,
        "y": 5
      },
      "short_bio": "Three-Headed Baskerville is the Chief Justice of Enies Lobby, in service of the World Government. Ostensibly a three-headed man, \"he\" is actually three men—Bas, And, and Kerville—who are such close friends that they prefer acting as one body."
    },
    {
      "name": "Usopp",
      "birthday": "04-01",
      "romanized_name": "Usoppu",
      "epithet": "\"God\"",
      "affiliation": "Straw Hat Pirates",
      "role": "Sniper",
      "bounty": "500,000,000",
      "haki": [
        "Observation Haki"
      ],
      "origin": "East Blue",
      "age": 19,
      "height": "176 cm",
      "image": "Usopp.png",
      "short_bio": "\"God\" Usopp is the sniper of the Straw Hat Pirates and one of the Senior Officers of the Straw Hat Grand Fleet. He is the fourth member of the crew and the third to join, doing so at the end of the Syrup Village Arc. Although he left the crew during the Water 7 Arc, he rejoined at the end of the Post-Enies Lobby Arc. Usopp is the son of Yasopp and the late Banchina. He was born and raised in Syrup Village, serving as \"captain\" of the Usopp Pirates and being Kaya's close friend. After working with the Straw Hats to defeat Kuro and the Black Cat Pirates, he was invited to join the crew. Despite his usual cowardice, Usopp dreams of becoming a brave warrior of the sea just like his father and lives every day in pursuit of living up to this dream. He first gained a bounty of 30,000,000 under his Sogeking Persona after the incident at Enies Lobby. After the Dressrosa Arc, Usopp gained a bounty of 200,000,000 under his real name. Following the Raid on Onigashima, his bounty was increased to 500,000,000."
    },
    {
      "name": "Jinbe",
      "birthday": "04-02",
      "romanized_name": "Jinbē",
      "epithet": "\"Knight of the Sea\"",
      "affiliation": "Straw Hat Pirates",
      "role": "Helmsman",
      "bounty": "1,100,000,000",
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Grand Line (Fish-Man Island)",
      "age": 46,
      "height": "301 cm",
      "image": "Jinbe-(Jimbei).png",
      "image_offset": {
        "x": 50,
        "y": 0
      },
      "short_bio": ":The subject of this article is sometimes called \"Jinbei\" or \"Jimbei\". \"Knight of the Sea\" Jinbe is the helmsman of the Straw Hat Pirates and one of the Senior Officers of the Straw Hat Grand Fleet. He is the tenth member of the crew and the ninth to join, doing so during the Wano Country Arc. Jinbe is a whale shark fish-man and a powerful master of Fish-Man Karate. His dream is to fulfill his former captain Fisher Tiger's dying wish of coexistence and equality between humans and fish-men. He was a member of the Sun Pirates, eventually becoming its second captain after the death of their original captain, Tiger. He eventually became one of the Seven Warlords of the Sea, though he resigned during the Summit War of Marineford. Vegapunk later cloned Jinbe as one of the Seraphim, S-Shark, to replace the Warlords. Prior to and amidst said war, Jinbe befriended Monkey D. Luffy, and two years later allied with him and his crew to prevent the New Fish-Man Pirates' coup d'état against the Ryugu Kingdom's Neptune Royal Family. Luffy thereafter invited him to join the Straw Hat Pirates, but Jinbe held it off until severing ties with Big Mom during the Whole Cake Island Arc. After staying behind in Totto Land to protect the Sun Pirates from Big Mom's wrath, Jinbe returned to the Straw Hats during the Wano Country Arc, officially announcing his status as a member of the crew. He first gained a bounty of 76,000,000 due to him being a member of the Sun Pirates. It was later increased to 250,000,000 after Jinbe became the new captain of the Sun Pirates before it was frozen after he joined the Seven Warlords. Upon resigning his position as a Warlord at the Summit War of Marineford, his bounty was reinstated at 438,000,000. Following the Raid on Onigashima, his bounty was increased to 1,100,000,000."
    },
    {
      "name": "Zeff",
      "birthday": "04-02",
      "romanized_name": "Zefu",
      "epithet": "\"Red-Leg\"",
      "affiliation": "Baratie",
      "role": "Head Chef",
      "bounty": "Unknown",
      "haki": [
        "Armament Haki"
      ],
      "origin": "East Blue",
      "age": 67,
      "height": "189 cm",
      "image": "Zeff.png",
      "image_offset": {
        "x": 84,
        "y": 43
      },
      "short_bio": "Zeff is the head chef and owner of the Baratie, as well as the adoptive father and mentor of Sanji. Once the feared \"Red-Leg\" Zeff, captain of the Cook Pirates, his notoriety ended in a storm that annihilated both his crew and ship. After saving a young Sanji from this storm and co-surviving months of starvation as castaways, he launched the Baratie, raising Sanji as his trainee. He is an ally of the Straw Hat Pirates during the Baratie Arc."
    },
    {
      "name": "Brook",
      "birthday": "04-03",
      "romanized_name": "Burukku",
      "epithet": "\"Soul King\"",
      "affiliation": "Straw Hat Pirates",
      "role": "Musician / Swordsman",
      "bounty": "383,000,000",
      "devil_fruit": {
        "name": "Revive-Revive Fruit",
        "japanese_name": "Yomi Yomi no Mi",
        "type": "Paramecia",
        "power": "Come back to life / Soul control"
      },
      "haki": [],
      "origin": "West Blue",
      "age": 90,
      "height": "277 cm",
      "image": "Brook.png",
      "image_offset": {
        "x": 0,
        "y": 5
      },
      "short_bio": ": The subject of this article is sometimes spelled \"Brooke\". \"Soul King\" Brook is the musician of the Straw Hat Pirates, one of their two swordsmen, and one of the Senior Officers of the Straw Hat Grand Fleet. He is the ninth member of the crew and the eighth to join, doing so at the end of the Thriller Bark Arc. Brook ate the Yomi Yomi no Mi, which allowed him to return to life after death once. Brook eventually learned to tap deeper into the powers of his Devil Fruit, giving him significant control over his own soul and the souls of others. Originally a member of the Rumbar Pirates, he died and was resurrected through the power of the Yomi Yomi no Mi. However, due to the amount of time it took for his soul to find his body, it was reduced to a skeleton, keeping only his afro intact. Brook drifted alone in the Florian Triangle for 50 years, eventually meeting Luffy and serving as the Straw Hats' ally during the Thriller Bark Arc before officially joining the crew. His dream is to reunite with his old friend, Laboon, at Reverse Mountain, where he resides with Crocus. He first gained a bounty of 33,000,000 during his time as a member of the Rumbar Pirates. It later increased to 83,000,000 after the Dressrosa Arc. Following the Raid on Onigashima, his bounty was increased to 383,000,000."
    },
    {
      "name": "Monda",
      "birthday": "04-03",
      "romanized_name": "Monda",
      "affiliation": "Foxy Pirates",
      "role": "Pet (Shark)",
      "haki": [],
      "origin": "Grand Line",
      "image": "Porche,-Capote,-and-Monda.png",
      "image_offset": {
        "x": 16,
        "y": 5
      },
      "short_bio": "Monda is a Star Shark and is one of the pet animals of the Foxy Pirates."
    },
    {
      "name": "Porchemi",
      "birthday": "04-03",
      "romanized_name": "Porushēmi",
      "affiliation": "Bluejam Pirates",
      "role": "Member",
      "bounty": "3,400,000",
      "haki": [],
      "origin": "East Blue",
      "age": 25,
      "height": "320 cm",
      "image": "Porchemy.png"
    },
    {
      "name": "Foxy",
      "birthday": "04-04",
      "romanized_name": "Fokushī",
      "epithet": "\"Silver Fox\"",
      "affiliation": "Foxy Pirates",
      "role": "Captain",
      "bounty": "24,000,000",
      "devil_fruit": {
        "name": "Slow-Slow Fruit",
        "japanese_name": "Noro Noro no Mi",
        "type": "Paramecia",
        "power": "Slow down time with beams"
      },
      "haki": [],
      "origin": "South Blue",
      "age": 38,
      "height": "180 cm",
      "image": "Foxy.png",
      "short_bio": "Foxy the Silver Fox is the captain of the Foxy Pirates, and the main antagonist of the Long Ring Long Land Arc. In the anime, he is a recurring enemy—and occasional ally—of the Straw Hat Pirates, with major roles in the anime-original Foxy's Return Arc, Spa Island Arc, one installment of the Boss Luffy Historical Special, and the Adventure of Nebulandia special."
    },
    {
      "name": "Shirahoshi",
      "birthday": "04-04",
      "romanized_name": "Shirahoshi",
      "epithet": "\"Mermaid Princess\" / Poseidon",
      "affiliation": "Ryugu Kingdom",
      "role": "Princess / Ancient Weapon",
      "haki": [
        "Observation Haki"
      ],
      "origin": "Grand Line (Ryugu Kingdom)",
      "age": 16,
      "height": "1187 cm",
      "image": "Shirahoshi.png",
      "image_offset": {
        "x": 34,
        "y": 5
      },
      "short_bio": "Princess Shirahoshi, famous in the world as the Mermaid Princess, is a giant smelt-whiting mermaid and the princess of the Ryugu Kingdom, as the youngest of King Neptune's children and the only daughter in the Neptune royal family. Having been locked up and raised inside an impregnable tower for most of her childhood thanks to the constant threat of Vander Decken IX, Shirahoshi wishes to know more about the outside world, following the will of her late mother, Queen Otohime. She is also the current incarnation of the Ancient Weapon Poseidon, to the knowledge of very few. Shirahoshi was first mentioned by Pappag well before her debut, the starfish claiming he knew her and even promising to introduce the Straw Hat Pirates to her if they arrived on Fish-Man Island (which would later turn out to be a lie). She is a major ally during the Fish-Man Island Arc."
    },
    {
      "name": "Shishilian",
      "birthday": "04-04",
      "romanized_name": "Shishirian",
      "epithet": "\"Full Power\"",
      "affiliation": "Mokomo Dukedom",
      "role": "Captain of Musketeers",
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Grand Line (Zou)",
      "age": 34,
      "height": "196 cm",
      "image": "Shishilian.png",
      "image_offset": {
        "x": 92,
        "y": 5
      },
      "short_bio": "\"Full Power\" Shishilian is a lion mink and the captain of the Inuarashi Musketeer Squad, as well as one of the Three Inuarashi Musketeers leading the squad."
    },
    {
      "name": "Minister of the Right",
      "birthday": "04-05",
      "romanized_name": "Udaijin",
      "affiliation": "Ryugu Kingdom",
      "role": "Minister",
      "haki": [],
      "origin": "Grand Line (Ryugu Kingdom)",
      "age": 55,
      "height": "313 cm",
      "image": "Minister-of-the-Right.png",
      "image_offset": {
        "x": 26,
        "y": 5
      },
      "short_bio": "The Minister of the Right is a seahorse merman in service to King Neptune. While it is not clear exactly what his job entails, he appears to have some administrative and military duties. He also appears to be a guard or commander as he and the other guards hurried to the princess when she needed help. His actual name is unknown."
    },
    {
      "name": "Yamakaji",
      "birthday": "04-05",
      "affiliation": "civilian",
      "bounty": "500,000,000",
      "image": "Yamakaji.png",
      "short_bio": "Vice Admiral Yamakaji is a Marine officer, and one of the five vice admirals who led the Buster Call on Enies Lobby."
    },
    {
      "name": "Edward Newgate",
      "birthday": "04-06",
      "romanized_name": "Edowādo Nyūgēto",
      "epithet": "\"Whitebeard\"",
      "affiliation": "Whitebeard Pirates",
      "role": "Captain / Emperor",
      "bounty": "5,046,000,000",
      "devil_fruit": {
        "name": "Tremor-Tremor Fruit",
        "japanese_name": "Gura Gura no Mi",
        "type": "Paramecia",
        "power": "Create earthquakes"
      },
      "haki": [
        "Conqueror's Haki",
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Grand Line (Sphinx)",
      "age": 72,
      "height": "666 cm",
      "image": "Edward-Newgate-(Whitebeard)-(sitting).png",
      "image_offset": {
        "x": 24,
        "y": 5
      },
      "short_bio": "Edward Newgate, more commonly known as \"Whitebeard\", was a legendary pirate and the captain of the Whitebeard Pirates. Widely known as the \"Strongest Man in the World\", he was considered the \"Man Closest to One Piece\" after Gol D. Roger's death. Growing up as an orphan on the island of Sphinx, Newgate went on to become a pirate, eventually joining the legendary Rocks Pirates. Sometime after the Rocks Pirates' disbanding, he went on to form his own crew, taking on the nickname \"Whitebeard\" and eventually becoming one of the Four Emperors that rule over the New World. He shared a friendly rivalry with Roger, to whom he lent one of his crewmates, Kouzuki Oden, so that Oden could help Roger discover the final island of the Grand Line, a goal that Whitebeard had no interest in. Following Roger's death, Whitebeard became recognized as the strongest man in the world, a fact complimented by having the highest active bounty whilst alive, and the second highest bounty of any pirate in history. Later in life, Whitebeard unknowingly took Roger's son, Portgas D. Ace, under his wing. After Ace was arrested by the Marines during a doomed attempt to hunt down Whitebeard's traitorous crew member Marshall D. Teach, Ace was to be executed by the Marines as a display to end the Great Pirate Era. Whitebeard, his crew and his allies all laid siege to Marineford to rescue Ace, resulting in the Summit War of Marineford which concluded with the deaths of both Ace and Whitebeard at the hands of Akainu and Teach, respectively. In his final moments, Whitebeard announced to the world that the One Piece did in fact exist, inspiring a new wave of pirates and effectively beginning the New Age. Whitebeard was an ally of Monkey D. Luffy and a central figure overall during the Marineford Arc."
    },
    {
      "name": "Jean Bart",
      "birthday": "04-06",
      "romanized_name": "Janbāru",
      "affiliation": "Heart Pirates",
      "role": "Pirate",
      "haki": [],
      "origin": "Unknown",
      "image": "Jean-Bart.png",
      "image_offset": {
        "x": 48,
        "y": 5
      },
      "short_bio": "Jean Bart is a pirate who was originally introduced as Saint Rosward's slave, being part of his Pirate Captain Collection. He currently serves under Trafalgar Law as a member of the Heart Pirates after being freed from the World Noble."
    },
    {
      "name": "Speed Jiru",
      "birthday": "04-06",
      "romanized_name": "Supīdo Jiru",
      "affiliation": "Whitebeard Pirates",
      "role": "14th Division Commander",
      "haki": [],
      "origin": "East Blue",
      "image": "Speed-Jiru-(Speed-Jil).png",
      "image_offset": {
        "x": 40,
        "y": 5
      },
      "short_bio": "Speed Jiru is the former 14th division commander of the Whitebeard Pirates."
    },
    {
      "name": "Gin",
      "birthday": "04-07",
      "affiliation": "civilian",
      "bounty": "12,000,000",
      "image": "Gin.png",
      "short_bio": ":The subject of this article is sometimes called \"Ghin\". Gin the \"Man-Demon\" is a pirate and the Combat Commander of the Krieg Pirates. He is initially introduced as a mere combatant of Krieg before his actual rank and abilities are made clear. Due to his actions, he can be considered the secondary antagonist of the Baratie Arc, although he eventually ends up aiding Monkey D. Luffy and Sanji."
    },
    {
      "name": "Shachi",
      "birthday": "04-07",
      "romanized_name": "Shachi",
      "affiliation": "Heart Pirates",
      "role": "Pirate",
      "haki": [],
      "origin": "North Blue",
      "age": 27,
      "image": "Shachi.png",
      "short_bio": "Shachi is a member of the Heart Pirates."
    },
    {
      "name": "Bourbon Jr.",
      "birthday": "04-08",
      "romanized_name": "Bābon Junia",
      "affiliation": "Whitebeard Pirates",
      "role": "Doctor",
      "haki": [],
      "origin": "Unknown",
      "image": "Bourbon-Jr..png",
      "short_bio": "The Super Spot-Billed Duck Troops are a family of seven Super Spot-Billed Ducks (and later one camel) who serve the kingdom of Arabasta. They are led by their captain Karoo, and are reputed to be the fastest troop in the kingdom of Arabasta. All of the ducks have the strange theme of wearing different types of hats and various other jewelry and clothing. Also strange was that the last member to join the squad, Matsuge, is a camel who helped the Straw Hats confront Baroque Works."
    },
    {
      "name": "Buffalo",
      "birthday": "04-08",
      "romanized_name": "Baffarō",
      "affiliation": "Donquixote Pirates",
      "role": "Officer",
      "devil_fruit": {
        "name": "Spin-Spin Fruit",
        "japanese_name": "Guru Guru no Mi",
        "type": "Paramecia",
        "power": "Spin body parts like propellers"
      },
      "haki": [],
      "origin": "North Blue",
      "age": 30,
      "height": "696 cm",
      "image": "Buffalo.png",
      "short_bio": "Buffalo is a combatant and an assassin of the Donquixote Pirates and an officer of the Pica Army. His real name is yet to be revealed, as \"Buffalo\" is a codename given to him upon joining the Donquixote Pirates. Due to his actions and role, he is a minor antagonist during the Punk Hazard Arc, and later a supporting antagonist during the Dressrosa Arc."
    },
    {
      "name": "Clover",
      "birthday": "04-08",
      "romanized_name": "Kurōbā",
      "epithet": "Dr. Clover",
      "affiliation": "Ohara",
      "role": "Archaeologist / Director",
      "haki": [],
      "origin": "West Blue (Ohara)",
      "age": 85,
      "height": "172 cm",
      "image": "Clover.png",
      "image_offset": {
        "x": 76,
        "y": 5
      },
      "short_bio": "Clou D. Clover, commonly known as Professor Clover, was the director of the Ohara Library, and a leading authority on archaeology. He was a professor and archaeologist who studied Poneglyphs with his fellow colleagues in the Tree of Knowledge. During his younger years, he was also an infamous explorer known for getting repeatedly caught by the Marines. Clover and his fellow archaeologists died 22 years ago for conducting forbidden research on the Void Century, which led the World Government to decimate the island of Ohara through a Buster Call."
    },
    {
      "name": "Megalo",
      "birthday": "04-08",
      "romanized_name": "Megaro",
      "affiliation": "Ryugu Kingdom",
      "role": "Pet (Shark)",
      "haki": [],
      "origin": "Grand Line (Ryugu Kingdom)",
      "image": "Megalo.png",
      "image_offset": {
        "x": 21,
        "y": 5
      },
      "short_bio": "Megalo is a shark that lives on Fish-Man Island. He is the beloved pet of princess Shirahoshi and former pet of the Neptune Army."
    },
    {
      "name": "Caesar Clown",
      "birthday": "04-09",
      "romanized_name": "Shīzā Kuraun",
      "epithet": "\"Master\"",
      "affiliation": "MADS (former) / Donquixote Pirates (former)",
      "role": "Scientist",
      "bounty": "300,000,000",
      "devil_fruit": {
        "name": "Gas-Gas Fruit",
        "japanese_name": "Gasu Gasu no Mi",
        "type": "Logia",
        "power": "Control and transform into gas"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Grand Line",
      "age": 55,
      "height": "309 cm",
      "image": "Caesar-Clown-(Gangster-Gastino).png",
      "short_bio": ":The subject of this article is sometimes called Caesar Crown. Caesar Clown, who was referred to as \"Master\" by his subordinates, is a scientist, the leading expert on chemical weapons of mass destruction, and one of the co-founders of NEO MADS. Caesar is a former colleague of Vegapunk, having worked with him both in MADS and later the World Government research facility on Punk Hazard, an island that Caesar went on to devastate with a toxic gas explosion, earning him a bounty of 300,000,000. Years later, Caesar returned to the island in secret to continue his illegal experiments until his defeat at the hands of the Straw Hat Pirates and Trafalgar Law. One of his projects was the production of SAD, a chemical that he supplied to the Warlord Donquixote Doflamingo to be used in the manufacturing of SMILEs, artificial Devil Fruits which were sold to the Emperor Kaidou to help create an army of Zoans. Although Caesar was briefly protected from the law by Doflamingo, this protection was lost when Doflamingo was defeated and arrested. After a period as a hostage of the Straw Hat-Heart Pirate Alliance, he fell into the custody of Big Mom on Whole Cake Island. There, Caesar was forced to continue his development of gigantification drugs until he was liberated by the Fire Tank Pirates and forced to take part in an assassination attempt against Big Mom. Following the plan's failure, Caesar finally parted ways with his former captors, escaping with the Vinsmoke Family to the Germa Kingdom, where he would establish NEO MADS with fellow ex-MADS member Vinsmoke Judge. Caesar is the main antagonist of the Punk Hazard Arc and a reluctant ally of the Straw Hat Pirates during the Dressrosa Arc, Zou Arc, and Whole Cake Island Arc. He is also a major character in Germa 66's Ahh... An Emotionless Excursion Cover Page Serial."
    },
    {
      "name": "Marguerite",
      "birthday": "04-09",
      "romanized_name": "Māgaretto",
      "affiliation": "Kuja Pirates",
      "role": "Pirate",
      "haki": [
        "Armament Haki"
      ],
      "origin": "Calm Belt (Amazon Lily)",
      "age": 18,
      "height": "178 cm",
      "image": "Marguerite-(Margaret).png",
      "image_offset": {
        "x": 30,
        "y": 5
      },
      "short_bio": "Marguerite is a member of the Kuja tribe living on the island of Amazon Lily. She, along with Aphelandra and Sweet Pea, saved Luffy after he ate mushrooms that completely covered his body. During the timeskip, she became a member of the Kuja Pirates."
    },
    {
      "name": "Mohmoo",
      "birthday": "04-09",
      "romanized_name": "Mōmu",
      "affiliation": "Caribou Pirates / Arlong Pirates (former)",
      "role": "Sea Cow / Pet",
      "haki": [],
      "origin": "Grand Line",
      "height": "3600 cm",
      "image": "Momoo.png",
      "image_offset": {
        "x": 70,
        "y": 5
      },
      "short_bio": "Momoo is a giant sea cow from the Grand Line, and the first Sea Beast seen in the series. He is classified as a Type A creature, \"Big Friendly\". Originally, he was utilized by the Arlong Pirates as a method of intimidation towards the residents of the Conomi Islands. After Arlong's defeat, he was captured and briefly employed as a draft animal by the Caribou Pirates."
    },
    {
      "name": "Piiman",
      "birthday": "04-09",
      "romanized_name": "Pīman",
      "affiliation": "Usopp Pirates (former)",
      "role": "Member (former)",
      "haki": [],
      "origin": "East Blue (Syrup Village)",
      "age": 11,
      "height": "120 cm",
      "image": "Piiman-(Pepper).png",
      "short_bio": "Piiman is a former member of the Usopp Pirates, along with Ninjin and Tamanegi, from before Usopp joined the Straw Hat Pirates. He is an ally of the Straw Hat Pirates during the Syrup Village Arc."
    },
    {
      "name": "Yorki",
      "birthday": "04-09",
      "affiliation": "civilian",
      "bounty": "Unknown",
      "image": "Yorki.png",
      "image_offset": {
        "x": 29,
        "y": 5
      },
      "short_bio": "\"Calico\" Yorki was the captain of the Rumbar Pirates who brought Laboon to Reverse Mountain fifty years ago from West Blue."
    },
    {
      "name": "Forest Boss",
      "birthday": "04-10",
      "affiliation": "civilian",
      "image": "Forest_Boss.png",
      "short_bio": "The Forest Boss is a mandrill that was first introduced in Gedatsu's cover story."
    },
    {
      "name": "Nora Gitsune",
      "birthday": "04-10",
      "romanized_name": "Nora Gitsune",
      "affiliation": "Fake Straw Hat Crew",
      "role": "Pet",
      "haki": [],
      "origin": "East Blue",
      "age": 13,
      "height": "103 cm",
      "image": "Nora-Gitsune-(Fake-Chopper,-Stray-Fox).png",
      "image_offset": {
        "x": 30,
        "y": 5
      },
      "short_bio": "Nora Gitsune is a fox who filled the role of the \"pet\" for the Fake Straw Hat Crew, who did not know that the real Chopper is the crew's doctor and is given human-traits by the Hito Hito no Mi."
    },
    {
      "name": "Tamanegi",
      "birthday": "04-10",
      "romanized_name": "Tamanegi",
      "affiliation": "Usopp Pirates (former)",
      "role": "Member (former)",
      "haki": [],
      "origin": "East Blue (Syrup Village)",
      "age": 11,
      "height": "124 cm",
      "image": "Tamanegi-(Onion).png",
      "short_bio": "Tamanegi is a former member of the Usopp Pirates, along with Ninjin and Piiman, before Usopp joined the Straw Hat Pirates. He is an ally of the Straw Hat Pirates during the Syrup Village Arc."
    },
    {
      "name": "Pekoms",
      "birthday": "04-11",
      "romanized_name": "Pekomuzu",
      "affiliation": "Big Mom Pirates",
      "role": "Combatant",
      "bounty": "330,000,000",
      "devil_fruit": {
        "name": "Turtle-Turtle Fruit",
        "japanese_name": "Kame Kame no Mi",
        "type": "Zoan",
        "power": "Transform into a turtle"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Grand Line (Zou)",
      "age": 27,
      "height": "232 cm",
      "image": "Pekoms.png",
      "image_offset": {
        "x": 27,
        "y": 5
      },
      "short_bio": "Pekoms is a combatant of the Big Mom Pirates and a lion mink. He is partnered with Tamago, and both are responsible for collecting the monthly payment of sweets from Fish-Man Island in exchange for Big Mom's protection. Pekoms originally sailed the seas under Pedro as a member of the Nox Pirates before he and some of the crew joined the Big Mom Pirates. During the Whole Cake Island Arc, he betrayed the crew in an attempt to help Monkey D. Luffy escape Totto Land and honor Pedro's self-sacrifice."
    },
    {
      "name": "Bakkin",
      "birthday": "04-12",
      "romanized_name": "Misu Bakkin",
      "epithet": "Miss Buckingham Stussy",
      "affiliation": "Rocks Pirates (former)",
      "role": "Pirate",
      "haki": [],
      "origin": "Grand Line",
      "age": 76,
      "height": "68 cm",
      "image": "Buckingham-Stussy.png",
      "image_offset": {
        "x": 46,
        "y": 5
      },
      "short_bio": "Miss Buckingham Stussy, also known by her alias Miss Buckin, is a former member of both the Rocks Pirates and the illegal science institute MADS. She is the self-proclaimed lover of the deceased Emperor Edward Newgate and the mother of Edward Weevil, a former Warlord of the Sea. During her time with MADS, she worked alongside other notable scientists like Dr. Vegapunk, Caesar Clown, Queen, and Vinsmoke Judge, though it has been stated that she was a freeloader who simply took and benefited from their research, hardly contributing anything of her own. Nonetheless, the group did manage to successfully produce a clone of her, Stussy, who is under the employment of Vegapunk."
    },
    {
      "name": "Cowboy",
      "birthday": "04-12",
      "romanized_name": "Kaubōi",
      "affiliation": "None",
      "role": "Background Character",
      "haki": [],
      "origin": "Unknown",
      "image": "Cowboy.png",
      "image_offset": {
        "x": 21,
        "y": 5
      },
      "short_bio": "The Super Spot-Billed Duck Troops are a family of seven Super Spot-Billed Ducks (and later one camel) who serve the kingdom of Arabasta. They are led by their captain Karoo, and are reputed to be the fastest troop in the kingdom of Arabasta. All of the ducks have the strange theme of wearing different types of hats and various other jewelry and clothing. Also strange was that the last member to join the squad, Matsuge, is a camel who helped the Straw Hats confront Baroque Works."
    },
    {
      "name": "Morgan",
      "birthday": "04-13",
      "romanized_name": "Mōgan",
      "epithet": "\"Axe-Hand\"",
      "affiliation": "Marines (former)",
      "role": "Captain (former)",
      "haki": [],
      "origin": "East Blue",
      "age": 44,
      "height": "285 cm",
      "image": "Morgan.png",
      "short_bio": "\"Axe-Hand\" Morgan is a former Marine captain, the father of Helmeppo and the first significant Marine officer to appear in the storyline. After his defeat by Monkey D. Luffy and Roronoa Zoro, he was stripped of his rank for his many abuses of power. He is the third antagonist of the Romance Dawn Arc, serving as the main antagonist of the Shells Town subsection. He is also the main antagonist of the Diary of Koby-Meppo cover-page serial."
    },
    {
      "name": "Hody Jones",
      "birthday": "04-14",
      "romanized_name": "Hōdi Jōnzu",
      "affiliation": "New Fish-Man Pirates",
      "role": "Captain",
      "haki": [],
      "origin": "Grand Line (Fish-Man Island)",
      "age": 30,
      "height": "331 cm",
      "image": "Hody-Jones-(Hordy-Jones).png",
      "short_bio": "Hody Jones is a great white shark fish-man, the captain of the New Fish-Man Pirates before their downfall, and a former soldier of the Neptune Army. He is an admirer and militant believer of Arlong's ideals, and the main antagonist of the Fish-Man Island Arc."
    },
    {
      "name": "Fossa",
      "birthday": "04-15",
      "romanized_name": "Fossa",
      "affiliation": "Whitebeard Pirates",
      "role": "15th Division Commander",
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "North Blue",
      "image": "Fossa.png",
      "image_offset": {
        "x": 67,
        "y": 5
      },
      "short_bio": "Fossa is the former 15th division commander of the Whitebeard Pirates."
    },
    {
      "name": "Stronger",
      "birthday": "04-16",
      "romanized_name": "Sutorongā",
      "affiliation": "Blackbeard Pirates",
      "role": "Horse",
      "devil_fruit": {
        "name": "Horse-Horse Fruit, Model: Pegasus",
        "japanese_name": "Uma Uma no Mi, Model: Pegasus",
        "type": "Mythical Zoan",
        "power": "Transform into a pegasus"
      },
      "haki": [],
      "origin": "Grand Line",
      "image": "Doc-Q-and-Stronger.png",
      "image_offset": {
        "x": 72,
        "y": 5
      },
      "short_bio": "Stronger is the horse that Doc Q rides on. Because Doc Q is seemingly always sick, he rides on Stronger all the time, since the doctor tends to collapse if left unsupported for some time; however, Stronger is just as sick as he is. He is classified as a Type A creature, \"Big Friendly\"."
    },
    {
      "name": "Charlotte Anana",
      "birthday": "04-17",
      "affiliation": "civilian",
      "image": "Charlotte_Anana.png",
      "image_offset": {
        "x": 24,
        "y": 5
      },
      "short_bio": "Charlotte Anana is the 39th daughter of the Charlotte Family, as well as the 85th and youngest overall child, and is a member of the Big Mom Pirates."
    },
    {
      "name": "Hyouzou",
      "birthday": "04-18",
      "romanized_name": "Hyōzō",
      "affiliation": "New Fish-Man Pirates",
      "role": "Mercenary / Assassin",
      "haki": [],
      "origin": "Grand Line (Fish-Man Island)",
      "age": 39,
      "height": "327 cm",
      "image": "Hyouzou.png",
      "image_offset": {
        "x": 36,
        "y": 5
      },
      "short_bio": "Hyouzou is a poisonous blue-ringed octopus merman. Prior to his imprisonment, he was a mercenary and working as the New Fish-Man Pirates' assassin, and later became one of the officers. Hyouzou was also known as the best swordsman on Fish-Man Island. Due to his actions and role, he is considered to be a major antagonist in the Fish-Man Island Arc."
    },
    {
      "name": "Sham",
      "birthday": "04-19",
      "romanized_name": "Shamu",
      "epithet": "Nyaban Brothers",
      "affiliation": "Black Cat Pirates",
      "role": "Ship Guard",
      "bounty": "7,000,000",
      "haki": [],
      "origin": "East Blue",
      "age": 23,
      "height": "201 cm",
      "image": "Sham-(Siam).png",
      "short_bio": "Sham is an officer of the Black Cat Pirates. Along with his partner Buchi, he is also the protector of the crew's ship, the Bezan Black, and together they are known as the . Due to his actions, he is a supporting antagonist during the Syrup Village Arc."
    },
    {
      "name": "Blueno",
      "birthday": "04-20",
      "romanized_name": "Burūno",
      "affiliation": "CP0 / CP9 (former)",
      "role": "Agent",
      "devil_fruit": {
        "name": "Door-Door Fruit",
        "japanese_name": "Doa Doa no Mi",
        "type": "Paramecia",
        "power": "Create doors on any surface"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "North Blue",
      "age": 32,
      "height": "258 cm",
      "image": "Blueno.png",
      "image_offset": {
        "x": 14,
        "y": 5
      },
      "short_bio": "Blueno is an agent of CP0. Before the time skip, he was previously an agent of CP9; operating undercover as the bartender of a bar in Water 7. He was one of the major antagonists during the Water 7 Arc and a minor antagonist during the Enies Lobby Arc."
    },
    {
      "name": "Island Eater",
      "birthday": "04-21",
      "romanized_name": "Shimakui",
      "affiliation": "None",
      "role": "Sea King",
      "haki": [],
      "origin": "Grand Line",
      "height": "71500 cm",
      "image": "Island-Eater.png",
      "image_offset": {
        "x": 14,
        "y": 5
      },
      "short_bio": "Island Eater was a giant goldfish that inhabited the sea near Little Garden. He was said to be the main reason ships leaving the island never reached their destination. He was classified as a Type C creature, \"Big Savage\"."
    },
    {
      "name": "Ucy",
      "birthday": "04-21",
      "affiliation": "civilian",
      "image": "Ucy.png",
      "image_offset": {
        "x": 51,
        "y": 5
      },
      "short_bio": "\"Brutal Bull\" Ucy is a Animal Species/Dressrosa Saga#Fighting Bull that regularly competed as a gladiator in [[Dressrosa's Corrida Colosseum, where he was befriended (and named) by Monkey D. Luffy. He serves as an ally to Luffy during the Dressrosa Arc."
    },
    {
      "name": "Kuro",
      "birthday": "04-22",
      "romanized_name": "Kuro",
      "epithet": "\"Kuro of a Hundred Plans\"",
      "affiliation": "Black Cat Pirates",
      "role": "Captain",
      "bounty": "16,000,000",
      "haki": [],
      "origin": "East Blue",
      "age": 35,
      "height": "207 cm",
      "image": "Kuro-(Klahadore).png",
      "image_offset": {
        "x": 50,
        "y": 0
      },
      "short_bio": "Kuro of a Hundred Plans is the captain of the Black Cat Pirates. After faking his own capture and execution, he assumed the alias Klahadore and infiltrated Syrup Village's wealthiest family, acting as servant and caretaker to their young daughter Kaya with the intent of seizing her fortune. His scheme would ultimately be thwarted by Kaya's friend Usopp and the Straw Hat Pirates who came to his aid. He is the main antagonist of the Syrup Village Arc."
    },
    {
      "name": "Charlotte Mont-d'Or",
      "birthday": "04-23",
      "romanized_name": "Shārotto Mondōru",
      "epithet": "\"The Scribe\"",
      "affiliation": "Charlotte Family",
      "role": "Minister of Cheese",
      "bounty": "120,000,000",
      "devil_fruit": {
        "name": "Book-Book Fruit",
        "japanese_name": "Buku Buku no Mi",
        "type": "Paramecia",
        "power": "Control books and trap people in them"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Grand Line (Totto Land)",
      "age": 38,
      "height": "260 cm",
      "image": "Charlotte-Mont-d_Or-(Charlotte-Mont-d_Or).png",
      "image_offset": {
        "x": 36,
        "y": 5
      },
      "short_bio": "Charlotte Mont-d'Or (WT100) '''\"Scribe\" Charlotte Mont-d'Or''' is the 19th son and 30th child of the Charlotte Family and an officer of the Big Mom Pirates. He also serves as Totto Land's Minister of Cheese, governing over Cheese Island. Due to his actions and role, he is a supporting antagonist during the Whole Cake Island Arc."
    },
    {
      "name": "Kalifa",
      "birthday": "04-23",
      "romanized_name": "Karifa",
      "affiliation": "CP0 / CP9 (former)",
      "role": "Agent",
      "devil_fruit": {
        "name": "Bubble-Bubble Fruit",
        "japanese_name": "Awa Awa no Mi",
        "type": "Paramecia",
        "power": "Create and control soap bubbles"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Grand Line",
      "age": 27,
      "height": "185 cm",
      "image": "Kalifa-(CP9).png",
      "short_bio": ":The subject of this article is sometimes called Califa. Kalifa is an agent of CP0. Before the timeskip, she was an agent of CP9, operating undercover as Iceburg's secretary at the Galley-La Company. She is also Laskey's daughter and the older sister of Alpha. She was one of the major antagonists during the Water 7 and Enies Lobby Arcs."
    },
    {
      "name": "Chome",
      "birthday": "04-24",
      "affiliation": "civilian",
      "image": "Chome.png",
      "image_offset": {
        "x": 15,
        "y": 5
      },
      "short_bio": "Chome is a kunoichi and a member of the Beasts Pirates. She previously was a member of the Orochi Oniwabanshu which served the shogun of Wano Country, Kurozumi Orochi. Due to her actions and role, she is a minor antagonist in the Wano Country Arc."
    },
    {
      "name": "Stussy",
      "birthday": "04-24",
      "romanized_name": "Sutyūshī",
      "epithet": "\"Queen of the Pleasure District\"",
      "affiliation": "CP0 (former)",
      "role": "Agent (Clone)",
      "devil_fruit": {
        "name": "Unknown (Succubus)",
        "japanese_name": "Unknown",
        "type": "Unknown (likely Mythical Zoan)",
        "power": "Bat wings, life absorption"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "MADS",
      "height": "179 cm",
      "image": "Stussy.png",
      "image_offset": {
        "x": 50,
        "y": 0
      },
      "short_bio": "Stussy is MADS' first-ever successful clone, having been modeled after Miss Buckingham Stussy. She is a masked agent of CP0, although she is actually a spy employed by Dr. Vegapunk and spent years working deeply undercover in the World Government until she was forced to discard her cover, during which she was allegedly killed by the organization. Additionally, while acting as an agent, she operated as an emperor of the Underworld under the epithet \"Queen of the Pleasure District\". Initially, she was a minor antagonist of the Egghead Arc, but later became a major ally to Vegapunk and the Straw Hat Pirates when her background and true allegiance were revealed."
    },
    {
      "name": "Penguin",
      "birthday": "04-25",
      "romanized_name": "Pengin",
      "affiliation": "Heart Pirates",
      "role": "Pirate",
      "haki": [],
      "origin": "North Blue",
      "age": 28,
      "image": "Penguin.png",
      "image_offset": {
        "x": 57,
        "y": 5
      },
      "short_bio": "Penguin is a member of the Heart Pirates."
    },
    {
      "name": "Chaka",
      "birthday": "04-26",
      "romanized_name": "Chaka",
      "epithet": "\"The Jackal\"",
      "affiliation": "Arabasta Kingdom",
      "role": "Head Guard",
      "devil_fruit": {
        "name": "Dog-Dog Fruit, Model: Jackal",
        "japanese_name": "Inu Inu no Mi, Model: Jackal",
        "type": "Zoan",
        "power": "Transform into a jackal"
      },
      "haki": [],
      "origin": "Grand Line (Arabasta)",
      "age": 41,
      "height": "213 cm",
      "image": "Chaka.png",
      "image_offset": {
        "x": 69,
        "y": 0
      },
      "short_bio": "Chaka the Jackal is one of two head guards in the Arabasta kingdom who serves under Igaram, alongside Pell. Chaka was the acting captain of the royal guard in Igaram's absence."
    },
    {
      "name": "Streusen",
      "birthday": "04-27",
      "romanized_name": "Shutoroizen",
      "epithet": "\"Gourmet Knight\"",
      "affiliation": "Big Mom Pirates",
      "role": "Executive Chef",
      "devil_fruit": {
        "name": "Cook-Cook Fruit",
        "japanese_name": "Kuku Kuku no Mi",
        "type": "Paramecia",
        "power": "Turn objects into food"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Grand Line",
      "age": 92,
      "height": "140 cm",
      "image": "Streusen.png",
      "image_offset": {
        "x": 25,
        "y": 5
      },
      "short_bio": "\"Gourmet Knight\" Streusen is the executive chef of the Big Mom Pirates, and is also the co-founder of the crew alongside Big Mom herself. Prior to meeting Linlin, he was the chef of a pirate crew that has since fallen apart. Since meeting Linlin as a child he has sailed the seas for decades by her side, even accompanying her during her time as a member of the Rocks Pirates."
    },
    {
      "name": "Funkfreed",
      "birthday": "04-28",
      "romanized_name": "Fankufurīdo",
      "affiliation": "Spandam",
      "role": "Sword / Pet",
      "devil_fruit": {
        "name": "Elephant-Elephant Fruit",
        "japanese_name": "Zou Zou no Mi",
        "type": "Zoan",
        "power": "Sword that transforms into an elephant"
      },
      "haki": [],
      "origin": "Grand Line",
      "image": "Funkfreed.png",
      "image_offset": {
        "x": 24,
        "y": 5
      },
      "short_bio": "Funkfreed is Spandam's sword, which has been animated by the Zou Zou no Mi, becoming an Elephant Sword. As such, he also serves as a pet and unofficial bodyguard for Spandam, compensating his master's physical slightness."
    },
    {
      "name": "Miss Goldenweek",
      "birthday": "04-29",
      "romanized_name": "Misu Gōrudenwīku",
      "epithet": "\"Flag Bearer of Freedom\"",
      "affiliation": "New Spiders Cafe",
      "role": "Officer Agent (former) / Painter",
      "bounty": "29,000,000",
      "haki": [],
      "origin": "North Blue",
      "age": 18,
      "height": "145 cm",
      "image": "Marianne-(Miss-Goldenweek).png",
      "short_bio": "Marianne, also known as the \"Flag-Bearer of Freedom\" and more commonly by her alias Miss Goldenweek, is a former officer agent of Baroque Works and the partner of Mr. 3. She is currently working as a painter at the new Spider's Cafe alongside many of her former colleagues. She is the secondary antagonist of the Little Garden Arc and the protagonist in Miss Goldenweek's \"Operation: Meet Baroque Works\"."
    },
    {
      "name": "Viola",
      "birthday": "04-30",
      "romanized_name": "Viora",
      "epithet": "Violet",
      "affiliation": "Riku Family / Dressrosa",
      "role": "Princess",
      "devil_fruit": {
        "name": "Glare-Glare Fruit",
        "japanese_name": "Giro Giro no Mi",
        "type": "Paramecia",
        "power": "See through everything and read minds"
      },
      "haki": [],
      "origin": "Grand Line (Dressrosa)",
      "age": 29,
      "height": "178 cm",
      "image": "Viola-(Violet).png",
      "short_bio": "Viola is the second daughter of the Riku Family and the current crown princess of Dressrosa after her niece Rebecca abdicated her position. She is the younger sister of the late Scarlett. When the Donquixote Pirates took over Dressrosa, Viola joined them and adopted the name Violet, working as an assassin and officer of the Trebol Army until betraying the crew."
    },
    {
      "name": "Ashura Doji",
      "birthday": "04-10",
      "romanized_name": "Ashura Dōji",
      "epithet": "Shutenmaru",
      "affiliation": "Akazaya Nine",
      "role": "Samurai / Bandit",
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Grand Line (Wano Country)",
      "age": 56,
      "height": "544 cm",
      "image": "Ashura-Doji.png",
      "image_offset": {
        "x": 61,
        "y": 5
      },
      "short_bio": "Ashura Doji was a bandit, samurai from Wano Country and a retainer of the Kouzuki Family, serving as one of Kouzuki Oden's Nine Red Scabbards. After Oden's death, he returned to being a criminal under the name Shutenmaru, assuming leadership of the Mt. Atama Thieves. He initially severed his ties with the Kouzuki Family in the present but rejoined after witnessing Yasuie's death. Ashura eventually met his demise during the Raid on Onigashima, sacrificing himself to protect his fellow Scabbards from one of Kanjuro's schemes. He is an ally of the Straw Hat Pirates during the Wano Country Arc."
    },
    {
      "name": "Marianne",
      "birthday": "04-29",
      "affiliation": "unknown",
      "bounty": "29000000",
      "age": "18",
      "image": "Marianne-(Miss-Goldenweek)-(edited).png",
      "short_bio": "Marianne, also known as the \"Flag-Bearer of Freedom\" and more commonly by her alias Miss Goldenweek, is a former officer agent of Baroque Works and the partner of Mr. 3. She is currently working as a painter at the new Spider's Cafe alongside many of her former colleagues. She is the secondary antagonist of the Little Garden Arc and the protagonist in Miss Goldenweek's \"Operation: Meet Baroque Works\"."
    },
    {
      "name": "Shimotsuki Yasuie",
      "birthday": "04-02",
      "affiliation": "civilian",
      "age": "71",
      "image": "Shimotsuki-Yasuie-(edited).png",
      "short_bio": "Shimotsuki Yasuie, also known as \"Yasu the Hedgehog\", Tonoyasu, or just Yasu, was a member of the Shimotsuki Family and a taikomochi who lived in Ebisu Town near the capital of Wano Country. He was the adoptive father of Toko. Back when the Kouzuki Family ruled over Wano Country, Yasuie served as the daimyo of Hakumai. Twenty years after Kurozumi Orochi's takeover of Wano, Yasuie sacrificed himself in an effort to mislead the shogun's forces and enable Kouzuki Momonosuke's revolution to continue."
    },
    {
      "name": "Buckingham Stussy",
      "birthday": "04-12",
      "haki": [],
      "image": "Buckingham-Stussy-(edited).png",
      "short_bio": "Miss Buckingham Stussy, also known by her alias Miss Buckin, is a former member of both the Rocks Pirates and the illegal science institute MADS. She is the self-proclaimed lover of the deceased Emperor Edward Newgate and the mother of Edward Weevil, a former Warlord of the Sea. During her time with MADS, she worked alongside other notable scientists like Dr. Vegapunk, Caesar Clown, Queen, and Vinsmoke Judge, though it has been stated that she was a freeloader who simply took and benefited from their research, hardly contributing anything of her own. Nonetheless, the group did manage to successfully produce a clone of her, Stussy, who is under the employment of Vegapunk."
    },
    {
      "name": "Clou D. Clover",
      "birthday": "04-08",
      "haki": [],
      "short_bio": "Clou D. Clover, commonly known as Professor Clover, was the director of the Ohara Library, and a leading authority on archaeology. He was a professor and archaeologist who studied Poneglyphs with his fellow colleagues in the Tree of Knowledge. During his younger years, he was also an infamous explorer known for getting repeatedly caught by the Marines. Clover and his fellow archaeologists died 22 years ago for conducting forbidden research on the Void Century, which led the World Government to decimate the island of Ohara through a Buster Call."
    },
    {
      "name": "Kashii",
      "birthday": "04-01",
      "haki": [],
      "image": "Kashii-(edited).png",
      "short_bio": "Kashii, together with Oimo, was one of the two giants who guarded the front gate of Enies Lobby for over fifty years until he and Oimo realized they were tricked by the World Government. He is a member of the Giant Warrior Pirates. He and Oimo became major allies to the Straw Hat Pirates during the Enies Lobby Arc and Egghead Arc."
    },
    {
      "name": "Momoo",
      "birthday": "04-09",
      "haki": [],
      "image": "Momoo-(edited).png",
      "short_bio": "Momoo is a giant sea cow from the Grand Line, and the first Sea Beast seen in the series. He is classified as a Type A creature, \"Big Friendly\". Originally, he was utilized by the Arlong Pirates as a method of intimidation towards the residents of the Conomi Islands. After Arlong's defeat, he was captured and briefly employed as a draft animal by the Caribou Pirates."
    },
    {
      "name": "Porchemy",
      "birthday": "04-03",
      "bounty": "3,400,000",
      "haki": [],
      "image": "Porchemy-(edited).png",
      "short_bio": "Porchemy was a member of the Bluejam Pirates until he was killed by his captain Bluejam for losing to Ace and Sabo."
    }
  ]
}