{
  "characters": [
    {
      "name": "Delacuaji",
      "birthday": "09-01",
      "affiliation": "civilian",
      "short_bio": "Delacuaji is an infamous New World pirate captain who allied with Whitebeard."
    },
    {
      "name": "Jewelry Bonney",
      "birthday": "09-01",
      "romanized_name": "Juerī Bonī",
      "epithet": "\"Big Eater\" (大喰らい, Ō-Gurai?, English versions: \"Glutton\")",
      "affiliation": "civilian",
      "role": "Pirate Captain; Princess (former)",
      "bounty": "320,000,000140,000,000",
      "haki": [],
      "origin": "Red Line (Mary Geoise)",
      "age": 24,
      "height": "174 cm (5'9\") (debut, after timeskip)",
      "image": "Jewelry-Bonney.png",
      "image_offset": {
        "x": 46,
        "y": 5
      },
      "short_bio": "Jewelry Bonney, also known as the \"Big Eater\", is a pirate from the South Blue and the captain of the Bonney Pirates. She is one of twelve pirates who are referred to as the \"Worst Generation\" and the only female member of the group. Bonney is the daughter of Ginny and the adopted daughter of Bartholomew Kuma, the former King of the Sorbet Kingdom (making her Sorbet's former princess). Thanks to experiments conducted by Jaygarcia Saturn of the Five Elders, Bonney acquired the powers of the Toshi Toshi no Mi, which allows her to manipulate the age of herself and others at will. She also inherited the Sapphire Scales disease from her mother, forcing her to live inside Kuma's church through her early childhood. After Kuma sacrificed his body and free will to the World Government in exchange for Dr. Vegapunk curing Bonney, she ventured forth from her home to become a pirate in search of her father, using her ability to appear as a young woman in her twenties, despite still being a little girl, having been ten years old during her debut and now being twelve after the timeskip.. Bonney eventually succeeded in reuniting with her father after he saved her life during the Egghead Incident. Upon reaching the Sabaody Archipelago, Bonney had a bounty of 140,000,000. Two years later, it was raised to 320,000,000. Bonney is a companion and major ally of the Straw Hat Pirates during the Egghead Arc and Elbaph Arc."
    },
    {
      "name": "Kiwi",
      "birthday": "09-01",
      "romanized_name": "Mozu & Kiui",
      "epithet": "Square Sisters",
      "affiliation": "Franky Family",
      "role": "Bartenders; Dismantlers; Bounty Hunters",
      "haki": [],
      "origin": "Grand Line (Water 7, Slums)",
      "age": 22,
      "height": "187 cm (6'1\")",
      "image": "Kiwi.png",
      "image_offset": {
        "x": 83,
        "y": 5
      },
      "short_bio": "Mozu and Kiwi, also known as the Square Sisters due to their square-like hairstyle, are two members of the Franky Family very loyal to Franky, who went with him everywhere and tended to mimic every pose he did. They are both allies of the Straw Hat Pirates during the end of the Water 7 and beginning of the Enies Lobby Arc (starting off as minor antagonists in the former). Currently, they jointly manage Blueno's old bar in Water 7."
    },
    {
      "name": "Boa Hancock",
      "birthday": "09-02",
      "romanized_name": "Boa Hankokku",
      "epithet": "\"Snake Princess\" (蛇姫, Hebihime?);\"Pirate Empress\" (海賊女帝, Kaizoku Jotei?)",
      "affiliation": "Kuja Pirates",
      "role": "Captain of the Kuja Pirates; Empress of Amazon Lily; Warlord of the Sea (former); Slave (former)",
      "bounty": "1,659,000,00080,000,000",
      "devil_fruit": {
        "name": "Love-Love Fruit",
        "japanese_name": "メロメロの実",
        "type": "Paramecia",
        "power": "Petrification of those attracted to her"
      },
      "haki": [],
      "origin": "Calm Belt (Amazon Lily)",
      "age": 31,
      "height": "191 cm (6'3\") (debut, after timeskip)",
      "image": "Boa-Hancock.png",
      "image_offset": {
        "x": 17,
        "y": 3
      },
      "short_bio": "\"Pirate Empress\" Boa Hancock is the current captain of the Kuja Pirates and was the only female Warlord of the Sea before the organization's disbandment. She is the current empress of Amazon Lily, also known as the \"Snake Princess\". As the current empress she succeeds former empresses Tritoma, Shakuyaku, and Gloriosa. She rules over the Kuja tribe with her two younger sisters, Boa Sandersonia and Boa Marigold. Kidnapped by the World Nobles as a child along with her sisters, she was enslaved and tortured for years; during this time she was force-fed the Mero Mero no Mi, which gives her the ability to turn both living and non-living things into stone. She and her sisters escaped from Mary Geoise during a mass breakout instigated by Fisher Tiger. She was returned to her home with the help of Gloriosa, Silvers Rayleigh and Shakuyaku, where she would eventually become the island's empress, as well as one of the Seven Warlords. Though initially antagonistic towards Monkey D. Luffy, his selfless actions and animosity towards the Celestial Dragons caused her to befriend, and eventually fall in love, with him. She went on to serve as one of Luffy's most stalwart allies, helping him infiltrate Impel Down, siding with him in the Summit War of Marineford, providing him a location to train on for two years, and then helping him reunite with his crew and supporting him from afar. While employed within the Seven Warlords, she turned against the World Government on a number of occasions to support Luffy, though she was able to retain her title by feigning innocence. However, the Warlords were officially abolished after the most recent Levely, causing her to lose her status and became one of the world's most wanted criminals. Vegapunk was able to clone Hancock as one of the Seraphim, S-Snake, to replace the Warlords. She first gained a bounty of 80,000,000 due to her being a captain of the Kuja Pirates before it was frozen after she joined the Seven Warlords. However, after the abolition of the Seven Warlords, Hancock's bounty was reinstated and raised to 1,659,000,000. She initially serves as the main antagonist of the Amazon Lily Arc, before becoming a major ally for the rest of the Summit War Saga, as well as the Return to Sabaody Arc. She also acts as an ally of Luffy during the <s>3D</s>2Y special, the Cidre Guild filler Arc, and the movie One Piece: Stampede."
    },
    {
      "name": "Heppoko",
      "birthday": "09-02",
      "romanized_name": "Heppoko",
      "affiliation": "Alvida Pirates",
      "role": "Pirate",
      "haki": [],
      "origin": "East Blue",
      "image": "Heppoko.png",
      "image_offset": {
        "x": 23,
        "y": 5
      },
      "short_bio": "Heppoko is a member of the Alvida Pirates and the triplet brother of Peppoko and Poppoko."
    },
    {
      "name": "Peppoko",
      "birthday": "09-02",
      "romanized_name": "Peppoko",
      "affiliation": "Alvida Pirates",
      "role": "Pirate",
      "haki": [],
      "origin": "East Blue",
      "image": "Peppoko.png",
      "short_bio": "Peppoko is a member of the Alvida Pirates and the triplet brother of Heppoko and Poppoko."
    },
    {
      "name": "Poppoko",
      "birthday": "09-02",
      "romanized_name": "Poppoko",
      "affiliation": "Alvida Pirates",
      "role": "Pirate",
      "haki": [],
      "origin": "East Blue",
      "image": "Poppoko.png",
      "image_offset": {
        "x": 31,
        "y": 5
      },
      "short_bio": "Poppoko is a member of the Alvida Pirates and the triplet brother of Heppoko and Peppoko."
    },
    {
      "name": "Boa Sandersonia",
      "birthday": "09-03",
      "romanized_name": "Boa Sandāsonia",
      "affiliation": "civilian",
      "role": "Ruler of Amazon Lily; Slave (former)",
      "bounty": "40,000,000",
      "haki": [],
      "origin": "Calm Belt (Amazon Lily)",
      "age": 30,
      "height": "453 cm (14'10\")",
      "image": "Boa-Sandersonia.png",
      "image_offset": {
        "x": 37,
        "y": 5
      },
      "short_bio": "Boa Sandersonia is the younger sister of Boa Hancock, the ruler of Amazon Lily. She is also one of the second-in commands of the Kuja Pirates and the older sister of Boa Marigold. She and her sisters are referred to by the Kuja as the Gorgon Sisters."
    },
    {
      "name": "Brannew",
      "birthday": "09-03",
      "romanized_name": "Buran'nyū",
      "affiliation": "civilian",
      "role": "Commodore; Lieutenant Commander (former)",
      "bounty": "At least ★(At least 100,000,000)",
      "haki": [],
      "origin": "Grand Line",
      "age": 56,
      "height": "190 cm (6'3\")",
      "image": "Brannew-(Brandnew).png",
      "image_offset": {
        "x": 24,
        "y": 5
      },
      "short_bio": "Commodore Brannew is a Marine officer stationed at Marine Headquarters who assigns bounties to criminals. He was first introduced as a lieutenant commander during the Loguetown Arc, but was promoted to commodore during the timeskip."
    },
    {
      "name": "McGuy",
      "birthday": "09-03",
      "affiliation": "civilian",
      "short_bio": "\"Thunder Lord\" McGuy is an infamous New World pirate who allied with Whitebeard."
    },
    {
      "name": "Kumashi",
      "birthday": "09-04",
      "romanized_name": "Kumashī",
      "affiliation": "Thriller Bark Pirates (Perona)",
      "role": "Perona's servant; Wild Zombie Commander-in-Chief",
      "haki": [],
      "image": "Kumashi-(Kumacy).png",
      "image_offset": {
        "x": 24,
        "y": 5
      },
      "short_bio": ":The subject of this article is sometimes referred to as \"Kumacy\". Kumashi was a stuffed bear zombie of the Thriller Bark Pirates who acted as Perona's servant and the commander-in-chief of the Wild Zombies prior to being purified by Usopp."
    },
    {
      "name": "Wanze",
      "birthday": "09-04",
      "romanized_name": "Wanze",
      "epithet": "\"Mad Wanze\" (マッドなワンゼ, Maddona Wanze?)",
      "affiliation": "civilian",
      "role": "Cipher Pol Agent; Chef",
      "haki": [],
      "origin": "West Blue",
      "age": 28,
      "height": "173 cm (5'8\")",
      "image": "Wanze.png",
      "image_offset": {
        "x": 19,
        "y": 5
      },
      "short_bio": "Wanze is an agent of CP7 and a cook, specializing in making ramen noodles. He was one of the antagonists during the Sea Train voyage in the Water 7 Arc."
    },
    {
      "name": "Boa Marigold",
      "birthday": "09-05",
      "romanized_name": "Boa Marīgōrudo",
      "affiliation": "civilian",
      "role": "Ruler of Amazon Lily; Slave (Former)",
      "bounty": "40,000,000",
      "haki": [],
      "origin": "Calm Belt (Amazon Lily)",
      "age": 28,
      "height": "432 cm (14'2\")",
      "image": "Boa-Marigold.png",
      "short_bio": "Boa Marigold is the younger sister of Boa Hancock, the ruler of Amazon Lily. She is also one of the second-in commands of the Kuja Pirates and the younger sister of Boa Sandersonia. She and her sisters are referred to by the Kuja as the Gorgon Sisters."
    },
    {
      "name": "Crocodile",
      "birthday": "09-05",
      "romanized_name": "Kurokodairu",
      "epithet": "\"Sir Crocodile\"",
      "affiliation": "Cross Guild",
      "role": "Chief Officer",
      "bounty": "1,965,000,000",
      "devil_fruit": {
        "name": "Sand-Sand Fruit",
        "japanese_name": "Suna Suna no Mi",
        "type": "Logia",
        "power": "Control and transform into sand"
      },
      "haki": [
        "Armament Haki",
        "Observation Haki"
      ],
      "origin": "Grand Line",
      "age": 46,
      "height": "253 cm",
      "image": "Crocodile.png",
      "image_offset": {
        "x": 68,
        "y": 0
      },
      "short_bio": "\"Desert King\" Sir Crocodile is a former Warlord of the Sea and the former president of the mysterious crime syndicate Baroque Works, formerly operating under the codename \"Mr. 0\". During his time as Warlord, Crocodile maintained a public facade of an ally to both the people of Arabasta Kingdom and the Marines, all while running Baroque Works in secret with the express purpose of overthrowing Arabasta via Operation Utopia. When his plot was foiled by the Straw Hat Pirates, he was stripped of his title and imprisoned in the deepest level of the legendary prison Impel Down. His former partner and Vice-President of Baroque Works, Nico Robin, would go on to become a member of the Straw Hat Pirates. Crocodile was freed by Luffy from Impel Down in exchange for aiding in the rescue of his brother and went to Marineford to participate in the Summit War. While initially aiming to kill Whitebeard, his contempt for the Marines led him to ally with Luffy and the Whitebeard Pirates. After the war, he and his subordinate Daz Bonez escaped from Marineford and decided to head out to the New World. After the disbandment of the Seven Warlords of the Sea, Crocodile now works as a co-leader of the Cross Guild alongside Dracule Mihawk and under the figurehead leadership of Buggy, who was mistakenly made one of the Four Emperors. Sometime prior to the disbanding of the Warlords, Vegapunk cloned Crocodile as one of the Seraphim to replace the Warlords. He is one of the longest running and most noteworthy primary adversaries of the series, being the first enemy to hand Luffy a complete and utter defeat. He is the main antagonist of the Arabasta Arc and the Arabasta Saga overall, a tentative ally in both the Impel Down and Marineford Arcs, and a supporting antagonist in the Final Saga."
    },
    {
      "name": "Gekko Moriah",
      "birthday": "09-06",
      "romanized_name": "Gekkō Moria",
      "epithet": "Gecko Moriah",
      "affiliation": "Thriller Bark Pirates; Warlord (former)",
      "role": "Captain",
      "bounty": "320,000,000",
      "devil_fruit": {
        "name": "Kage Kage no Mi",
        "japanese_name": "カゲカゲの実",
        "type": "Paramecia",
        "power": "Manipulate shadows"
      },
      "haki": [],
      "origin": "West Blue",
      "age": 50,
      "height": "692 cm",
      "image": "Gecko-Moria-(Moriah).png",
      "image_offset": {
        "x": 46,
        "y": 5
      }
    },
    {
      "name": "Macro",
      "birthday": "09-06",
      "romanized_name": "Makuro",
      "affiliation": "Macro Pirates; Sun Pirates (former)",
      "role": "Pirate; Captain; Slave trader",
      "haki": [],
      "origin": "Grand Line (Ryugu Kingdom; Fish-Man Island)",
      "image": "macro.png",
      "short_bio": "Macro is a pelican eel fish-man and the captain of the Macro Pirates. He first appeared in Hatchan's Sea-Floor Stroll cover story. He was also a member of the Sun Pirates."
    },
    {
      "name": "Squard",
      "birthday": "09-06",
      "romanized_name": "Sukuādo",
      "epithet": "\"Maelstrom Spider\" (大渦蜘蛛, Ō Uzu Gumo?, English versions: Whirl Spider)",
      "affiliation": "civilian",
      "role": "Pirate Captain",
      "bounty": "210,000,000",
      "haki": [],
      "origin": "Grand Line",
      "age": 52,
      "height": "228 cm (7'5\")",
      "image": "Squard.png",
      "image_offset": {
        "x": 68,
        "y": 5
      },
      "short_bio": "\"Maelstrom Spider\" Squard is an infamous New World pirate and the captain of the Maelstrom Spider Pirates. Squard and his crew were allies of the Whitebeard Pirates and participated in the Summit War of Marineford."
    },
    {
      "name": "Fullbody",
      "birthday": "09-07",
      "romanized_name": "Furubodi",
      "epithet": "Double Ironfist Fullbody",
      "affiliation": "Marines",
      "role": "Marine Lieutenant Commander",
      "bounty": "1,000,000",
      "haki": [],
      "origin": "North Blue",
      "age": 28,
      "height": "184 cm (6'0\")",
      "image": "Fullbody-(after).png",
      "short_bio": "\"Double Ironfist\" Fullbody is a Marine lieutenant commander serving under Rear Admiral Hina. He was a Marine Headquarters lieutenant at the start of the series, but was demoted to seaman recruit as a condition when he helped the former Black Cat pirate, Jango, get acquitted for his past crimes (in the anime, it was after getting into a fight with Sanji on the Baratie). During the timeskip, however, he rose back through the ranks to become a commissioned officer once again, being one rank higher than he was to begin with in the series. Due to his actions, he is a minor antagonist during the Baratie and Arabasta Arcs. He also is a supporting character during Jango's Dance Paradise Cover Page Serial."
    },
    {
      "name": "Motzel",
      "birthday": "09-07",
      "romanized_name": "Mottseru Ojisan",
      "affiliation": "civilian",
      "haki": [],
      "origin": "East Blue",
      "image": "Motzel.png",
      "image_offset": {
        "x": 34,
        "y": 5
      },
      "short_bio": "Mr. Motzel is a gourmand and one of the known customers of the Baratie."
    },
    {
      "name": "Cabaji",
      "birthday": "09-08",
      "romanized_name": "Kabaji",
      "epithet": "\"Cabaji the Acrobat\" (曲芸のカバジ, Kyokugi no Kabaji?)",
      "affiliation": "civilian",
      "role": "Pirate; Chief of Staff; Acrobat; Swordsman",
      "haki": [],
      "origin": "East Blue",
      "age": 34,
      "height": "208 cm (6'10\")",
      "image": "Cabaji.png",
      "image_offset": {
        "x": 18,
        "y": 5
      },
      "short_bio": "Cabaji the Acrobat is the Buggy Pirates chief of staff, as well as an acrobat swordsman. He was a member of Buggy's Delivery, and is currently a member of Cross Guild. Due to his actions, he can be considered the tertiary antagonist of the Orange Town Arc, and a minor antagonist in the Loguetown Arc."
    },
    {
      "name": "Kureha",
      "birthday": "09-08",
      "romanized_name": "Kureha",
      "epithet": "\"Witch\" (魔女, Majo?);\"Master of Doctors\" (マスターオブ医者, Masutā Obu Isha?)",
      "affiliation": "civilian",
      "role": "Head-Doctor of the Sakura Kingdom; Leader of the Isshi-100",
      "haki": [],
      "origin": "Grand Line (Drum Kingdom)",
      "age": 141,
      "height": "188 cm (6'2\")",
      "image": "Kureha.png",
      "short_bio": "Dr. Kureha is an elderly doctor who works on Drum Island. She is referred to as \"witch\" by some people. She is Tony Tony Chopper's mentor and adoptive mother, taking him under her care after the death of Hiriluk. She is also head of the Isshi-100. She is an ally of the Straw Hat Pirates during the Drum Island Arc."
    },
    {
      "name": "Rakuyo",
      "birthday": "09-08",
      "romanized_name": "Rakuyō",
      "epithet": "Morning Star Rakuyo",
      "affiliation": "Whitebeard Pirates",
      "role": "7th Division Commander",
      "haki": [
        "Busoshoku",
        "Kenbunshoku"
      ],
      "origin": "South Blue",
      "image": "Rakuyo.png",
      "image_offset": {
        "x": 37,
        "y": 5
      },
      "short_bio": "Rakuyo is the former 7th division commander of the Whitebeard Pirates."
    },
    {
      "name": "Basil Hawkins",
      "birthday": "09-09",
      "romanized_name": "Bajiru Hōkinsu",
      "epithet": "\"Magician\" (魔術師, Majutsushi?)",
      "affiliation": "civilian",
      "role": "Pirate; Captain; Shinuchi",
      "bounty": "320,000,000249,000,000",
      "haki": [],
      "origin": "North Blue",
      "age": 31,
      "height": "210 cm (6'10½\") (debut, after timeskip)",
      "image": "Basil-Hawkins.png",
      "image_offset": {
        "x": 32,
        "y": 5
      },
      "short_bio": "Basil Hawkins is an infamous pirate from North Blue known as the \"Magician\" and the captain of the Hawkins Pirates. He is one of twelve pirates who are referred to as the \"Worst Generation\". Hawkins attempted to create a Pirate Alliance with Eustass Kid and Scratchmen Apoo but he was betrayed by the latter who had secretly become a subordinate of the Emperor Kaidou. Defeated by Kaidou, Hawkins joined the Beasts Pirates and became one of the crew's Shinuchi. His previous known bounty amounted to 249,000,000, but after the timeskip, it was raised to 320,000,000. Due to his actions and role, he is a supporting antagonist in the Wano Country Arc."
    },
    {
      "name": "Manjaro",
      "birthday": "09-09",
      "romanized_name": "Manjarō",
      "affiliation": "Fake Straw Hat Crew",
      "role": "Pirate",
      "haki": [],
      "origin": "East Blue",
      "age": 25,
      "height": "202 cm (6'7\")",
      "image": "Manjaro-(Fake-Zoro).png",
      "short_bio": "Manjaro is a member of the Fake Straw Hat Crew and masqueraded as Roronoa Zoro. When the crew switched to posing as the Kid Pirates, Manjaro impersonated Heat."
    },
    {
      "name": "O-Kiku",
      "birthday": "09-09",
      "romanized_name": "Kikunojō",
      "epithet": "\"Kikunojo of the Lingering Snow\" (残雪の菊之丞, Zansetsu no Kikunojō?, English: \"Kikunojo of the Fallen Snow\")",
      "affiliation": "civilian",
      "role": "Daimyo of Ringo; Samurai; Retainer of the Kouzuki Family; Tea House Poster Girl",
      "haki": [],
      "origin": "Grand Line (Wano Country)",
      "age": 42,
      "height": "287 cm (9'5\")",
      "image": "Kikunojo-(Okiku)-(scary-mask).png",
      "short_bio": "Kikunojo of the Lingering Snow, more commonly referred to as Kiku, is a samurai from Wano Country and a retainer for the Kouzuki Family, serving as one of Kouzuki Oden's Nine Red Scabbards. She is also the younger sister of Izou and the daughter of the dancing school head of the Hanayanagi School in Ringo. After traveling forward in time, she worked as a tea house poster girl in Okobore Town while gathering information for the planned rebellion. She participated in the Raid on Onigashima where she battled Kaidou alongside the other Scabbards, losing her left arm to one of Kaidou's attacks. Following Kouzuki Momonosuke's ascent to shogun, she serves as the daimyo of Ringo. She is an ally of the Straw Hat Pirates during the Wano Country Arc."
    },
    {
      "name": "Shyarly",
      "birthday": "09-09",
      "romanized_name": "Shārī",
      "epithet": "Madam Shyarly (マダム・シャーリー, Madamu Shārī?)",
      "affiliation": "civilian",
      "role": "Proprietor of the Mermaid Cafe; Fortune teller (former)",
      "haki": [],
      "origin": "Grand Line (Ryugu Kingdom; Fish-Man Island)",
      "age": 29,
      "height": "520 cm (17'1\")",
      "image": "Shyarly-(Sharley).png",
      "image_offset": {
        "x": 42,
        "y": 5
      },
      "short_bio": "Madam Shyarly is a shortfin mako shark mermaid living on Fish-Man Island. She is the proprietor of the Mermaid Cafe and Arlong's younger half-sister. She used to be a fortune teller until she decided to discard her crystal ball."
    },
    {
      "name": "T-Bone",
      "birthday": "09-10",
      "romanized_name": "Tī Bōn",
      "epithet": "Ship Cutter",
      "affiliation": "Marines",
      "role": "Marine Vice Admiral",
      "bounty": "At least 500,000,000",
      "haki": [
        "Busoshoku",
        "Kenbunshoku"
      ],
      "origin": "Grand Line",
      "age": 53,
      "height": "200 cm (6'7\")",
      "image": "T-Bone.png",
      "short_bio": "\"Ship Cutter\" T Bone was a Marine Vice Admiral. As a Marine Captain two years ago, he was a minor antagonist during the Water 7 Arc and confronted the Straw Hat Pirates on the Sea Train route to Enies Lobby. Prior to joining the Marines, he was a royal knight. Sometime around the Egghead Arc, T Bone was killed in the Pepe Kingdom for the bounty he received from the Cross Guild."
    },
    {
      "name": "Very Good",
      "birthday": "09-10",
      "affiliation": "civilian",
      "bounty": "100,000,000",
      "short_bio": "Very Good is a Marine Captain and one of the Marines who helped to attack the Straw Hat Pirates during the Buster Call at Enies Lobby."
    },
    {
      "name": "Mont Blanc Cricket",
      "birthday": "09-11",
      "romanized_name": "Monburan Kuriketto",
      "epithet": "Last Boss",
      "affiliation": "Saruyama Alliance",
      "role": "Pirate; Captain",
      "bounty": "25,000,000",
      "haki": [],
      "origin": "North Blue",
      "age": 43,
      "height": "242 cm (7'11\")",
      "image": "Mont-Blanc-Cricket-(Montblanc-Cricket).png",
      "short_bio": "Mont Blanc Cricket is an inhabitant of Jaya, living in a small home behind the façade of a castle. He is the distant descendant of Mont Blanc Noland and the of the Saruyama Alliance. He is an ally of the Straw Hat Pirates during the Jaya Arc, and led the Saruyama Alliance in helping them reach Skypiea."
    },
    {
      "name": "Morley",
      "birthday": "09-11",
      "romanized_name": "Mōrī",
      "epithet": "\"Morley of Fur\" (毛皮のモーリー, Kegawa no Mōrī?)",
      "affiliation": "civilian",
      "role": "West Army Commander of the Revolutionary Army; Pirate (former); Prisoner of Impel Down (former)",
      "bounty": "293,000,000",
      "haki": [],
      "origin": "West Blue",
      "age": 160,
      "height": "1253 cm (41'1\")",
      "image": "Morley.png",
      "short_bio": "Morley of Fur is a giant and a newkama, as well as the commander of the West Army in the Revolutionary Army. Morley's existence was first alluded by Emporio Ivankov during the Impel Down Arc, as the one responsible for the creation of Newkama Land."
    },
    {
      "name": "Curiel",
      "birthday": "09-12",
      "romanized_name": "Kurieru",
      "epithet": "Heavy Artillery Curiel",
      "affiliation": "Whitebeard Pirates",
      "role": "10th Division Commander",
      "haki": [
        "Busoshoku",
        "Kenbunshoku"
      ],
      "origin": "Grand Line",
      "image": "Curiel.png",
      "short_bio": "Curiel is the former 10th division commander of the Whitebeard Pirates."
    },
    {
      "name": "Hoe",
      "birthday": "09-13",
      "romanized_name": "Hoe",
      "affiliation": "King Neptune",
      "role": "Neptune's transportation",
      "haki": [],
      "origin": "Grand Line (Fish-Man Island)",
      "height": "40m",
      "image": "Hoe.png",
      "image_offset": {
        "x": 69,
        "y": 5
      },
      "short_bio": "Hoe is the pet whale of King Neptune who uses him as a means of transportation. The only word he can say is his own name."
    },
    {
      "name": "Lord of the Coast",
      "birthday": "09-14",
      "romanized_name": "Kinkai no Nushi",
      "epithet": "Local Sea Monster",
      "affiliation": "Foosha Village's local Sea King",
      "role": "Foosha Village's local Sea King",
      "haki": [],
      "origin": "East Blue",
      "height": "N/A",
      "image": "Lord-of-the-Coast-(Local-Sea-Monster).png",
      "image_offset": {
        "x": 42,
        "y": 5
      },
      "short_bio": "The Lord of the Coast is a Sea King that inhabits the waters of Dawn Island, typically near Foosha Village. He is classified as a Type C creature, \"Big Savage\"."
    },
    {
      "name": "O-Tsuru",
      "birthday": "09-15",
      "romanized_name": "Tsurujo",
      "affiliation": "Loyal to Kouzuki Family",
      "role": "Tea House Owner",
      "haki": [],
      "origin": "Grand Line (Wano Country)",
      "age": 55,
      "height": "191 cm (6'3\")",
      "image": "Tsurujo-(Otsuru)-(past).png",
      "image_offset": {
        "x": 39,
        "y": 1
      },
      "short_bio": "Tsurujo, commonly known as O-Tsuru, is a tea house owner who lives in the Kuri region in Wano Country. She is also the wife of Kin'emon."
    },
    {
      "name": "Spoil",
      "birthday": "09-15",
      "affiliation": "civilian",
      "short_bio": "Spoil is the chairman of the Thriller Bark Victim's Association."
    },
    {
      "name": "Laboon",
      "birthday": "09-16",
      "romanized_name": "Rabūn",
      "affiliation": "civilian",
      "haki": [],
      "origin": "West Blue",
      "age": 53,
      "height": "400 m (1312'4\")",
      "image": "Laboon.png",
      "image_offset": {
        "x": 51,
        "y": 5
      },
      "short_bio": "Laboon is an Island Whale the Straw Hat Pirates encounter immediately after entering the Grand Line. He is native to the West Blue and is classified as a Type A creature, \"Big Friendly\", and at the top of both the size and friendliness scale. 50 years ago, after being separated from his pod as a baby, Laboon became a close companion of the Rumbar Pirates, but he had to be left behind under Crocus's care due to the dangers of the Grand Line. The pirates promised they would come back for Laboon someday, so the whale still awaits their return to this day. As a former and the only surviving member of the Rumbar Pirates, it is Brook's ultimate goal to reunite with Laboon. Because many events of the Reverse Mountain Arc happen within his innards, Laboon could be considered one of the main settings for that story arc alongside the Twin Cape."
    },
    {
      "name": "Rindo",
      "birthday": "09-16",
      "romanized_name": "Rindō",
      "affiliation": "civilian",
      "role": "Pirate; Sniper",
      "haki": [],
      "origin": "Calm Belt (Amazon Lily)",
      "image": "Rindo.png",
      "image_offset": {
        "x": 36,
        "y": 5
      },
      "short_bio": "Rindo is a member of the Kuja Pirates."
    },
    {
      "name": "Kuina",
      "birthday": "09-17",
      "romanized_name": "Shimotsuki Kuina",
      "affiliation": "Shimotsuki Family",
      "role": "Trainee Swordsman",
      "haki": [],
      "origin": "East Blue (Shimotsuki Village)",
      "age": 11,
      "height": "150 cm (4'11\")",
      "image": "Shimotsuki-Kuina.png",
      "image_offset": {
        "x": 40,
        "y": 5
      },
      "short_bio": "Shimotsuki Kuina was a childhood friend, relative and rival of Roronoa Zoro. She was the daughter of Shimotsuki Koushirou and the granddaughter of Shimotsuki Kouzaburou making her a descendant of Wano Country's famed Shimotsuki Family. Her death at the age of eleven drove much of Zoro's ambitions as a swordsman, including his development of the Three Sword Style."
    },
    {
      "name": "Devil Dias",
      "birthday": "09-18",
      "romanized_name": "Debiru Diasu",
      "affiliation": "civilian",
      "role": "Pirate; Captain (former); Slave",
      "bounty": "60,000,000",
      "haki": [],
      "image": "Devil-Dias.png",
      "short_bio": "Devil Dias is a pirate and the former captain of the Acumate Pirates, but was captured and sold as a slave to the family of World Noble Saint Rosward."
    },
    {
      "name": "Karasu",
      "birthday": "09-18",
      "romanized_name": "Karasu",
      "affiliation": "civilian",
      "role": "North Army Commander of the Revolutionary Army",
      "bounty": "400,000,000",
      "haki": [],
      "origin": "North Blue",
      "age": 47,
      "height": "265 cm (8'8\")",
      "image": "Karasu.png",
      "image_offset": {
        "x": 49,
        "y": 0
      },
      "short_bio": "Karasu is a member of the Revolutionary Army, serving as one of its executive officers and the commander of the North Army."
    },
    {
      "name": "Don Krieg",
      "birthday": "09-19",
      "romanized_name": "Kurīku",
      "epithet": "Don Krieg",
      "affiliation": "Krieg Pirates",
      "role": "Pirate Admiral",
      "bounty": "17,000,000",
      "haki": [],
      "origin": "East Blue",
      "age": 44,
      "height": "243 cm (8'0\")",
      "image": "Krieg-(Don-Krieg).png",
      "image_offset": {
        "x": 51,
        "y": 5
      },
      "short_bio": "Don Krieg is the admiral of the Krieg Pirates, widely reputed as Foul-Play Krieg for his underhanded methods. At his height, he was also known as the Pirate Fleet Admiral, commanding a fleet of fifty ships (totaling some 5,000 pirates) throughout the East Blue. After effectively dominating East Blue piracy, Krieg attempted to conquer the Grand Line, only to have his fleet decimated by Dracule Mihawk of the Seven Warlords of the Sea. Fleeing back to the East Blue, he tried to capture the Baratie as his new ship, but met further defeat from Monkey D. Luffy. Taken away from the Baratie by his right-hand man Gin, Krieg continued his pirating career, eventually arriving at the pirate island Hachinosu. Due to his actions and role, he is the main antagonist of the Baratie Arc."
    },
    {
      "name": "Shura",
      "birthday": "09-20",
      "romanized_name": "Shura",
      "epithet": "Sky Rider",
      "affiliation": "God's Army",
      "role": "Priest of Enel",
      "haki": [
        "Observation Haki"
      ],
      "origin": "Sky Islands (Birka)",
      "age": 33,
      "height": "191 cm (6'3\")",
      "image": "Shura-(solo).png",
      "image_offset": {
        "x": 81,
        "y": 5
      },
      "short_bio": "\"Sky Rider\" Shura was one of the four priests of the Upper Yard, who punished criminals with the Ordeal of String during Enel's reign. He rode a giant flying bird named Fuza. He is a major antagonist during the Skypiea Arc."
    },
    {
      "name": "Chocolat",
      "birthday": "09-21",
      "romanized_name": "Shokora",
      "affiliation": "civilian",
      "role": "Pirate",
      "haki": [],
      "origin": "East Blue",
      "age": 26,
      "height": "181 cm (5'11\")",
      "image": "Chocolat-(Fake-Nami).png",
      "short_bio": "Chocolat is a member of the Fake Straw Hat Crew who masqueraded as Nami."
    },
    {
      "name": "Kuzan",
      "birthday": "09-21",
      "romanized_name": "Kuzan",
      "affiliation": "civilian",
      "role": "Titanic Captain (Captain of the Tenth Ship); Admiral (former); Vice Admiral (former)",
      "haki": [],
      "origin": "South Blue (Vespa Kingdom territory)",
      "age": 49,
      "height": "298 cm (9'9¼\")",
      "image": "Kuzan-(Aokiji).png",
      "image_offset": {
        "x": 64,
        "y": 3
      },
      "short_bio": "Kuzan, better known by his alias Aokiji, is one of the Ten Titanic Captains of the Blackbeard Pirates, serving as the captain of the tenth ship of the fleet. Before joining Blackbeard's crew, he served as a Marine Admiral, having been taught by Monkey D. Garp. He was nominated by Sengoku for the position of Fleet Admiral; however, after fighting Sakazuki for the position and losing, Kuzan resigned from the Marines. Kuzan was the antagonist of the second part of the Long Ring Long Land Arc; in the anime, he is instead one of the main antagonists of the Foxy's Return Arc. He is later a secondary antagonist of the Marineford Arc, a minor antagonist in the Egghead Arc, and a major antagonist in the Final Saga."
    },
    {
      "name": "Pappag",
      "birthday": "09-21",
      "romanized_name": "Pappagu",
      "affiliation": "civilian",
      "role": "Fashion Designer; Takoyaki seller; Pet",
      "haki": [],
      "origin": "Grand Line (Ryugu Kingdom, Fish-Man Island)",
      "age": 33,
      "height": "50 cm (1'7\")",
      "image": "Pappag-(Pappagu).png",
      "short_bio": "Pappag is a starfish who is Camie's pet and teacher. He is the creator of the Criminal fashion line and is mentoring Camie to be a fashion designer."
    },
    {
      "name": "Kyros",
      "birthday": "09-22",
      "romanized_name": "Kyurosu",
      "affiliation": "civilian",
      "role": "Gladiator (former); Riku Royal Army Captain (former)",
      "bounty": "Unknown (as Thunder Soldier)",
      "haki": [],
      "origin": "Grand Line (Dressrosa)",
      "age": 44,
      "height": "298 cm (9'9\")",
      "image": "Kyros.png",
      "short_bio": "Kyros is a legendary gladiator who fought in the Corrida Colosseum until he left to become captain of the royal army of Dressrosa. He was later turned into a toy, causing everyone to forget his existence, becoming a One-Legged Soldier, also known as the \"Thunder Soldier of Rage\". He is the former captain of the Riku Royal Army, the father of Rebecca, the husband of Scarlett, and the son-in-law of Riku Doldo III. He spent ten years as a toy before being freed by the success of his own Operation SOP. After helping bring down the Donquixote Pirates, Kyros currently lives with Rebecca. He is an ally of the Straw Hat Pirates during the Dressrosa Arc."
    },
    {
      "name": "Hanger",
      "birthday": "09-23",
      "romanized_name": "Hangā",
      "affiliation": "civilian",
      "role": "Salesperson",
      "haki": [],
      "origin": "East Blue",
      "image": "Hanger.png",
      "short_bio": "Hanger is an employee at Robecca Hanberg, a clothing store in Loguetown. Nami tried on all of his best clothes, but did not buy any."
    },
    {
      "name": "Orochi",
      "birthday": "09-23",
      "romanized_name": "Kurozumi Orochi",
      "affiliation": "Wano Country (Kurozumi Family); Beasts Pirates (former)",
      "role": "Shogun of Wano Country (former)",
      "devil_fruit": {
        "name": "Hebi Hebi no Mi, Model: Yamata no Orochi",
        "type": "Mythical Zoan",
        "power": "Allows him to transform into a eight-headed snake and a human-eight-headed snake hybrid at will. Can survive decapitation up to 8 times."
      },
      "haki": [],
      "origin": "Grand Line (Wano Country)",
      "age": 54,
      "height": "350 cm (11'6\")",
      "image": "Kurozumi-Orochi.png",
      "short_bio": "Kurozumi Orochi was the former shogun of Wano Country and one of the last members of the Kurozumi Family. Persecuted in his youth due to his grandfather's failed attempt to seize the shogunate from the Kouzuki Family, Orochi encountered some relatives who helped him formulate another attempt to become shogun. This plan succeeded, with Orochi deposing the Kouzuki Family around three decades before the present day after allying with Kaidou of the Four Emperors. Orochi ruled Wano tyrannically until he was deposed by none other than Kaidou, who betrayed him to seize Wano for himself; Orochi survived Kaidou's attack and tried to kill everyone on Onigashima out of spite but was then killed after two encounters with the Kouzuki Family's Nine Red Scabbards who he knew had been prophesied to overthrow him. Due to his actions and role, he is the secondary antagonist of the first half and a supporting antagonist in the second half of the Wano Country Arc, and one of the major antagonists of the Wano Country Saga overall."
    },
    {
      "name": "Umit",
      "birthday": "09-23",
      "affiliation": "civilian",
      "short_bio": "\"Deep-Sea Currents\" Umit is a magnate who presides Umit Shipping and one of the emperors of the Underworld."
    },
    {
      "name": "Black Maria",
      "birthday": "09-24",
      "romanized_name": "Burakkumaria",
      "affiliation": "civilian",
      "role": "Shinuchi; Brothel owner",
      "bounty": "480,000,000",
      "haki": [],
      "origin": "Wano Country",
      "age": 29,
      "height": "820 cm (26'11\")",
      "image": "Black-Maria.png",
      "image_offset": {
        "x": 27,
        "y": 5
      },
      "short_bio": "Black Maria is one of the Tobiroppo, the strongest six Shinuchi of the Beasts Pirates. She owns her own brothel on Onigashima near Kaidou's castle. Due to her actions and role, she is a supporting antagonist in the Wano Country Arc."
    },
    {
      "name": "Jean Goen",
      "birthday": "09-24",
      "romanized_name": "Jan Goen",
      "affiliation": "civilian",
      "role": "Prisoner",
      "bounty": "Less than 15,000,000",
      "haki": [],
      "origin": "Grand Line",
      "image": "Jean-Goen-(Dez-Tinny).png",
      "image_offset": {
        "x": 29,
        "y": 5
      },
      "short_bio": "Jean Goen is a prisoner on Level 1 of Impel Down."
    },
    {
      "name": "Suu",
      "birthday": "09-24",
      "romanized_name": "Sū",
      "affiliation": "Skypiea",
      "role": "Pet",
      "haki": [],
      "origin": "Sky Islands (Skypiea)",
      "image": "Su-(Suu).png",
      "image_offset": {
        "x": 50,
        "y": 0
      },
      "short_bio": "Suu (Funimation)}} :The subject of this article is sometimes romanized as Suu. Su is a Cloud Fox and pet of Conis."
    },
    {
      "name": "Terracotta",
      "birthday": "09-25",
      "affiliation": "civilian",
      "short_bio": "Terracotta is Igaram's wife and the royal head chef who appeared very late in the Arabasta Arc. She is also the royal seamstress. Her friend and helper is Maidy."
    },
    {
      "name": "Cosmos",
      "birthday": "09-26",
      "romanized_name": "Kosumosu",
      "affiliation": "civilian",
      "role": "Pirate",
      "haki": [],
      "origin": "Calm Belt (Amazon Lily)",
      "image": "Cosmos.png",
      "image_offset": {
        "x": 50,
        "y": 0
      },
      "short_bio": "Cosmos is a member of the Kuja Pirates."
    },
    {
      "name": "Dagama",
      "birthday": "09-26",
      "affiliation": "civilian",
      "short_bio": "Dagama is the tactician of the Prodence Kingdom. He joined as a gladiator at the Corrida Colosseum to compete for the Mera Mera no Mi. He is an ally of Luffy during the Dressrosa Arc."
    },
    {
      "name": "Mr. 9",
      "birthday": "09-27",
      "romanized_name": "Misutā Nain",
      "affiliation": "Baroque Works (former)",
      "role": "Frontier Agent (former); Bounty Hunter",
      "haki": [],
      "origin": "Grand Line",
      "image": "Mr.-9.png",
      "short_bio": "Mr. 9 is the code name of a former Frontier Agent and bounty hunter of Baroque Works, and Miss Wednesday's former assigned partner during her infiltration. Due to his actions, he is one of the main antagonists of the Reverse Mountain Arc, and a supporting antihero in the Whisky Peak Arc. After the fall of Baroque Works, he stayed at Whisky Peak, and eventually bore a son with Miss Monday."
    },
    {
      "name": "Jack",
      "birthday": "09-28",
      "romanized_name": "Jakku",
      "epithet": "\"Jack the Drought\" (旱害のジャック, Kangai no Jakku?)",
      "affiliation": "civilian",
      "role": "All-Star; Captain of the Mammoth; De Facto Ruler of Kuri (former)",
      "bounty": "1,000,000,000",
      "haki": [],
      "origin": "Grand Line",
      "age": 28,
      "height": "830 cm (27'3\")",
      "image": "Jack.png",
      "image_offset": {
        "x": 26,
        "y": 5
      },
      "short_bio": "Jack the Drought is a giant grouper fish-man, an All-Star of the Beasts Pirates as one of Kaidou's three closest confidants, and captain of the Mammoth, prior to its destruction. He was formerly the ruler of Kuri region in Wano Country. He was first briefly mentioned when being notified of Caesar Clown's capture by viewers of Caesar's broadcast of the Punk Hazard incident. Due to his actions and role, he is the main antagonist of the Zou Arc, and a major antagonist in the Wano Country Arc."
    },
    {
      "name": "Stalker",
      "birthday": "09-28",
      "romanized_name": "Sutōkā",
      "affiliation": "civilian",
      "role": "Marine Lieutenant Junior Grade",
      "bounty": "At least 1,000,000",
      "haki": [],
      "origin": "Grand Line",
      "image": "Stalker.png",
      "image_offset": {
        "x": 62,
        "y": 5
      },
      "short_bio": "Lieutenant Junior Grade Stalker is a Marine on Vice Admiral Momonga's ship."
    },
    {
      "name": "Charlotte Cabaletta",
      "birthday": "09-29",
      "affiliation": "civilian",
      "short_bio": "Charlotte Cabaletta is the eighth son and the 13th child of the Charlotte Family and the fourth quintuplet brother of Opera, Counter, Cadenza, and Gala. He is also an officer of the Big Mom Pirates."
    },
    {
      "name": "Charlotte Cadenza",
      "birthday": "09-29",
      "affiliation": "civilian",
      "short_bio": "Charlotte Cadenza is the seventh son and the twelfth child of the Charlotte Family and the third quintuplet brother of Opera, Counter, Cabaletta, and Gala. He is also an officer of the Big Mom Pirates."
    },
    {
      "name": "Charlotte Counter",
      "birthday": "09-29",
      "affiliation": "civilian",
      "short_bio": "Charlotte Counter is the sixth son and the 11th child of the Charlotte Family and the second quintuplet brother of Opera, Cadenza, Cabaletta, and Gala. He is also an officer of the Big Mom Pirates."
    },
    {
      "name": "Charlotte Gala",
      "birthday": "09-29",
      "romanized_name": "Shārotto Gara",
      "affiliation": "civilian",
      "haki": [],
      "age": 46,
      "image": "Charlotte-Lola.png",
      "short_bio": "Charlotte Gala is the ninth son and the 14th child of the Charlotte Family and the youngest quintuplet brother of Opera, Counter, Cadenza, and Cabaletta."
    },
    {
      "name": "Charlotte Opera",
      "birthday": "09-29",
      "affiliation": "civilian",
      "short_bio": "Charlotte Opera is the fifth son and the tenth child of the Charlotte Family and is the eldest quintuplet brother of Counter, Cadenza, Cabaletta, and Gala. He also is an officer of the Big Mom Pirates and served as Totto Land's Minister of Whipped Cream, governing over Noko Island. His current status is unknown after having his lifespan removed by a rampaging Big Mom. Due to his actions and role, he is a supporting antagonist during the Whole Cake Island Arc."
    },
    {
      "name": "Drug Peclo",
      "birthday": "09-29",
      "affiliation": "civilian",
      "short_bio": "Drug Peclo, also known as the Major Undertaker, is an emperor of the Underworld."
    },
    {
      "name": "Pinky",
      "birthday": "09-29",
      "romanized_name": "Pinkī",
      "epithet": "Monstrous Bird",
      "affiliation": "civilian",
      "haki": [],
      "origin": "East Blue",
      "image": "Pinky.png",
      "image_offset": {
        "x": 27,
        "y": 5
      },
      "short_bio": "Monstrous Bird Pinky is a giant bird that appeared in the Orange Town Arc. He is classified as a Type C creature, \"Big Savage\"."
    },
    {
      "name": "Avalo Pizarro",
      "birthday": "09-30",
      "romanized_name": "Abaro Pisaro",
      "epithet": "Corrupt King",
      "affiliation": "Blackbeard Pirates",
      "role": "Titanic Captain (Captain of the Fourth Ship)",
      "bounty": "Unknown",
      "devil_fruit": {
        "name": "Shima Shima no Mi",
        "type": "Paramecia",
        "power": "Allows him to assimilate his body into an island itself and control its natural environment and artificial structures."
      },
      "haki": [
        "Busoshoku",
        "Kenbunshoku"
      ],
      "origin": "North Blue",
      "age": 42,
      "height": "505 cm (16'6\")",
      "image": "Avalo-Pizarro.png",
      "image_offset": {
        "x": 22,
        "y": 5
      },
      "short_bio": "Avalo Pizarro, also known as the \"Corrupt King\", is one of the Ten Titanic Captains of the Blackbeard Pirates, serving as the captain of the fourth ship of the fleet. Prior to his life of crime, he was once a king of a North Blue kingdom that eventually overthrew him for his despotic ways. He was then imprisoned in Impel Down and given a life sentence in Level 6, as his crimes were so atrocious, he had to effectively be erased from history. He has since been freed by Marshall D. Teach and has become a member of his crew. Due to his actions and role, he is a supporting antagonist in the Marineford Arc, a minor antagonist in the Egghead Arc, and a major antagonist in the Final Saga."
    },
    {
      "name": "Gecko Moria",
      "birthday": "09-06",
      "affiliation": "unknown",
      "bounty": "320000000",
      "devil_fruit": {
        "name": "Fruit of the Shadow",
        "japanese_name": "Kage Kage no Mi",
        "type": "Paramecia",
        "power": "Allows its user to control shadows. He can cut the shadows of anyone with a pair of scissors, and the shadows thus removed can be locked into inert bodies, giving rise to zombies possessing the combat techniques of the person to whom the shadow belonged. If shadows are enclosed in the body of a living being, they can only remain for a short time, depending on the latter's mental strength. For example, its user has consumed up to 1000 of them. It should also be noted that the user can use his own shadow and make it tangible. He can therefore use his shadow to teleport or protect himself from physical attacks."
      },
      "age": "50",
      "image": "Gecko-Moria-(Moriah).png",
      "short_bio": "Gecko Moria is the captain of the Thriller Bark Pirates and a former member of the Seven Warlords of the Sea who resides on Thriller Bark, the largest ship in the world. His bounty is 320,000,000, which was frozen until he lost his Warlord position. In his youth, Moria served as captain of the Gecko Pirates, until a vast majority of its members were killed in a fight against Kaidou of the Four Emperors. This traumatic event led Moria to seek power through an army of zombies, constructed by his subordinate, Dr. Hogback. To that end he stole the shadows of several beings with his Kage Kage no Mi powers, including Brook and several members of the Straw Hat Pirates, bringing him into conflict with them. His zombie army was ultimately destroyed and the captured shadows set free after his defeat, but he retained his position as a Warlord and escaped Thriller Bark with the remnants of his crew. He took part in the Summit War of Marineford and sided with the Marines along with most of the other Warlords. After the end of the war, he was stripped of his title and was to be eliminated by Donquixote Doflamingo, but he managed to escape into the New World. Vegapunk later cloned Moria as one of the Seraphim to replace the Warlords. Two years after the war, he attacked the Blackbeard Pirates on Hachinosu, but was defeated and imprisoned when he refused to join Blackbeard. He was later rescued by Perona with the help of Koby. He is the main antagonist of the Thriller Bark Saga and a major antagonist in the Marineford Arc."
    },
    {
      "name": "Kikunojo",
      "birthday": "09-09",
      "affiliation": "civilian",
      "age": "22",
      "image": "Kikunojo-(Okiku)-(scary-mask).png",
      "short_bio": "Kikunojo of the Lingering Snow, more commonly referred to as Kiku, is a samurai from Wano Country and a retainer for the Kouzuki Family, serving as one of Kouzuki Oden's Nine Red Scabbards. She is also the younger sister of Izou and the daughter of the dancing school head of the Hanayanagi School in Ringo. After traveling forward in time, she worked as a tea house poster girl in Okobore Town while gathering information for the planned rebellion. She participated in the Raid on Onigashima where she battled Kaidou alongside the other Scabbards, losing her left arm to one of Kaidou's attacks. Following Kouzuki Momonosuke's ascent to shogun, she serves as the daimyo of Ringo. She is an ally of the Straw Hat Pirates during the Wano Country Arc."
    },
    {
      "name": "T Bone",
      "birthday": "09-10",
      "affiliation": "navy",
      "bounty": "500,000,000",
      "age": "53",
      "short_bio": "\"Ship Cutter\" T Bone was a Marine Vice Admiral. As a Marine Captain two years ago, he was a minor antagonist during the Water 7 Arc and confronted the Straw Hat Pirates on the Sea Train route to Enies Lobby. Prior to joining the Marines, he was a royal knight. Sometime around the Egghead Arc, T Bone was killed in the Pepe Kingdom for the bounty he received from the Cross Guild."
    },
    {
      "name": "Kurozumi Orochi",
      "birthday": "09-23",
      "haki": [],
      "image": "Kurozumi-Orochi-(edited).png",
      "short_bio": "Kurozumi Orochi was the former shogun of Wano Country and one of the last members of the Kurozumi Family. Persecuted in his youth due to his grandfather's failed attempt to seize the shogunate from the Kouzuki Family, Orochi encountered some relatives who helped him formulate another attempt to become shogun. This plan succeeded, with Orochi deposing the Kouzuki Family around three decades before the present day after allying with Kaidou of the Four Emperors. Orochi ruled Wano tyrannically until he was deposed by none other than Kaidou, who betrayed him to seize Wano for himself; Orochi survived Kaidou's attack and tried to kill everyone on Onigashima out of spite but was then killed after two encounters with the Kouzuki Family's Nine Red Scabbards who he knew had been prophesied to overthrow him. Due to his actions and role, he is the secondary antagonist of the first half and a supporting antagonist in the second half of the Wano Country Arc, and one of the major antagonists of the Wano Country Saga overall."
    },
    {
      "name": "Shimotsuki Kuina",
      "birthday": "09-17",
      "haki": [],
      "image": "Shimotsuki-Kuina-(edited).png",
      "short_bio": "Shimotsuki Kuina was a childhood friend, relative and rival of Roronoa Zoro. She was the daughter of Shimotsuki Koushirou and the granddaughter of Shimotsuki Kouzaburou making her a descendant of Wano Country's famed Shimotsuki Family. Her death at the age of eleven drove much of Zoro's ambitions as a swordsman, including his development of the Three Sword Style."
    }
  ]
}