{
  "characters": [
    {
      "name": "Heat",
      "birthday": "12-01",
      "romanized_name": "Hīto",
      "affiliation": "civilian",
      "role": "Pirate",
      "haki": [],
      "origin": "South Blue (Kutsukku Island)",
      "image": "Heat.png",
      "short_bio": "Heat is a member of the Kid Pirates.",
      "japanese_name": "ヒート",
      "status": "unknown"
    },
    {
      "name": "Ipponume",
      "birthday": "12-01",
      "romanized_name": "Ippon'ume",
      "affiliation": "civilian",
      "role": "Arms Shop Proprietress",
      "haki": [],
      "origin": "East Blue",
      "image": "Ipponume-(Ippon-Ume).png",
      "short_bio": "Ipponume is Ipponmatsu's wife.",
      "japanese_name": "いっぽんウメ",
      "status": "alive"
    },
    {
      "name": "Charlotte Akimeg",
      "birthday": "12-02",
      "affiliation": "civilian",
      "short_bio": "Charlotte Akimeg is the 31st daughter and 71st child of the Charlotte Family and the seventh of the Charlotte Decuplets to be born. She is also an officer of the Big Mom Pirates.",
      "status": "alive"
    },
    {
      "name": "Charlotte Allmeg",
      "birthday": "12-02",
      "affiliation": "civilian",
      "short_bio": "Charlotte Allmeg is the 32nd daughter and 72nd child of the Charlotte Family and the eighth of the Charlotte Decuplets to be born. She is also an officer of the Big Mom Pirates.",
      "status": "alive"
    },
    {
      "name": "Charlotte Fuyumeg",
      "birthday": "12-02",
      "affiliation": "civilian",
      "short_bio": "Charlotte Fuyumeg is the 34th daughter and 74th child of the Charlotte Family and the tenth of the Charlotte Decuplets to be born. She is also an officer of the Big Mom Pirates.",
      "status": "alive"
    },
    {
      "name": "Charlotte Harumeg",
      "birthday": "12-02",
      "affiliation": "civilian",
      "short_bio": "Charlotte Harumeg is the 33rd daughter and 73rd child of the Charlotte Family and the ninth of the Charlotte Decuplets to be born. She is also an officer of the Big Mom Pirates.",
      "status": "alive"
    },
    {
      "name": "Charlotte Nutmeg",
      "birthday": "12-02",
      "affiliation": "civilian",
      "short_bio": "Charlotte Nutmeg is the 30th daughter and 70th child of the Charlotte Family and the sixth of the Charlotte Decuplets to be born. She is also an officer of the Big Mom Pirates.",
      "status": "alive"
    },
    {
      "name": "Kaneshiro",
      "birthday": "12-02",
      "romanized_name": "Kaneshiro",
      "affiliation": "civilian",
      "role": "Pirate; Shipwright",
      "haki": [],
      "origin": "Grand Line (Ryugu Kingdom, Fish-Man Island)",
      "image": "Kaneshiro.png",
      "short_bio": "Kaneshiro is the shipwright of the Arlong Pirates and a goldfish fish-man. He was previously a member of the Sun Pirates.",
      "japanese_name": "カネシロ",
      "status": "alive"
    },
    {
      "name": "Napoleon",
      "birthday": "12-02",
      "affiliation": "civilian",
      "short_bio": "Napoleon the Bicorne is a homie taking the form of a bicorne hat that is worn by Big Mom. He can also become a sword homie that Big Mom uses in combat. He is a special kind of homie, as he received a soul fragment from Big Mom herself, and serves as one of her personal weapons alongside Prometheus and Hera, and formerly Zeus.",
      "status": "alive"
    },
    {
      "name": "Bell-mère",
      "birthday": "12-03",
      "romanized_name": "Berumēru",
      "affiliation": "Marines (former)",
      "role": "Mikan Farmer; Marine Officer (former)",
      "haki": [],
      "origin": "East Blue (Conomi Islands)",
      "age": 30,
      "height": "186 cm (6'1\")",
      "image": "Bell-mère-(Bellemere,-Bell-mere).png",
      "image_offset": {
        "x": 50,
        "y": 0
      },
      "short_bio": "Bell-mère was a former Marine and the adoptive mother of Nami and Nojiko. She raised the two girls in Cocoyasi Village for approximately nine years until she was murdered by Arlong.",
      "japanese_name": "ベルメール",
      "status": "deceased"
    },
    {
      "name": "Jorl",
      "birthday": "12-04",
      "romanized_name": "Yoruru",
      "epithet": "\"Waterfall Beard\" Jorul (滝ひげのヨルル, Takihige no Yoruru?, VIZ: Beardfall)",
      "affiliation": "civilian",
      "role": "Pirate Captain (former)",
      "haki": [],
      "origin": "Grand Line (Elbaph)",
      "height": "2150 cm (70'6\")",
      "image": "Jorul.png",
      "image_offset": {
        "x": 50,
        "y": 0
      },
      "short_bio": "\"Waterfall Beard\" Jorul was a giant and former co-captain of the Giant Warrior Pirates, along with Jarul. He was known as a hero of the giants and one of the world's oldest warriors. 63 years ago, Jorul was mortally wounded during an attempt to stop a young, rampaging Charlotte Linlin, leading to his eventual death soon after.",
      "japanese_name": "ヨルル",
      "status": "deceased"
    },
    {
      "name": "Indigo",
      "birthday": "12-05",
      "affiliation": "civilian",
      "short_bio": "Dr. Indigo is the scientist of the Golden Lion Pirates and the secondary antagonist of the tenth One Piece movie. He is the one who created Boss and the other monstrous animals under Shiki's dominion.",
      "status": "alive"
    },
    {
      "name": "Igaram",
      "birthday": "12-06",
      "romanized_name": "Igaramu",
      "affiliation": "civilian",
      "role": "Captain of the Royal Guard; Frontier Agent (former); Bounty Hunter (former); Mayor of Whisky Peak (undercover, former)",
      "haki": [],
      "origin": "Grand Line (Arabasta Kingdom)",
      "age": 50,
      "height": "218 cm (7'1\")",
      "image": "Igaram-(Mr.-8).png",
      "image_offset": {
        "x": 50,
        "y": 0
      },
      "short_bio": "Igaram is the captain of the Arabasta royal guard (captain of Arabasta security in the English dub). He aided Nefertari Vivi in infiltrating Baroque Works as a Frontier Agent and took on the codename Mr. 8. He was partnered with Miss Monday. He is also Terracotta's husband. He is an ally of the Straw Hat Pirates during the Whisky Peak (after being a minor antagonist) and Arabasta Arcs.",
      "japanese_name": "イガラム",
      "status": "alive"
    },
    {
      "name": "Ikkaku",
      "birthday": "12-07",
      "affiliation": "civilian",
      "short_bio": "Ikkaku is a member of the Heart Pirates.",
      "status": "alive"
    },
    {
      "name": "Yuda Snakes",
      "birthday": "12-07",
      "romanized_name": "Yuda",
      "affiliation": "Kuja",
      "role": "Sea Serpent",
      "haki": [],
      "origin": "Calm Belt",
      "image": "Yuda-Snakes.png",
      "short_bio": "This page lists all animal species encountered in the Summit War Saga.",
      "japanese_name": "遊蛇",
      "status": "alive"
    },
    {
      "name": "Jarul",
      "birthday": "12-08",
      "affiliation": "civilian",
      "image": "Jarul-(edited).png",
      "image_offset": {
        "x": 32,
        "y": 0
      },
      "short_bio": "\"Mountain Beard\" Jarul is a giant and former co-captain of the Giant Warrior Pirates, alongside Jorul. Along with Jorul, he is known as a hero of the giants, and after Jorul's death, Jarul is currently the oldest giant in the world. He has a great-great-granddaughter, Ylva, who is a student at the Walrus School.",
      "status": "alive"
    },
    {
      "name": "Maskeredomo Bird",
      "birthday": "12-08",
      "affiliation": "civilian",
      "status": "alive"
    },
    {
      "name": "Kelly Funk",
      "birthday": "12-09",
      "romanized_name": "Kerī Fanku",
      "affiliation": "Mogaro Kingdom",
      "role": "Assassin",
      "bounty": "57,000,000",
      "devil_fruit": {
        "name": "Jake Jake no Mi",
        "type": "Paramecia",
        "power": "Allows him to transform into a full body jacket."
      },
      "haki": [],
      "origin": "Grand Line (Mogaro Kingdom)",
      "age": 36,
      "height": "168 cm (5'6\")",
      "image": "Kelly-Funk-(solo).png",
      "short_bio": "Kelly Funk is an assassin from the Mogaro Kingdom and Bobby Funk's older brother. He joined as a gladiator at the Corrida Colosseum to compete for the Mera Mera no Mi.",
      "japanese_name": "ケリー・ファンク",
      "status": "alive"
    },
    {
      "name": "Packy",
      "birthday": "12-09",
      "romanized_name": "Koze to Pakkī",
      "affiliation": "civilian",
      "role": "Pirates",
      "haki": [],
      "origin": "East Blue",
      "image": "Packy.png",
      "short_bio": "Koze and Packy were members of the Yes Pirates.",
      "japanese_name": "コゼ & パッキー",
      "status": "alive"
    },
    {
      "name": "Tacos",
      "birthday": "12-09",
      "affiliation": "civilian",
      "short_bio": "Tacos is the king of the Shishano Kingdom and one of fifty monarchs who took part in the Levely.",
      "status": "alive"
    },
    {
      "name": "Charlotte Amande",
      "birthday": "12-10",
      "affiliation": "civilian",
      "short_bio": "\"Demon Lady\" Charlotte Amande is the third daughter and seventh child of the Charlotte Family, the second quadruplet sister to Mondée, Hachée, and Effilée, and a snakeneck-human hybrid. She also is an officer of the Big Mom Pirates and serves as Totto Land's Minister of Nuts, governing over Nuts Island. Due to her actions and role, she is a supporting antagonist in the Whole Cake Island Arc.",
      "status": "alive"
    },
    {
      "name": "Charlotte Effilée",
      "birthday": "12-10",
      "affiliation": "civilian",
      "short_bio": "Charlotte Effilée is the fifth daughter and ninth child of the Charlotte Family, the youngest quadruplet sister of Mondée, Amande, and Hachée, and a snakeneck-human hybrid. She is also an officer of the Big Mom Pirates.",
      "status": "alive"
    },
    {
      "name": "Charlotte Hachée",
      "birthday": "12-10",
      "affiliation": "civilian",
      "short_bio": "Charlotte Hachée is the fourth daughter and eighth child of the Charlotte Family, the third quadruplet sister to Mondée, Amande, and Effilée, and a snakeneck-human hybrid. She is also an officer of the Big Mom Pirates.",
      "status": "alive"
    },
    {
      "name": "Charlotte Mondée",
      "birthday": "12-10",
      "affiliation": "civilian",
      "short_bio": "Charlotte Mondée is the second daughter and sixth child of the Charlotte Family, the eldest quadruplet sister of Amande, Hachée, and Effilée, and a snakeneck-human hybrid. She is also an officer of the Big Mom Pirates.",
      "status": "alive"
    },
    {
      "name": "Edward Weevil",
      "birthday": "12-10",
      "romanized_name": "Edowādo Wīburu",
      "affiliation": "civilian",
      "role": "Pirate",
      "bounty": "480,000,000",
      "haki": [],
      "origin": "Grand Line",
      "age": 35,
      "height": "680 cm (22'4\")",
      "image": "Edward-Weevil-(Whitebeard-Jr.).png",
      "short_bio": "Edward Weevil, or \"Whitebeard Jr.\", is a pirate and self-proclaimed son of the late Edward \"Whitebeard\" Newgate. He is the son of Buckingham Stussy, the self-proclaimed lover of Newgate. He was initiated into the Seven Warlords of the Sea sometime during the two-year timeskip, and served in their ranks until the Warlords' dissolution. Weevil was first mentioned by Marine commodore Brannew in a discussion of the, at-time, current Warlord ranks to several high-ranking Marine officers, but was not explicitly named until after Donquixote Doflamingo's defeat.",
      "japanese_name": "エドワード・ウィーブル",
      "status": "alive"
    },
    {
      "name": "Mr. Shimizu",
      "birthday": "12-11",
      "romanized_name": "Shimizu",
      "affiliation": "Baroque Works",
      "role": "Millions Agent",
      "haki": [],
      "origin": "Grand Line",
      "image": "Mr.-Shimizu.png",
      "short_bio": "Baroque Works was a criminal syndicate created by the Warlord Crocodile to destabilize and conquer the Arabasta Kingdom (and, by extension, acquire the ancient superweapon Pluton). For this sole purpose, it conducted countless acts of espionage, sabotage, and murder over a span of years, ultimately manipulating Arabasta into civil war. While the syndicate mostly employed common bounty hunters and mercenaries (motivated by the half-truth that they were building a new, \"ideal\" nation), its elite members contained significantly skilled combatants and spies. Despite multiple setbacks, its endgame Operation Utopia nearly succeeded in every objective, and was only narrowly stopped by the combined efforts of Princess Nefertari Vivi, the Straw Hat Pirates, and a unit of Marines led by then-Captain Smoker. After Operation Utopia's failure, the syndicate was exposed and dismantled, with Crocodile and most of his subordinates—many personally defeated by the Straw Hats—arrested by the Marines. In years to come, however, many of them would escape and continue to impact world events. Due to their actions and role, they are collectively the main antagonists of the Arabasta Saga, with varying members being the focus of each individual arc (excluding the Drum Island Arc). Several ex-members also serve as the protagonists of the Miss Goldenweek's \"Operation: Meet Baroque Works\" cover arc, and supporting characters in the Impel Down Arc and Marineford Arc.",
      "japanese_name": "シミズ",
      "status": "unknown"
    },
    {
      "name": "Rock",
      "birthday": "12-11",
      "romanized_name": "Rokku",
      "epithet": "Killers of the Snowy Mountain",
      "affiliation": "Caesar Clown",
      "role": "Mercenary; Assassin",
      "bounty": "20,000,000",
      "haki": [],
      "origin": "Grand Line",
      "age": 25,
      "height": "4250 cm (139'5\")",
      "image": "Rock.png",
      "image_offset": {
        "x": 50,
        "y": 3
      },
      "short_bio": "The Yeti Cool Brothers are Rock and Scotch, a pair of giant assassins who were employed by Caesar Clown. They are members of a mysterious type of giant. They serve as supporting antagonists of the Punk Hazard Arc.",
      "japanese_name": "ロック",
      "status": "unknown"
    },
    {
      "name": "Scotch",
      "birthday": "12-11",
      "romanized_name": "Sukotchi",
      "epithet": "Iron Boy",
      "affiliation": "Beasts Pirates",
      "role": "Pirate",
      "haki": [],
      "image": "Scotch.png",
      "image_offset": {
        "x": 50,
        "y": 3
      },
      "short_bio": "\"Iron Boy\" Scotch is a member of the Beasts Pirates working as the guardian of one of the former Emperor Kaidou's favorite islands.",
      "japanese_name": "スコッチ",
      "status": "unknown"
    },
    {
      "name": "Speed",
      "birthday": "12-11",
      "romanized_name": "Supīdo",
      "affiliation": "civilian",
      "role": "Shinuchi",
      "haki": [],
      "origin": "Grand Line (Wano Country)",
      "age": 24,
      "height": "298 cm (9'9\")",
      "image": "Speed.png",
      "short_bio": "Speed is a former Shinuchi of the Beasts Pirates stationed in Bakura Town. She has since become a subordinate to Kurozumi Tama due to the latter's Devil Fruit powers and became an ally of the Ninja-Pirate-Mink-Samurai Alliance. She has been dubbed Umami by Tama and Monkey D. Luffy.",
      "japanese_name": "スピード",
      "status": "alive"
    },
    {
      "name": "Chinjao",
      "birthday": "12-12",
      "romanized_name": "Chinjao",
      "epithet": "Don Chinjao (首領（ドン）・チンジャオ, Don Chinjao?);\"Chinjao the Drill\" (錐のチンジャオ, Kiri no Chinjao?)",
      "affiliation": "civilian",
      "role": "12th Leader of the Happo Navy; Pirate (former)",
      "bounty": "542,000,000",
      "haki": [],
      "origin": "West Blue (Kano Country)",
      "age": 78,
      "height": "520 cm (17'1\")",
      "image": "Chinjao-(Qing-Jiao,-Don-Chin-Jao).png",
      "image_offset": {
        "x": 65,
        "y": 5
      },
      "short_bio": "Chinjao, formerly known as \"Don Chinjao\" and \"Chinjao the Drill\", is a former pirate, the leader of the Chinjao Family, and the retired 12th leader of the Happo Navy. He also joined as a gladiator at the Corrida Colosseum to compete for the Mera Mera no Mi. He has a bounty of 542,000,000. Although at first he confronted Luffy for his hatred against Garp, he became his ally during the Dressrosa Arc.",
      "japanese_name": "チンジャオ",
      "status": "alive"
    },
    {
      "name": "King",
      "birthday": "12-01",
      "romanized_name": "Kingu",
      "epithet": "\"King the Conflagration\" (火災のキング, Kasai no Kingu?, English versions: \"King the Wildfire\")",
      "affiliation": "civilian",
      "role": "All-Star",
      "bounty": "1,390,000,000",
      "haki": [],
      "origin": "Grand Line",
      "age": 47,
      "height": "613 cm (20'1\")",
      "image": "King.png",
      "short_bio": "King the Conflagration is one of the three All-Stars of the Beasts Pirates and Kaidou's right-hand man. Born as Arber, he is a member of the near-extinct lunarian race from the Red Line, noted for their ability to create fire. He was a prisoner and test subject on Punk Hazard 34 years ago, where a sample of his Lineage Factor was extracted from him before he was freed and recruited by Kaidou. That same genetic material would be used by Dr. Vegapunk decades later as a key component in the creation of the Seraphim. Due to his actions and role, he is a major antagonist in the Wano Country Arc.",
      "japanese_name": "キング",
      "status": "alive"
    },
    {
      "name": "Nezumi",
      "birthday": "12-12",
      "romanized_name": "Nezumi",
      "affiliation": "Marines",
      "role": "Marine Captain",
      "bounty": "100,000,000",
      "haki": [],
      "origin": "East Blue",
      "age": 36,
      "height": "182 cm (5'11¾\")",
      "image": "Nezumi.png",
      "image_offset": {
        "x": 15,
        "y": 5
      },
      "short_bio": "Captain Nezumi is a Marine captain of the 16th Branch in the East Blue. Highly corrupt, he covered up the vast majority of Arlong's actions in the Conomi Islands in exchange for bribe money. Due to his actions, he can be considered the secondary antagonist of the Arlong Park Arc. He is also the one responsible for officially making Monkey D. Luffy a wanted criminal to the World Government by requesting his first ever bounty.",
      "japanese_name": "ネズミ",
      "status": "alive"
    },
    {
      "name": "Faust",
      "birthday": "12-13",
      "romanized_name": "Fausuto",
      "affiliation": "civilian",
      "role": "Pirate; Magician",
      "haki": [],
      "origin": "North Blue",
      "image": "Faust.png",
      "short_bio": "Faust is a cat mink from North Blue and a member of the Hawkins Pirates, serving as the crew's magician.",
      "japanese_name": "ファウスト",
      "status": "alive"
    },
    {
      "name": "St. Mjosgard",
      "birthday": "12-13",
      "affiliation": "civilian",
      "status": "alive"
    },
    {
      "name": "Pica",
      "birthday": "12-14",
      "romanized_name": "Pīka",
      "affiliation": "civilian",
      "role": "Pirate Executive Officer",
      "bounty": "99,000,000",
      "haki": [],
      "origin": "North Blue",
      "age": 40,
      "height": "470 cm (15'5\")",
      "image": "Pica.png",
      "short_bio": "Pica is one of the top three officers of the Donquixote Pirates. He occupies the Spade seat of the Donquixote Family and is the leader of the crew's Pica Army subdivision. Due to his actions and role, he is one of the major antagonists in the Dressrosa Arc.",
      "japanese_name": "ピーカ",
      "status": "alive"
    },
    {
      "name": "Charlotte Noisette",
      "birthday": "12-15",
      "affiliation": "civilian",
      "short_bio": "Charlotte Noisette is the 15th son and 24th child of the Charlotte Family and an officer of the Big Mom Pirates. He also serves as Totto Land's Minister of Finance, governing over Kinko Island.",
      "status": "alive"
    },
    {
      "name": "Nerine",
      "birthday": "12-15",
      "romanized_name": "Nerine",
      "affiliation": "Kuja",
      "role": "Warrior",
      "haki": [
        "Busoshoku"
      ],
      "origin": "Calm Belt (Amazon Lily)",
      "image": "Nerine.png",
      "short_bio": "Nerine is a member of the Kuja from Amazon Lily.",
      "japanese_name": "ネリネ",
      "status": "alive"
    },
    {
      "name": "Charlotte Cornstarch",
      "birthday": "12-16",
      "affiliation": "civilian",
      "short_bio": "Charlotte Cornstarch is the 11th daughter and 27th child of the Charlotte Family and the younger triplet sister of Moscato and Mash. She also is an officer of the Big Mom Pirates and serves as Totto Land's Minister of Love, governing over Loving Island.",
      "status": "alive"
    },
    {
      "name": "Charlotte Mash",
      "birthday": "12-16",
      "affiliation": "civilian",
      "short_bio": "Charlotte Mash is the tenth daughter and 26th child of the Charlotte Family and the middle triplet sister of Moscato and Cornstarch. She is also an officer of the Big Mom Pirates.",
      "status": "alive"
    },
    {
      "name": "Charlotte Moscato",
      "birthday": "12-16",
      "affiliation": "civilian",
      "short_bio": "Charlotte Moscato is the 16th son and 25th child of the Charlotte Family and the eldest triplet brother of Mash and Cornstarch. He also is an officer of the Big Mom Pirates and serves as Totto Land's Minister of Gelato, governing over Ice Island.",
      "status": "alive"
    },
    {
      "name": "Inuppe",
      "birthday": "12-16",
      "romanized_name": "Inuppe",
      "affiliation": "civilian",
      "role": "Wild Zombie",
      "haki": [],
      "image": "Inuppe-(Dog-Penguin).png",
      "short_bio": "Inuppe was a Wild Zombie on Thriller Bark in the service of Gecko Moria. He was animated with Sanji's shadow and eventually assigned to guard Hogback. Due to his actions and role, he is a supporting antagonist in the Thriller Bark Arc.",
      "japanese_name": "犬ッペ",
      "status": "deceased"
    },
    {
      "name": "Banchina",
      "birthday": "12-17",
      "romanized_name": "Bankīna",
      "affiliation": "civilian",
      "haki": [],
      "origin": "East Blue (Syrup Village)",
      "image": "Banchina-(Bankina).png",
      "short_bio": "Banchina was Usopp's mother and Yasopp's wife. She died of a sickness in Syrup Village when Usopp was still young.",
      "japanese_name": "バンキーナ",
      "status": "deceased"
    },
    {
      "name": "Yuki",
      "birthday": "12-17",
      "romanized_name": "Yuki",
      "affiliation": "civilian",
      "haki": [],
      "origin": "Grand Line",
      "image": "Yuki.png",
      "short_bio": "Yuki was a young girl over 100 years ago. She was responsible for starting the century-long duel between Dorry and Brogy.",
      "japanese_name": "ユキ",
      "status": "unknown"
    },
    {
      "name": "Byron",
      "birthday": "12-18",
      "romanized_name": "Bairon",
      "affiliation": "civilian",
      "role": "Musician; Pirate; Slave",
      "haki": [],
      "origin": "West Blue",
      "age": 25,
      "height": "192 cm (6'3½\")",
      "image": "Byron.png",
      "short_bio": "Byron is one of the slaves who was sold at the Human Auctioning House and was the first in the queue for sale. He is a pirate and musician.",
      "japanese_name": "バイロン",
      "status": "alive"
    },
    {
      "name": "Zunisha",
      "birthday": "12-18",
      "romanized_name": "Zunīsha",
      "affiliation": "Joy Boy (former)",
      "role": "Naitamie-Norida elephant carrying Zou",
      "haki": [],
      "origin": "Grand Line",
      "age": 1000,
      "height": "Over 5 km (3.1 miles)",
      "image": "Zunesha.png",
      "image_offset": {
        "x": 23,
        "y": 5
      },
      "short_bio": "Zunesha is a Naitamie-Norida elephant that was affiliated with Joy Boy 800 years ago. It now wanders through the New World and carries the island of Zou on its back as punishment for an unspecified crime it committed in the past.",
      "japanese_name": "象主",
      "status": "alive"
    },
    {
      "name": "Dogra",
      "birthday": "12-19",
      "affiliation": "civilian",
      "short_bio": "Dogra is a member of Dadan's bandits that are active on Mt. Colubo on Dawn Island. He helped take care of Ace and Luffy for Garp.",
      "status": "alive"
    },
    {
      "name": "Hogback",
      "birthday": "12-19",
      "romanized_name": "Hogubakku",
      "epithet": "\"Doctor Hogback\" (ドクトル・ホグバック, Dokutoru Hogubakku?)\"Genius Surgeon\" (天才外科医, Tensai Gekai?)",
      "affiliation": "civilian",
      "role": "Doctor",
      "haki": [],
      "origin": "West Blue",
      "age": 47,
      "height": "223 cm (7'4\")",
      "image": "Hogback.png",
      "image_offset": {
        "x": 50,
        "y": 0
      },
      "short_bio": "Doctor Hogback is the world-renowned \"Genius Surgeon\" who joined the Thriller Bark Pirates under the employment of Gecko Moria and assisted him in creating his undead army. He was one of the Mysterious Four and the secondary antagonist of the Thriller Bark Saga. He also acts as the de facto main antagonist in the anime only Great Mikoshi Race Arc.",
      "japanese_name": "ホグバック",
      "status": "alive"
    },
    {
      "name": "Charlotte Marnier",
      "birthday": "12-20",
      "affiliation": "civilian",
      "short_bio": "Charlotte Marnier is the 13th daughter and 32nd child of the Charlotte Family and the younger twin sister of Mozart. She also is an officer of the Big Mom Pirates and serves as Totto Land's Minister of Yeast, governing over Kibo Island.",
      "status": "alive"
    },
    {
      "name": "Charlotte Mozart",
      "birthday": "12-20",
      "affiliation": "civilian",
      "short_bio": "Charlotte Mozart is the 12th daughter and 31st child of the Charlotte Family and the elder twin sister of Marnier. She is also an officer of the Big Mom Pirates.",
      "status": "alive"
    },
    {
      "name": "Louis Arnote",
      "birthday": "12-20",
      "romanized_name": "Rui Ānōto",
      "affiliation": "civilian",
      "role": "Explorer",
      "haki": [],
      "origin": "Grand Line",
      "image": "Louis-Arnote-(Louis-Arnot,-Brag-Men).png",
      "short_bio": "Louis Arnote is an explorer and one of the people whose adventures are recorded in Brag Men, a book of Grand Line tales. Arnote is famous for giving Little Garden its name. Though implied to be a true tale due to its inclusion in Brag Men, it is considered by the rest of the world to be a mere fantasy. Arnote also visited Elbaph and wrote a description of its grandeur, though he warned people not to overstay their welcome for as of yet unknown reasons.",
      "japanese_name": "ルイ・アーノート",
      "status": "unknown"
    },
    {
      "name": "Mother Carmel",
      "birthday": "12-21",
      "romanized_name": "Karumeru",
      "epithet": "\"Holy Mother\" (聖母, Seibo?)",
      "affiliation": "civilian",
      "role": "Child Trafficker; Caretaker of Sheep's House",
      "haki": [],
      "origin": "West Blue",
      "height": "185 cm (6'1)",
      "image": "Carmel-(old).png",
      "short_bio": "Mother Carmel was a child trafficker dealing in orphans, that operated in the Underworld several decades ago, under the code name of \"Mountain Witch\". Running an orphanage known as the \"Sheep's House\", her seemingly benevolent nature caused her to be known as the \"Holy Mother\". In reality, she sold her orphan wards to the World Government every two years to be trained as Marines or Cipher Pol agents, until she met her end 62 years ago. Notably, she took care of a young Charlotte Linlin, who would later go on to become the Emperor Big Mom.",
      "japanese_name": "カルメル",
      "status": "deceased"
    },
    {
      "name": "Gan Fall",
      "birthday": "12-22",
      "romanized_name": "Gan Fōru",
      "epithet": "\"Knight of the Sky\" (空の騎士, Sora no Kishi?, VIZ and Funimation: Sky Knight, 4Kids: Sky Lord)",
      "affiliation": "civilian",
      "role": "God of Skypiea; Mercenary (former)",
      "haki": [],
      "origin": "Grand Line (Skypiea)",
      "age": 68,
      "height": "180 cm (5'11\")",
      "image": "Gan-Fall-(Ganfor)-(solo).png",
      "image_offset": {
        "x": 26,
        "y": 10
      },
      "short_bio": "Gan Fall is the current God of Skypiea. A venerable figure who served in that role for decades, he was overthrown by Enel and cast out of power for six years. During his exile, he roamed the sky as a mercenary known as the Knight of the Sky. He is an ally of the Straw Hat Pirates during the Skypiea Arc.",
      "japanese_name": "ガン・フォール",
      "status": "alive"
    },
    {
      "name": "Miyagi",
      "birthday": "12-22",
      "affiliation": "civilian",
      "short_bio": "Miyagi is a goat mink and one of Inuarashi's subjects,until Carrot took the throne of Mokomo Dukedom.",
      "status": "alive"
    },
    {
      "name": "Kouzuki Hiyori",
      "birthday": "12-23",
      "romanized_name": "Kōzuki Hiyori",
      "affiliation": "Kouzuki Family",
      "role": "Oiran",
      "haki": [],
      "origin": "Grand Line (Moby Dick)",
      "age": 26,
      "height": "170 cm (5'7\")",
      "image": "Kozuki-Hiyori.png",
      "image_offset": {
        "x": 32,
        "y": 5
      },
      "short_bio": "Kouzuki Hiyori is the daughter of the late Kouzuki Oden and Kouzuki Toki and the younger sister of Kouzuki Momonosuke. To hide her identity, Hiyori became known as Komurasaki, working as an oiran of the rank, the highest of all. However, after she angered Kurozumi Orochi, Denjiro (in his disguise as Kyoshiro) staged a killing of Komurasaki in order to keep Hiyori safe. She is the one who gave her late father's legendary sword Enma to Roronoa Zoro in exchange for Shusui. After Kaidou was defeated in the Raid on Onigashima, she revealed to Wano that she was still alive as well as her true identity. Hiyori now lives in the Flower Capital with her brother after he became the new Shogun. She is also the caretaker of Toko. Hiyori is a supporting ally of the Straw Hat Pirates during the Wano Country Saga.",
      "japanese_name": "光月日和",
      "status": "alive"
    },
    {
      "name": "Tony Tony Chopper",
      "birthday": "12-24",
      "romanized_name": "Tonī Tonī Choppā",
      "epithet": "\"Cotton Candy Lover\" (わたあめ大好き, Wataame Daisuki?)",
      "affiliation": "Straw Hat Pirates",
      "role": "Doctor; Senior Officer",
      "bounty": "1,00010050",
      "devil_fruit": {
        "name": "Human-Human Fruit",
        "japanese_name": "ヒトヒトの実",
        "type": "Zoan",
        "power": "Human transformation and intelligence"
      },
      "haki": [],
      "origin": "Grand Line (Drum Island)",
      "age": 17,
      "height": "90 cm (2'11\") (hybrid form)",
      "image": "Tony-Tony-Chopper.png",
      "short_bio": "Tony Tony Chopper, also known as \"Cotton Candy Lover\" Chopper, is the doctor of the Straw Hat Pirates and one of the Senior Officers of the Straw Hat Grand Fleet. He is the sixth member of the crew and the fifth to join, doing so at the end of the Drum Island Arc. He was temporarily forced to join the Foxy Pirates during the Long Ring Long Land Arc but was quickly returned to Luffy's crew. Chopper is a reindeer that ate the Hito Hito no Mi, a Devil Fruit that allows its user to transform into a human hybrid at will. He was taught medicine on Drum Island by his two parental figures, Doctors Hiriluk and Kureha. Chopper aims to travel all across the world in the hopes of accomplishing his dream of being able to cure any disease. Chopper gained his first bounty of 50 after the incident at Enies Lobby, having been mistaken for the Straw Hats' pet. After the Dressrosa Arc, it was increased to 100, then to 1,000 following the Raid on Onigashima.",
      "japanese_name": "トニートニー・チョッパー",
      "status": "alive"
    },
    {
      "name": "Jesus Burgess",
      "birthday": "12-25",
      "romanized_name": "Jīzasu Bājesu",
      "epithet": "\"Champion\" (チャンピオン, Chanpion?)",
      "affiliation": "civilian",
      "role": "Titanic Captain (Captain of the First Ship); Helmsman",
      "bounty": "At least 20,000,000",
      "haki": [],
      "origin": "Grand Line",
      "age": 29,
      "height": "355 cm (11'8\")",
      "image": "Jesus-Burgess.png",
      "short_bio": "Jesus Burgess, better known as the \"Champion\", is the helmsman and one of the Ten Titanic Captains of the Blackbeard Pirates, serving as the captain of the first ship of the fleet. Due to his actions and role, he is a minor antagonist in the Jaya Arc, a supporting antagonist in the Impel Down, Marineford, and Dressrosa Arcs, a minor antagonist in the Egghead Arc, and a major antagonist in the Final Saga.",
      "japanese_name": "ジーザス・バージェス",
      "status": "alive"
    },
    {
      "name": "Miss Merry Christmas",
      "birthday": "12-25",
      "romanized_name": "Dorofī",
      "epithet": "Town-Collapser",
      "affiliation": "Baroque Works (former)",
      "role": "Officer Agent (former); Cafe Waitress",
      "bounty": "14,000,000",
      "devil_fruit": {
        "name": "Mogu Mogu no Mi",
        "type": "Zoan",
        "power": "Allows her to transform into a mole or a mole-human hybrid."
      },
      "haki": [],
      "origin": "Grand Line",
      "age": 51,
      "height": "156 cm (5'1\")",
      "image": "Drophy-(Miss-Merry-Christmas).png",
      "short_bio": "\"Town-Collapser\" Drophy, better known by her alias Miss Merry Christmas, is a former officer agent partnered with Mr. 4. She was a major antagonist during the Arabasta Arc. After the downfall of Baroque Works, she works as a \"princess\" at the new Spiders Cafe alongside most of her former colleagues.",
      "japanese_name": "ドロフィー",
      "status": "alive"
    },
    {
      "name": "Charlotte Broyé",
      "birthday": "12-26",
      "affiliation": "civilian",
      "image": "Charlotte_Broy.png",
      "image_offset": {
        "x": 21,
        "y": 5
      },
      "short_bio": "Charlotte Broyé is the ninth daughter and 20th child of the Charlotte Family and the younger twin sister of Brûlée. She is also an officer of the Big Mom Pirates and serves as Totto Land's Minister of Meringue, governing over Milenge Island.",
      "status": "alive"
    },
    {
      "name": "Mashikaku",
      "birthday": "12-26",
      "romanized_name": "Mashikaku",
      "affiliation": "civilian",
      "role": "Marine Chief Petty Officer",
      "bounty": "At least 100,000",
      "haki": [],
      "origin": "East Blue",
      "image": "Mashikaku.png",
      "short_bio": "Chief Petty Officer Mashikaku is a subordinate of Smoker and Tashigi. However, it is unknown if he remained with the two after they transferred to G-5 as he is not seen with the G-5 Marines.",
      "japanese_name": "マシカク",
      "status": "alive"
    },
    {
      "name": "Akumai",
      "birthday": "12-27",
      "romanized_name": "Akumai",
      "affiliation": "civilian",
      "haki": [],
      "origin": "Grand Line",
      "image": "Akumai.png",
      "short_bio": "Akumai was a Billions agent who followed Mr. 2 Bon Kurei everywhere before he was captured by Hina when Mr. 2 and his crew sacrificed themselves to save the Straw Hat Pirates.",
      "japanese_name": "アクマイ",
      "status": "alive"
    },
    {
      "name": "Lines",
      "birthday": "12-27",
      "romanized_name": "Rainzu",
      "affiliation": "civilian",
      "role": "Marine Seaman First Class",
      "bounty": "At least 100,000",
      "haki": [],
      "origin": "East Blue",
      "image": "Lines.png",
      "short_bio": "Seaman First Class Lines is a former subordinate of Fullbody from his time as a lieutenant.",
      "japanese_name": "ラインズ",
      "status": "alive"
    },
    {
      "name": "Jango",
      "birthday": "12-28",
      "romanized_name": "Jango",
      "epithet": "\"One-Two\" Jango (as a pirate) (1・2のジャンゴ, Ichi Ni no Jango?);\"Jango the Turncoat\" (Marine) (寝返りのジャンゴ, Negaeri no Jango?)",
      "affiliation": "civilian",
      "role": "Marine Lieutenant Commander; Marine Seaman Recruit (promoted); Pirate (former); Captain (former), First Mate (former), Dancer (former)",
      "bounty": "(At least 1,000,000)9,000,000",
      "haki": [],
      "origin": "East Blue",
      "age": 29,
      "height": "207 cm (6’9½”)",
      "image": "Jango-(Django).png",
      "image_offset": {
        "x": 50,
        "y": 0
      },
      "short_bio": "The subject of this article is sometimes called Django. Jango the Turncoat is a hypnotist and Marine lieutenant commander serving under Rear Admiral Hina. Formerly the first mate—and for a time captain—of the Black Cat Pirates known as \"One-Two\" Jango, he enlisted in the Marines after finding an unlikely friendship with Fullbody, who helped him to secure a pardon. Due to his actions, Jango can be considered the secondary antagonist of the Syrup Village Arc. He is also the protagonist of the Jango's Dance Paradise cover arc.",
      "japanese_name": "ジャンゴ",
      "status": "alive"
    },
    {
      "name": "Lu Feld",
      "birthday": "12-29",
      "affiliation": "civilian",
      "short_bio": "Lu Feld, known as the \"God of Fortune\", is the \"Loan Shark King\". He is a member of the Lu Feld Conglomerate, the former financer of MADS, and an emperor of the Underworld.",
      "status": "alive"
    },
    {
      "name": "Absalom",
      "birthday": "12-30",
      "romanized_name": "Abusaromu",
      "epithet": "Absalom of the Graveyard (墓場のアブサロム, Hakaba no Abusaromu?)",
      "affiliation": "civilian",
      "role": "ReporterSoldier Zombies and General Zombies Commander",
      "haki": [],
      "origin": "West Blue",
      "age": 36,
      "height": "195 cm (6'5\")",
      "image": "absalom.png",
      "image_offset": {
        "x": 67,
        "y": 5
      },
      "short_bio": "Absalom of the Graveyard was the commander of the Soldier Zombies and General Zombies of Thriller Bark prior to its collapse. He was one of the Mysterious Four of the Thriller Bark Pirates and one of the major antagonists of the Thriller Bark Saga. Sometime during the timeskip, he became a reporter under the alias Absa. At some point, he was abducted by the Blackbeard Pirates and killed to poach his Devil Fruit powers, with his ability going to Shiryu.",
      "japanese_name": "アブサロム",
      "status": "deceased"
    },
    {
      "name": "Gol D. Roger",
      "birthday": "12-31",
      "romanized_name": "Gōru Dī Rojā",
      "epithet": "Pirate King (海賊王, Kaizoku-Ō?, King of the Pirates (English versions))",
      "affiliation": "Roger Pirates",
      "role": "Pirate Captain",
      "bounty": "5,564,800,000",
      "haki": [],
      "origin": "East Blue (Loguetown)",
      "height": "274 cm (9'0\")",
      "image": "Gol-D.-Roger.png",
      "image_offset": {
        "x": 18,
        "y": 5
      },
      "short_bio": "Gol D. Roger, more commonly known as Gold Roger, was a legendary pirate who, as captain of the Roger Pirates, held the title of Pirate King and possessed the legendary treasure known as the One Piece. He was also the lover of Portgas D. Rouge and the biological father of Portgas D. Ace. Roger was the first pirate in history since Joy Boy to circumnavigate the Grand Line, culminating in reaching its final island which he named Laugh Tale. However, knowing that his life was limited by an incurable disease, Roger disbanded his crew and turned himself in to be executed. Though the World Government staged the execution as a public spectacle to discourage piracy, Roger used his final words to ensure the opposite, openly declaring that the One Piece belonged to anyone that could find it. As such, he singlehandedly began the Great Pirate Era. Because of his past actions and achievements, Roger is a central background character in the series as a whole.",
      "japanese_name": "ゴール・D（ディー）・ロジャー",
      "status": "deceased"
    },
    {
      "name": "Drophy",
      "birthday": "12-25",
      "affiliation": "unknown",
      "bounty": "14000000",
      "devil_fruit": {
        "name": "Digging Fruit",
        "japanese_name": "Mogu Mogu no Mi",
        "type": "Zoan",
        "power": "whoever eats it becomes half-mole. It can dig gigantic galleries in almost any material."
      },
      "age": "51",
      "image": "Drophy-(Miss-Merry-Christmas).png",
      "short_bio": "\"Town-Collapser\" Drophy, better known by her alias Miss Merry Christmas, is a former officer agent partnered with Mr. 4. She was a major antagonist during the Arabasta Arc. After the downfall of Baroque Works, she works as a \"princess\" at the new Spiders Cafe alongside most of her former colleagues.",
      "status": "alive"
    },
    {
      "name": "Zunesha",
      "birthday": "12-18",
      "affiliation": "unknown",
      "age": "1 000",
      "image": "Zunesha-(edited).png",
      "short_bio": "Zunesha is a Naitamie-Norida elephant that was affiliated with Joy Boy 800 years ago. It now wanders through the New World and carries the island of Zou on its back as punishment for an unspecified crime it committed in the past.",
      "status": "alive"
    },
    {
      "name": "Carmel",
      "birthday": "12-21",
      "haki": [],
      "image": "Carmel-(old).png",
      "short_bio": "Mother Carmel was a child trafficker dealing in orphans, that operated in the Underworld several decades ago, under the code name of \"Mountain Witch\". Running an orphanage known as the \"Sheep's House\", her seemingly benevolent nature caused her to be known as the \"Holy Mother\". In reality, she sold her orphan wards to the World Government every two years to be trained as Marines or Cipher Pol agents, until she met her end 62 years ago. Notably, she took care of a young Charlotte Linlin, who would later go on to become the Emperor Big Mom.",
      "status": "alive"
    },
    {
      "name": "Donquixote Mjosgard",
      "birthday": "12-13",
      "haki": [],
      "short_bio": "Saint Donquixote Mjosgard was a World Noble and member of the Donquixote Family, one of the 20 royal families that founded the World Government. After an attempt to recapture his freed fish-man slaves went awry, Mjosgard met Queen Otohime of Fish-Man Island's Ryugu Kingdom and became their ally and a supporter of their efforts to integrate with humans, opposing the extreme racism typically associated with the World Nobles' normal ideology. During the most recent Levely, he would directly oppose other World Nobles from threatening Otohime's family, which resulted in his execution.",
      "status": "alive"
    },
    {
      "name": "Jorul",
      "birthday": "12-04",
      "haki": [],
      "image": "Jorul-(edited).png",
      "image_offset": {
        "x": 50,
        "y": 0
      },
      "short_bio": "\"Waterfall Beard\" Jorul was a giant and former co-captain of the Giant Warrior Pirates, along with Jarul. He was known as a hero of the giants and one of the world's oldest warriors. 63 years ago, Jorul was mortally wounded during an attempt to stop a young, rampaging Charlotte Linlin, leading to his eventual death soon after.",
      "status": "alive"
    },
    {
      "name": "Yeti Cool Brothers",
      "birthday": "12-11",
      "haki": [],
      "short_bio": "The Yeti Cool Brothers are Rock and Scotch, a pair of giant assassins who were employed by Caesar Clown. They are members of a mysterious type of giant. They serve as supporting antagonists of the Punk Hazard Arc.",
      "status": "alive"
    }
  ]
}